zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_LBSSW_LBSSW7_MASK                   (0x80U)
#define STCU_LBSSW_LBSSW7_SHIFT                  (7U)
#define STCU_LBSSW_LBSSW7_WIDTH                  (1U)
#define STCU_LBSSW_LBSSW7(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW7_SHIFT)) & STCU_LBSSW_LBSSW7_MASK)

#define STCU_LBSSW_LBSSW8_MASK                   (0x100U)
#define STCU_LBSSW_LBSSW8_SHIFT                  (8U)
#define STCU_LBSSW_LBSSW8_WIDTH                  (1U)
#define STCU_LBSSW_LBSSW8(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW8_SHIFT)) & STCU_LBSSW_LBSSW8_MASK)

#define STCU_LBSSW_LBSSW9_MASK                   (0x200U)
#define STCU_LBSSW_LBSSW9_SHIFT                  (9U)
#define STCU_LBSSW_LBSSW9_WIDTH                  (1U)
#define STCU_LBSSW_LBSSW9(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW9_SHIFT)) & STCU_LBSSW_LBSSW9_MASK)

#define STCU_LBSSW_LBSSW10_MASK                  (0x400U)
#define STCU_LBSSW_LBSSW10_SHIFT                 (10U)
#define STCU_LBSSW_LBSSW10_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW10(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW10_SHIFT)) & STCU_LBSSW_LBSSW10_MASK)

#define STCU_LBSSW_LBSSW11_MASK                  (0x800U)
#define STCU_LBSSW_LBSSW11_SHIFT                 (11U)
#define STCU_LBSSW_LBSSW11_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW11(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW11_SHIFT)) & STCU_LBSSW_LBSSW11_MASK)

#define STCU_LBSSW_LBSSW12_MASK                  (0x1000U)
#define STCU_LBSSW_LBSSW12_SHIFT                 (12U)
#define STCU_LBSSW_LBSSW12_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW12(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW12_SHIFT)) & STCU_LBSSW_LBSSW12_MASK)

#define STCU_LBSSW_LBSSW13_MASK                  (0x2000U)
#define STCU_LBSSW_LBSSW13_SHIFT                 (13U)
#define STCU_LBSSW_LBSSW13_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW13(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW13_SHIFT)) & STCU_LBSSW_LBSSW13_MASK)

#define STCU_LBSSW_LBSSW14_MASK                  (0x4000U)
#define STCU_LBSSW_LBSSW14_SHIFT                 (14U)
#define STCU_LBSSW_LBSSW14_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW14(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW14_SHIFT)) & STCU_LBSSW_LBSSW14_MASK)

#define STCU_LBSSW_LBSSW15_MASK                  (0x8000U)
#define STCU_LBSSW_LBSSW15_SHIFT                 (15U)
#define STCU_LBSSW_LBSSW15_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW15(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW15_SHIFT)) & STCU_LBSSW_LBSSW15_MASK)

#define STCU_LBSSW_LBSSW16_MASK                  (0x10000U)
#define STCU_LBSSW_LBSSW16_SHIFT                 (16U)
#define STCU_LBSSW_LBSSW16_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW16(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW16_SHIFT)) & STCU_LBSSW_LBSSW16_MASK)

#define STCU_LBSSW_LBSSW17_MASK                  (0x20000U)
#define STCU_LBSSW_LBSSW17_SHIFT                 (17U)
#define STCU_LBSSW_LBSSW17_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW17(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW17_SHIFT)) & STCU_LBSSW_LBSSW17_MASK)

#define STCU_LBSSW_LBSSW18_MASK                  (0x40000U)
#define STCU_LBSSW_LBSSW18_SHIFT                 (18U)
#define STCU_LBSSW_LBSSW18_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW18(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW18_SHIFT)) & STCU_LBSSW_LBSSW18_MASK)

#define STCU_LBSSW_LBSSW19_MASK                  (0x80000U)
#define STCU_LBSSW_LBSSW19_SHIFT                 (19U)
#define STCU_LBSSW_LBSSW19_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW19(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW19_SHIFT)) & STCU_LBSSW_LBSSW19_MASK)

#define STCU_LBSSW_LBSSW20_MASK                  (0x100000U)
#define STCU_LBSSW_LBSSW20_SHIFT                 (20U)
#define STCU_LBSSW_LBSSW20_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW20(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW20_SHIFT)) & STCU_LBSSW_LBSSW20_MASK)

#define STCU_LBSSW_LBSSW21_MASK                  (0x200000U)
#define STCU_LBSSW_LBSSW21_SHIFT                 (21U)
#define STCU_LBSSW_LBSSW21_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW21(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW21_SHIFT)) & STCU_LBSSW_LBSSW21_MASK)

#define STCU_LBSSW_LBSSW22_MASK                  (0x400000U)
#define STCU_LBSSW_LBSSW22_SHIFT                 (22U)
#define STCU_LBSSW_LBSSW22_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW22(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW22_SHIFT)) & STCU_LBSSW_LBSSW22_MASK)

#define STCU_LBSSW_LBSSW23_MASK                  (0x800000U)
#define STCU_LBSSW_LBSSW23_SHIFT                 (23U)
#define STCU_LBSSW_LBSSW23_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW23(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW23_SHIFT)) & STCU_LBSSW_LBSSW23_MASK)

#define STCU_LBSSW_LBSSW24_MASK                  (0x1000000U)
#define STCU_LBSSW_LBSSW24_SHIFT                 (24U)
#define STCU_LBSSW_LBSSW24_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW24(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW24_SHIFT)) & STCU_LBSSW_LBSSW24_MASK)

#define STCU_LBSSW_LBSSW25_MASK                  (0x2000000U)
#define STCU_LBSSW_LBSSW25_SHIFT                 (25U)
#define STCU_LBSSW_LBSSW25_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW25(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW25_SHIFT)) & STCU_LBSSW_LBSSW25_MASK)

#define STCU_LBSSW_LBSSW26_MASK                  (0x4000000U)
#define STCU_LBSSW_LBSSW26_SHIFT                 (26U)
#define STCU_LBSSW_LBSSW26_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW26(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW26_SHIFT)) & STCU_LBSSW_LBSSW26_MASK)

#define STCU_LBSSW_LBSSW27_MASK                  (0x8000000U)
#define STCU_LBSSW_LBSSW27_SHIFT                 (27U)
#define STCU_LBSSW_LBSSW27_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW27(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW27_SHIFT)) & STCU_LBSSW_LBSSW27_MASK)

#define STCU_LBSSW_LBSSW28_MASK                  (0x10000000U)
#define STCU_LBSSW_LBSSW28_SHIFT                 (28U)
#define STCU_LBSSW_LBSSW28_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW28(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW28_SHIFT)) & STCU_LBSSW_LBSSW28_MASK)

#define STCU_LBSSW_LBSSW29_MASK                  (0x20000000U)
#define STCU_LBSSW_LBSSW29_SHIFT                 (29U)
#define STCU_LBSSW_LBSSW29_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW29(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW29_SHIFT)) & STCU_LBSSW_LBSSW29_MASK)

#define STCU_LBSSW_LBSSW30_MASK                  (0x40000000U)
#define STCU_LBSSW_LBSSW30_SHIFT                 (30U)
#define STCU_LBSSW_LBSSW30_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW30(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW30_SHIFT)) & STCU_LBSSW_LBSSW30_MASK)

#define STCU_LBSSW_LBSSW31_MASK                  (0x80000000U)
#define STCU_LBSSW_LBSSW31_SHIFT                 (31U)
#define STCU_LBSSW_LBSSW31_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW31(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW31_SHIFT)) & STCU_LBSSW_LBSSW31_MASK)

#define STCU_LBSSW_LBSSW32_MASK                  (0x1U)
#define STCU_LBSSW_LBSSW32_SHIFT                 (0U)
#define STCU_LBSSW_LBSSW32_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW32(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW32_SHIFT)) & STCU_LBSSW_LBSSW32_MASK)

