zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_LBSSW_LBSSW33_MASK                  (0x2U)
#define STCU_LBSSW_LBSSW33_SHIFT                 (1U)
#define STCU_LBSSW_LBSSW33_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW33(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW33_SHIFT)) & STCU_LBSSW_LBSSW33_MASK)

#define STCU_LBSSW_LBSSW34_MASK                  (0x4U)
#define STCU_LBSSW_LBSSW34_SHIFT                 (2U)
#define STCU_LBSSW_LBSSW34_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW34(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW34_SHIFT)) & STCU_LBSSW_LBSSW34_MASK)

#define STCU_LBSSW_LBSSW35_MASK                  (0x8U)
#define STCU_LBSSW_LBSSW35_SHIFT                 (3U)
#define STCU_LBSSW_LBSSW35_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW35(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW35_SHIFT)) & STCU_LBSSW_LBSSW35_MASK)

#define STCU_LBSSW_LBSSW36_MASK                  (0x10U)
#define STCU_LBSSW_LBSSW36_SHIFT                 (4U)
#define STCU_LBSSW_LBSSW36_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW36(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW36_SHIFT)) & STCU_LBSSW_LBSSW36_MASK)

#define STCU_LBSSW_LBSSW37_MASK                  (0x20U)
#define STCU_LBSSW_LBSSW37_SHIFT                 (5U)
#define STCU_LBSSW_LBSSW37_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW37(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW37_SHIFT)) & STCU_LBSSW_LBSSW37_MASK)

#define STCU_LBSSW_LBSSW38_MASK                  (0x40U)
#define STCU_LBSSW_LBSSW38_SHIFT                 (6U)
#define STCU_LBSSW_LBSSW38_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW38(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW38_SHIFT)) & STCU_LBSSW_LBSSW38_MASK)

#define STCU_LBSSW_LBSSW39_MASK                  (0x80U)
#define STCU_LBSSW_LBSSW39_SHIFT                 (7U)
#define STCU_LBSSW_LBSSW39_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW39(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW39_SHIFT)) & STCU_LBSSW_LBSSW39_MASK)

#define STCU_LBSSW_LBSSW40_MASK                  (0x100U)
#define STCU_LBSSW_LBSSW40_SHIFT                 (8U)
#define STCU_LBSSW_LBSSW40_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW40(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW40_SHIFT)) & STCU_LBSSW_LBSSW40_MASK)

#define STCU_LBSSW_LBSSW41_MASK                  (0x200U)
#define STCU_LBSSW_LBSSW41_SHIFT                 (9U)
#define STCU_LBSSW_LBSSW41_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW41(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW41_SHIFT)) & STCU_LBSSW_LBSSW41_MASK)

#define STCU_LBSSW_LBSSW42_MASK                  (0x400U)
#define STCU_LBSSW_LBSSW42_SHIFT                 (10U)
#define STCU_LBSSW_LBSSW42_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW42(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW42_SHIFT)) & STCU_LBSSW_LBSSW42_MASK)

#define STCU_LBSSW_LBSSW43_MASK                  (0x800U)
#define STCU_LBSSW_LBSSW43_SHIFT                 (11U)
#define STCU_LBSSW_LBSSW43_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW43(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW43_SHIFT)) & STCU_LBSSW_LBSSW43_MASK)

#define STCU_LBSSW_LBSSW44_MASK                  (0x1000U)
#define STCU_LBSSW_LBSSW44_SHIFT                 (12U)
#define STCU_LBSSW_LBSSW44_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW44(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW44_SHIFT)) & STCU_LBSSW_LBSSW44_MASK)

#define STCU_LBSSW_LBSSW45_MASK                  (0x2000U)
#define STCU_LBSSW_LBSSW45_SHIFT                 (13U)
#define STCU_LBSSW_LBSSW45_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW45(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW45_SHIFT)) & STCU_LBSSW_LBSSW45_MASK)

#define STCU_LBSSW_LBSSW46_MASK                  (0x4000U)
#define STCU_LBSSW_LBSSW46_SHIFT                 (14U)
#define STCU_LBSSW_LBSSW46_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW46(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW46_SHIFT)) & STCU_LBSSW_LBSSW46_MASK)

#define STCU_LBSSW_LBSSW47_MASK                  (0x8000U)
#define STCU_LBSSW_LBSSW47_SHIFT                 (15U)
#define STCU_LBSSW_LBSSW47_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW47(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW47_SHIFT)) & STCU_LBSSW_LBSSW47_MASK)

#define STCU_LBSSW_LBSSW48_MASK                  (0x10000U)
#define STCU_LBSSW_LBSSW48_SHIFT                 (16U)
#define STCU_LBSSW_LBSSW48_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW48(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW48_SHIFT)) & STCU_LBSSW_LBSSW48_MASK)

#define STCU_LBSSW_LBSSW49_MASK                  (0x20000U)
#define STCU_LBSSW_LBSSW49_SHIFT                 (17U)
#define STCU_LBSSW_LBSSW49_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW49(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW49_SHIFT)) & STCU_LBSSW_LBSSW49_MASK)

#define STCU_LBSSW_LBSSW50_MASK                  (0x40000U)
#define STCU_LBSSW_LBSSW50_SHIFT                 (18U)
#define STCU_LBSSW_LBSSW50_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW50(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW50_SHIFT)) & STCU_LBSSW_LBSSW50_MASK)

#define STCU_LBSSW_LBSSW51_MASK                  (0x80000U)
#define STCU_LBSSW_LBSSW51_SHIFT                 (19U)
#define STCU_LBSSW_LBSSW51_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW51(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW51_SHIFT)) & STCU_LBSSW_LBSSW51_MASK)

#define STCU_LBSSW_LBSSW52_MASK                  (0x100000U)
#define STCU_LBSSW_LBSSW52_SHIFT                 (20U)
#define STCU_LBSSW_LBSSW52_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW52(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW52_SHIFT)) & STCU_LBSSW_LBSSW52_MASK)

#define STCU_LBSSW_LBSSW53_MASK                  (0x200000U)
#define STCU_LBSSW_LBSSW53_SHIFT                 (21U)
#define STCU_LBSSW_LBSSW53_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW53(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW53_SHIFT)) & STCU_LBSSW_LBSSW53_MASK)

#define STCU_LBSSW_LBSSW54_MASK                  (0x400000U)
#define STCU_LBSSW_LBSSW54_SHIFT                 (22U)
#define STCU_LBSSW_LBSSW54_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW54(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW54_SHIFT)) & STCU_LBSSW_LBSSW54_MASK)

