zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_LBSSW_LBSSW55_MASK                  (0x800000U)
#define STCU_LBSSW_LBSSW55_SHIFT                 (23U)
#define STCU_LBSSW_LBSSW55_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW55(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW55_SHIFT)) & STCU_LBSSW_LBSSW55_MASK)

#define STCU_LBSSW_LBSSW56_MASK                  (0x1000000U)
#define STCU_LBSSW_LBSSW56_SHIFT                 (24U)
#define STCU_LBSSW_LBSSW56_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW56(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW56_SHIFT)) & STCU_LBSSW_LBSSW56_MASK)

#define STCU_LBSSW_LBSSW57_MASK                  (0x2000000U)
#define STCU_LBSSW_LBSSW57_SHIFT                 (25U)
#define STCU_LBSSW_LBSSW57_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW57(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW57_SHIFT)) & STCU_LBSSW_LBSSW57_MASK)

#define STCU_LBSSW_LBSSW58_MASK                  (0x4000000U)
#define STCU_LBSSW_LBSSW58_SHIFT                 (26U)
#define STCU_LBSSW_LBSSW58_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW58(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW58_SHIFT)) & STCU_LBSSW_LBSSW58_MASK)

#define STCU_LBSSW_LBSSW59_MASK                  (0x8000000U)
#define STCU_LBSSW_LBSSW59_SHIFT                 (27U)
#define STCU_LBSSW_LBSSW59_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW59(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW59_SHIFT)) & STCU_LBSSW_LBSSW59_MASK)

#define STCU_LBSSW_LBSSW60_MASK                  (0x10000000U)
#define STCU_LBSSW_LBSSW60_SHIFT                 (28U)
#define STCU_LBSSW_LBSSW60_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW60(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW60_SHIFT)) & STCU_LBSSW_LBSSW60_MASK)

#define STCU_LBSSW_LBSSW61_MASK                  (0x20000000U)
#define STCU_LBSSW_LBSSW61_SHIFT                 (29U)
#define STCU_LBSSW_LBSSW61_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW61(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW61_SHIFT)) & STCU_LBSSW_LBSSW61_MASK)

#define STCU_LBSSW_LBSSW62_MASK                  (0x40000000U)
#define STCU_LBSSW_LBSSW62_SHIFT                 (30U)
#define STCU_LBSSW_LBSSW62_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW62(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW62_SHIFT)) & STCU_LBSSW_LBSSW62_MASK)

#define STCU_LBSSW_LBSSW63_MASK                  (0x80000000U)
#define STCU_LBSSW_LBSSW63_SHIFT                 (31U)
#define STCU_LBSSW_LBSSW63_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW63(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW63_SHIFT)) & STCU_LBSSW_LBSSW63_MASK)

#define STCU_LBSSW_LBSSW64_MASK                  (0x1U)
#define STCU_LBSSW_LBSSW64_SHIFT                 (0U)
#define STCU_LBSSW_LBSSW64_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW64(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW64_SHIFT)) & STCU_LBSSW_LBSSW64_MASK)

#define STCU_LBSSW_LBSSW65_MASK                  (0x2U)
#define STCU_LBSSW_LBSSW65_SHIFT                 (1U)
#define STCU_LBSSW_LBSSW65_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW65(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW65_SHIFT)) & STCU_LBSSW_LBSSW65_MASK)

#define STCU_LBSSW_LBSSW66_MASK                  (0x4U)
#define STCU_LBSSW_LBSSW66_SHIFT                 (2U)
#define STCU_LBSSW_LBSSW66_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW66(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW66_SHIFT)) & STCU_LBSSW_LBSSW66_MASK)

#define STCU_LBSSW_LBSSW67_MASK                  (0x8U)
#define STCU_LBSSW_LBSSW67_SHIFT                 (3U)
#define STCU_LBSSW_LBSSW67_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW67(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW67_SHIFT)) & STCU_LBSSW_LBSSW67_MASK)

#define STCU_LBSSW_LBSSW68_MASK                  (0x10U)
#define STCU_LBSSW_LBSSW68_SHIFT                 (4U)
#define STCU_LBSSW_LBSSW68_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW68(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW68_SHIFT)) & STCU_LBSSW_LBSSW68_MASK)

#define STCU_LBSSW_LBSSW69_MASK                  (0x20U)
#define STCU_LBSSW_LBSSW69_SHIFT                 (5U)
#define STCU_LBSSW_LBSSW69_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW69(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW69_SHIFT)) & STCU_LBSSW_LBSSW69_MASK)

#define STCU_LBSSW_LBSSW70_MASK                  (0x40U)
#define STCU_LBSSW_LBSSW70_SHIFT                 (6U)
#define STCU_LBSSW_LBSSW70_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW70(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW70_SHIFT)) & STCU_LBSSW_LBSSW70_MASK)

#define STCU_LBSSW_LBSSW71_MASK                  (0x80U)
#define STCU_LBSSW_LBSSW71_SHIFT                 (7U)
#define STCU_LBSSW_LBSSW71_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW71(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW71_SHIFT)) & STCU_LBSSW_LBSSW71_MASK)

#define STCU_LBSSW_LBSSW72_MASK                  (0x100U)
#define STCU_LBSSW_LBSSW72_SHIFT                 (8U)
#define STCU_LBSSW_LBSSW72_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW72(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW72_SHIFT)) & STCU_LBSSW_LBSSW72_MASK)

#define STCU_LBSSW_LBSSW73_MASK                  (0x200U)
#define STCU_LBSSW_LBSSW73_SHIFT                 (9U)
#define STCU_LBSSW_LBSSW73_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW73(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW73_SHIFT)) & STCU_LBSSW_LBSSW73_MASK)

#define STCU_LBSSW_LBSSW74_MASK                  (0x400U)
#define STCU_LBSSW_LBSSW74_SHIFT                 (10U)
#define STCU_LBSSW_LBSSW74_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW74(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW74_SHIFT)) & STCU_LBSSW_LBSSW74_MASK)

#define STCU_LBSSW_LBSSW75_MASK                  (0x800U)
#define STCU_LBSSW_LBSSW75_SHIFT                 (11U)
#define STCU_LBSSW_LBSSW75_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW75(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW75_SHIFT)) & STCU_LBSSW_LBSSW75_MASK)

#define STCU_LBSSW_LBSSW76_MASK                  (0x1000U)
#define STCU_LBSSW_LBSSW76_SHIFT                 (12U)
#define STCU_LBSSW_LBSSW76_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW76(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW76_SHIFT)) & STCU_LBSSW_LBSSW76_MASK)

#define STCU_LBSSW_LBSSW77_MASK                  (0x2000U)
#define STCU_LBSSW_LBSSW77_SHIFT                 (13U)
#define STCU_LBSSW_LBSSW77_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW77(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW77_SHIFT)) & STCU_LBSSW_LBSSW77_MASK)

#define STCU_LBSSW_LBSSW78_MASK                  (0x4000U)
#define STCU_LBSSW_LBSSW78_SHIFT                 (14U)
#define STCU_LBSSW_LBSSW78_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW78(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW78_SHIFT)) & STCU_LBSSW_LBSSW78_MASK)

#define STCU_LBSSW_LBSSW79_MASK                  (0x8000U)
#define STCU_LBSSW_LBSSW79_SHIFT                 (15U)
#define STCU_LBSSW_LBSSW79_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW79(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW79_SHIFT)) & STCU_LBSSW_LBSSW79_MASK)

#define STCU_LBSSW_LBSSW80_MASK                  (0x10000U)
#define STCU_LBSSW_LBSSW80_SHIFT                 (16U)
#define STCU_LBSSW_LBSSW80_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW80(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW80_SHIFT)) & STCU_LBSSW_LBSSW80_MASK)

