zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_LBSSW_LBSSW81_MASK                  (0x20000U)
#define STCU_LBSSW_LBSSW81_SHIFT                 (17U)
#define STCU_LBSSW_LBSSW81_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW81(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW81_SHIFT)) & STCU_LBSSW_LBSSW81_MASK)

#define STCU_LBSSW_LBSSW82_MASK                  (0x40000U)
#define STCU_LBSSW_LBSSW82_SHIFT                 (18U)
#define STCU_LBSSW_LBSSW82_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW82(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW82_SHIFT)) & STCU_LBSSW_LBSSW82_MASK)

#define STCU_LBSSW_LBSSW83_MASK                  (0x80000U)
#define STCU_LBSSW_LBSSW83_SHIFT                 (19U)
#define STCU_LBSSW_LBSSW83_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW83(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW83_SHIFT)) & STCU_LBSSW_LBSSW83_MASK)

#define STCU_LBSSW_LBSSW84_MASK                  (0x100000U)
#define STCU_LBSSW_LBSSW84_SHIFT                 (20U)
#define STCU_LBSSW_LBSSW84_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW84(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW84_SHIFT)) & STCU_LBSSW_LBSSW84_MASK)

#define STCU_LBSSW_LBSSW85_MASK                  (0x200000U)
#define STCU_LBSSW_LBSSW85_SHIFT                 (21U)
#define STCU_LBSSW_LBSSW85_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW85(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW85_SHIFT)) & STCU_LBSSW_LBSSW85_MASK)

#define STCU_LBSSW_LBSSW86_MASK                  (0x400000U)
#define STCU_LBSSW_LBSSW86_SHIFT                 (22U)
#define STCU_LBSSW_LBSSW86_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW86(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW86_SHIFT)) & STCU_LBSSW_LBSSW86_MASK)

#define STCU_LBSSW_LBSSW87_MASK                  (0x800000U)
#define STCU_LBSSW_LBSSW87_SHIFT                 (23U)
#define STCU_LBSSW_LBSSW87_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW87(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW87_SHIFT)) & STCU_LBSSW_LBSSW87_MASK)

#define STCU_LBSSW_LBSSW88_MASK                  (0x1000000U)
#define STCU_LBSSW_LBSSW88_SHIFT                 (24U)
#define STCU_LBSSW_LBSSW88_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW88(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW88_SHIFT)) & STCU_LBSSW_LBSSW88_MASK)

#define STCU_LBSSW_LBSSW89_MASK                  (0x2000000U)
#define STCU_LBSSW_LBSSW89_SHIFT                 (25U)
#define STCU_LBSSW_LBSSW89_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW89(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW89_SHIFT)) & STCU_LBSSW_LBSSW89_MASK)

#define STCU_LBSSW_LBSSW90_MASK                  (0x4000000U)
#define STCU_LBSSW_LBSSW90_SHIFT                 (26U)
#define STCU_LBSSW_LBSSW90_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW90(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW90_SHIFT)) & STCU_LBSSW_LBSSW90_MASK)

#define STCU_LBSSW_LBSSW91_MASK                  (0x8000000U)
#define STCU_LBSSW_LBSSW91_SHIFT                 (27U)
#define STCU_LBSSW_LBSSW91_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW91(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW91_SHIFT)) & STCU_LBSSW_LBSSW91_MASK)

#define STCU_LBSSW_LBSSW92_MASK                  (0x10000000U)
#define STCU_LBSSW_LBSSW92_SHIFT                 (28U)
#define STCU_LBSSW_LBSSW92_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW92(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW92_SHIFT)) & STCU_LBSSW_LBSSW92_MASK)

#define STCU_LBSSW_LBSSW93_MASK                  (0x20000000U)
#define STCU_LBSSW_LBSSW93_SHIFT                 (29U)
#define STCU_LBSSW_LBSSW93_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW93(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW93_SHIFT)) & STCU_LBSSW_LBSSW93_MASK)

#define STCU_LBSSW_LBSSW94_MASK                  (0x40000000U)
#define STCU_LBSSW_LBSSW94_SHIFT                 (30U)
#define STCU_LBSSW_LBSSW94_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW94(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW94_SHIFT)) & STCU_LBSSW_LBSSW94_MASK)

#define STCU_LBSSW_LBSSW95_MASK                  (0x80000000U)
#define STCU_LBSSW_LBSSW95_SHIFT                 (31U)
#define STCU_LBSSW_LBSSW95_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW95(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW95_SHIFT)) & STCU_LBSSW_LBSSW95_MASK)

#define STCU_LBSSW_LBSSW96_MASK                  (0x1U)
#define STCU_LBSSW_LBSSW96_SHIFT                 (0U)
#define STCU_LBSSW_LBSSW96_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW96(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW96_SHIFT)) & STCU_LBSSW_LBSSW96_MASK)

#define STCU_LBSSW_LBSSW97_MASK                  (0x2U)
#define STCU_LBSSW_LBSSW97_SHIFT                 (1U)
#define STCU_LBSSW_LBSSW97_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW97(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW97_SHIFT)) & STCU_LBSSW_LBSSW97_MASK)

#define STCU_LBSSW_LBSSW98_MASK                  (0x4U)
#define STCU_LBSSW_LBSSW98_SHIFT                 (2U)
#define STCU_LBSSW_LBSSW98_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW98(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW98_SHIFT)) & STCU_LBSSW_LBSSW98_MASK)

#define STCU_LBSSW_LBSSW99_MASK                  (0x8U)
#define STCU_LBSSW_LBSSW99_SHIFT                 (3U)
#define STCU_LBSSW_LBSSW99_WIDTH                 (1U)
#define STCU_LBSSW_LBSSW99(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW99_SHIFT)) & STCU_LBSSW_LBSSW99_MASK)

#define STCU_LBSSW_LBSSW100_MASK                 (0x10U)
#define STCU_LBSSW_LBSSW100_SHIFT                (4U)
#define STCU_LBSSW_LBSSW100_WIDTH                (1U)
#define STCU_LBSSW_LBSSW100(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW100_SHIFT)) & STCU_LBSSW_LBSSW100_MASK)

#define STCU_LBSSW_LBSSW101_MASK                 (0x20U)
#define STCU_LBSSW_LBSSW101_SHIFT                (5U)
#define STCU_LBSSW_LBSSW101_WIDTH                (1U)
#define STCU_LBSSW_LBSSW101(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW101_SHIFT)) & STCU_LBSSW_LBSSW101_MASK)

#define STCU_LBSSW_LBSSW102_MASK                 (0x40U)
#define STCU_LBSSW_LBSSW102_SHIFT                (6U)
#define STCU_LBSSW_LBSSW102_WIDTH                (1U)
#define STCU_LBSSW_LBSSW102(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW102_SHIFT)) & STCU_LBSSW_LBSSW102_MASK)

#define STCU_LBSSW_LBSSW103_MASK                 (0x80U)
#define STCU_LBSSW_LBSSW103_SHIFT                (7U)
#define STCU_LBSSW_LBSSW103_WIDTH                (1U)
#define STCU_LBSSW_LBSSW103(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW103_SHIFT)) & STCU_LBSSW_LBSSW103_MASK)

#define STCU_LBSSW_LBSSW104_MASK                 (0x100U)
#define STCU_LBSSW_LBSSW104_SHIFT                (8U)
#define STCU_LBSSW_LBSSW104_WIDTH                (1U)
#define STCU_LBSSW_LBSSW104(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW104_SHIFT)) & STCU_LBSSW_LBSSW104_MASK)

#define STCU_LBSSW_LBSSW105_MASK                 (0x200U)
#define STCU_LBSSW_LBSSW105_SHIFT                (9U)
#define STCU_LBSSW_LBSSW105_WIDTH                (1U)
#define STCU_LBSSW_LBSSW105(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW105_SHIFT)) & STCU_LBSSW_LBSSW105_MASK)

