zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_LBSSW_LBSSW106_MASK                 (0x400U)
#define STCU_LBSSW_LBSSW106_SHIFT                (10U)
#define STCU_LBSSW_LBSSW106_WIDTH                (1U)
#define STCU_LBSSW_LBSSW106(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW106_SHIFT)) & STCU_LBSSW_LBSSW106_MASK)

#define STCU_LBSSW_LBSSW107_MASK                 (0x800U)
#define STCU_LBSSW_LBSSW107_SHIFT                (11U)
#define STCU_LBSSW_LBSSW107_WIDTH                (1U)
#define STCU_LBSSW_LBSSW107(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW107_SHIFT)) & STCU_LBSSW_LBSSW107_MASK)

#define STCU_LBSSW_LBSSW108_MASK                 (0x1000U)
#define STCU_LBSSW_LBSSW108_SHIFT                (12U)
#define STCU_LBSSW_LBSSW108_WIDTH                (1U)
#define STCU_LBSSW_LBSSW108(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW108_SHIFT)) & STCU_LBSSW_LBSSW108_MASK)

#define STCU_LBSSW_LBSSW109_MASK                 (0x2000U)
#define STCU_LBSSW_LBSSW109_SHIFT                (13U)
#define STCU_LBSSW_LBSSW109_WIDTH                (1U)
#define STCU_LBSSW_LBSSW109(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW109_SHIFT)) & STCU_LBSSW_LBSSW109_MASK)

#define STCU_LBSSW_LBSSW110_MASK                 (0x4000U)
#define STCU_LBSSW_LBSSW110_SHIFT                (14U)
#define STCU_LBSSW_LBSSW110_WIDTH                (1U)
#define STCU_LBSSW_LBSSW110(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW110_SHIFT)) & STCU_LBSSW_LBSSW110_MASK)

#define STCU_LBSSW_LBSSW111_MASK                 (0x8000U)
#define STCU_LBSSW_LBSSW111_SHIFT                (15U)
#define STCU_LBSSW_LBSSW111_WIDTH                (1U)
#define STCU_LBSSW_LBSSW111(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW111_SHIFT)) & STCU_LBSSW_LBSSW111_MASK)

#define STCU_LBSSW_LBSSW112_MASK                 (0x10000U)
#define STCU_LBSSW_LBSSW112_SHIFT                (16U)
#define STCU_LBSSW_LBSSW112_WIDTH                (1U)
#define STCU_LBSSW_LBSSW112(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW112_SHIFT)) & STCU_LBSSW_LBSSW112_MASK)

#define STCU_LBSSW_LBSSW113_MASK                 (0x20000U)
#define STCU_LBSSW_LBSSW113_SHIFT                (17U)
#define STCU_LBSSW_LBSSW113_WIDTH                (1U)
#define STCU_LBSSW_LBSSW113(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW113_SHIFT)) & STCU_LBSSW_LBSSW113_MASK)

#define STCU_LBSSW_LBSSW114_MASK                 (0x40000U)
#define STCU_LBSSW_LBSSW114_SHIFT                (18U)
#define STCU_LBSSW_LBSSW114_WIDTH                (1U)
#define STCU_LBSSW_LBSSW114(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW114_SHIFT)) & STCU_LBSSW_LBSSW114_MASK)

#define STCU_LBSSW_LBSSW115_MASK                 (0x80000U)
#define STCU_LBSSW_LBSSW115_SHIFT                (19U)
#define STCU_LBSSW_LBSSW115_WIDTH                (1U)
#define STCU_LBSSW_LBSSW115(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW115_SHIFT)) & STCU_LBSSW_LBSSW115_MASK)

#define STCU_LBSSW_LBSSW116_MASK                 (0x100000U)
#define STCU_LBSSW_LBSSW116_SHIFT                (20U)
#define STCU_LBSSW_LBSSW116_WIDTH                (1U)
#define STCU_LBSSW_LBSSW116(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW116_SHIFT)) & STCU_LBSSW_LBSSW116_MASK)

#define STCU_LBSSW_LBSSW117_MASK                 (0x200000U)
#define STCU_LBSSW_LBSSW117_SHIFT                (21U)
#define STCU_LBSSW_LBSSW117_WIDTH                (1U)
#define STCU_LBSSW_LBSSW117(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW117_SHIFT)) & STCU_LBSSW_LBSSW117_MASK)

#define STCU_LBSSW_LBSSW118_MASK                 (0x400000U)
#define STCU_LBSSW_LBSSW118_SHIFT                (22U)
#define STCU_LBSSW_LBSSW118_WIDTH                (1U)
#define STCU_LBSSW_LBSSW118(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW118_SHIFT)) & STCU_LBSSW_LBSSW118_MASK)

#define STCU_LBSSW_LBSSW119_MASK                 (0x800000U)
#define STCU_LBSSW_LBSSW119_SHIFT                (23U)
#define STCU_LBSSW_LBSSW119_WIDTH                (1U)
#define STCU_LBSSW_LBSSW119(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW119_SHIFT)) & STCU_LBSSW_LBSSW119_MASK)

#define STCU_LBSSW_LBSSW120_MASK                 (0x1000000U)
#define STCU_LBSSW_LBSSW120_SHIFT                (24U)
#define STCU_LBSSW_LBSSW120_WIDTH                (1U)
#define STCU_LBSSW_LBSSW120(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW120_SHIFT)) & STCU_LBSSW_LBSSW120_MASK)

#define STCU_LBSSW_LBSSW121_MASK                 (0x2000000U)
#define STCU_LBSSW_LBSSW121_SHIFT                (25U)
#define STCU_LBSSW_LBSSW121_WIDTH                (1U)
#define STCU_LBSSW_LBSSW121(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW121_SHIFT)) & STCU_LBSSW_LBSSW121_MASK)

#define STCU_LBSSW_LBSSW122_MASK                 (0x4000000U)
#define STCU_LBSSW_LBSSW122_SHIFT                (26U)
#define STCU_LBSSW_LBSSW122_WIDTH                (1U)
#define STCU_LBSSW_LBSSW122(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW122_SHIFT)) & STCU_LBSSW_LBSSW122_MASK)

#define STCU_LBSSW_LBSSW123_MASK                 (0x8000000U)
#define STCU_LBSSW_LBSSW123_SHIFT                (27U)
#define STCU_LBSSW_LBSSW123_WIDTH                (1U)
#define STCU_LBSSW_LBSSW123(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW123_SHIFT)) & STCU_LBSSW_LBSSW123_MASK)

#define STCU_LBSSW_LBSSW124_MASK                 (0x10000000U)
#define STCU_LBSSW_LBSSW124_SHIFT                (28U)
#define STCU_LBSSW_LBSSW124_WIDTH                (1U)
#define STCU_LBSSW_LBSSW124(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW124_SHIFT)) & STCU_LBSSW_LBSSW124_MASK)

#define STCU_LBSSW_LBSSW125_MASK                 (0x20000000U)
#define STCU_LBSSW_LBSSW125_SHIFT                (29U)
#define STCU_LBSSW_LBSSW125_WIDTH                (1U)
#define STCU_LBSSW_LBSSW125(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW125_SHIFT)) & STCU_LBSSW_LBSSW125_MASK)

#define STCU_LBSSW_LBSSW126_MASK                 (0x40000000U)
#define STCU_LBSSW_LBSSW126_SHIFT                (30U)
#define STCU_LBSSW_LBSSW126_WIDTH                (1U)
#define STCU_LBSSW_LBSSW126(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW126_SHIFT)) & STCU_LBSSW_LBSSW126_MASK)

