zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_LBSSW_LBSSW127_MASK                 (0x80000000U)
#define STCU_LBSSW_LBSSW127_SHIFT                (31U)
#define STCU_LBSSW_LBSSW127_WIDTH                (1U)
#define STCU_LBSSW_LBSSW127(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW_LBSSW127_SHIFT)) & STCU_LBSSW_LBSSW127_MASK)
/*! @} */

/*! @name LBESW - STCU2 Online LBIST End Flag */
/*! @{ */

#define STCU_LBESW_LBESW0_MASK                   (0x1U)
#define STCU_LBESW_LBESW0_SHIFT                  (0U)
#define STCU_LBESW_LBESW0_WIDTH                  (1U)
#define STCU_LBESW_LBESW0(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW0_SHIFT)) & STCU_LBESW_LBESW0_MASK)

#define STCU_LBESW_LBESW1_MASK                   (0x2U)
#define STCU_LBESW_LBESW1_SHIFT                  (1U)
#define STCU_LBESW_LBESW1_WIDTH                  (1U)
#define STCU_LBESW_LBESW1(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW1_SHIFT)) & STCU_LBESW_LBESW1_MASK)

#define STCU_LBESW_LBESW2_MASK                   (0x4U)
#define STCU_LBESW_LBESW2_SHIFT                  (2U)
#define STCU_LBESW_LBESW2_WIDTH                  (1U)
#define STCU_LBESW_LBESW2(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW2_SHIFT)) & STCU_LBESW_LBESW2_MASK)

#define STCU_LBESW_LBESW3_MASK                   (0x8U)
#define STCU_LBESW_LBESW3_SHIFT                  (3U)
#define STCU_LBESW_LBESW3_WIDTH                  (1U)
#define STCU_LBESW_LBESW3(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW3_SHIFT)) & STCU_LBESW_LBESW3_MASK)

#define STCU_LBESW_LBESW4_MASK                   (0x10U)
#define STCU_LBESW_LBESW4_SHIFT                  (4U)
#define STCU_LBESW_LBESW4_WIDTH                  (1U)
#define STCU_LBESW_LBESW4(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW4_SHIFT)) & STCU_LBESW_LBESW4_MASK)

#define STCU_LBESW_LBESW5_MASK                   (0x20U)
#define STCU_LBESW_LBESW5_SHIFT                  (5U)
#define STCU_LBESW_LBESW5_WIDTH                  (1U)
#define STCU_LBESW_LBESW5(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW5_SHIFT)) & STCU_LBESW_LBESW5_MASK)

#define STCU_LBESW_LBESW6_MASK                   (0x40U)
#define STCU_LBESW_LBESW6_SHIFT                  (6U)
#define STCU_LBESW_LBESW6_WIDTH                  (1U)
#define STCU_LBESW_LBESW6(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW6_SHIFT)) & STCU_LBESW_LBESW6_MASK)

#define STCU_LBESW_LBESW7_MASK                   (0x80U)
#define STCU_LBESW_LBESW7_SHIFT                  (7U)
#define STCU_LBESW_LBESW7_WIDTH                  (1U)
#define STCU_LBESW_LBESW7(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW7_SHIFT)) & STCU_LBESW_LBESW7_MASK)

#define STCU_LBESW_LBESW8_MASK                   (0x100U)
#define STCU_LBESW_LBESW8_SHIFT                  (8U)
#define STCU_LBESW_LBESW8_WIDTH                  (1U)
#define STCU_LBESW_LBESW8(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW8_SHIFT)) & STCU_LBESW_LBESW8_MASK)

#define STCU_LBESW_LBESW9_MASK                   (0x200U)
#define STCU_LBESW_LBESW9_SHIFT                  (9U)
#define STCU_LBESW_LBESW9_WIDTH                  (1U)
#define STCU_LBESW_LBESW9(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW9_SHIFT)) & STCU_LBESW_LBESW9_MASK)

#define STCU_LBESW_LBESW10_MASK                  (0x400U)
#define STCU_LBESW_LBESW10_SHIFT                 (10U)
#define STCU_LBESW_LBESW10_WIDTH                 (1U)
#define STCU_LBESW_LBESW10(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW10_SHIFT)) & STCU_LBESW_LBESW10_MASK)

#define STCU_LBESW_LBESW11_MASK                  (0x800U)
#define STCU_LBESW_LBESW11_SHIFT                 (11U)
#define STCU_LBESW_LBESW11_WIDTH                 (1U)
#define STCU_LBESW_LBESW11(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW11_SHIFT)) & STCU_LBESW_LBESW11_MASK)

#define STCU_LBESW_LBESW12_MASK                  (0x1000U)
#define STCU_LBESW_LBESW12_SHIFT                 (12U)
#define STCU_LBESW_LBESW12_WIDTH                 (1U)
#define STCU_LBESW_LBESW12(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW12_SHIFT)) & STCU_LBESW_LBESW12_MASK)

#define STCU_LBESW_LBESW13_MASK                  (0x2000U)
#define STCU_LBESW_LBESW13_SHIFT                 (13U)
#define STCU_LBESW_LBESW13_WIDTH                 (1U)
#define STCU_LBESW_LBESW13(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW13_SHIFT)) & STCU_LBESW_LBESW13_MASK)

#define STCU_LBESW_LBESW14_MASK                  (0x4000U)
#define STCU_LBESW_LBESW14_SHIFT                 (14U)
#define STCU_LBESW_LBESW14_WIDTH                 (1U)
#define STCU_LBESW_LBESW14(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW14_SHIFT)) & STCU_LBESW_LBESW14_MASK)

#define STCU_LBESW_LBESW15_MASK                  (0x8000U)
#define STCU_LBESW_LBESW15_SHIFT                 (15U)
#define STCU_LBESW_LBESW15_WIDTH                 (1U)
#define STCU_LBESW_LBESW15(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW15_SHIFT)) & STCU_LBESW_LBESW15_MASK)

#define STCU_LBESW_LBESW16_MASK                  (0x10000U)
#define STCU_LBESW_LBESW16_SHIFT                 (16U)
#define STCU_LBESW_LBESW16_WIDTH                 (1U)
#define STCU_LBESW_LBESW16(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW16_SHIFT)) & STCU_LBESW_LBESW16_MASK)

#define STCU_LBESW_LBESW17_MASK                  (0x20000U)
#define STCU_LBESW_LBESW17_SHIFT                 (17U)
#define STCU_LBESW_LBESW17_WIDTH                 (1U)
#define STCU_LBESW_LBESW17(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW17_SHIFT)) & STCU_LBESW_LBESW17_MASK)

#define STCU_LBESW_LBESW18_MASK                  (0x40000U)
#define STCU_LBESW_LBESW18_SHIFT                 (18U)
#define STCU_LBESW_LBESW18_WIDTH                 (1U)
#define STCU_LBESW_LBESW18(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW18_SHIFT)) & STCU_LBESW_LBESW18_MASK)

#define STCU_LBESW_LBESW19_MASK                  (0x80000U)
#define STCU_LBESW_LBESW19_SHIFT                 (19U)
#define STCU_LBESW_LBESW19_WIDTH                 (1U)
#define STCU_LBESW_LBESW19(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW19_SHIFT)) & STCU_LBESW_LBESW19_MASK)

#define STCU_LBESW_LBESW20_MASK                  (0x100000U)
#define STCU_LBESW_LBESW20_SHIFT                 (20U)
#define STCU_LBESW_LBESW20_WIDTH                 (1U)
#define STCU_LBESW_LBESW20(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW20_SHIFT)) & STCU_LBESW_LBESW20_MASK)

#define STCU_LBESW_LBESW21_MASK                  (0x200000U)
#define STCU_LBESW_LBESW21_SHIFT                 (21U)
#define STCU_LBESW_LBESW21_WIDTH                 (1U)
#define STCU_LBESW_LBESW21(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW21_SHIFT)) & STCU_LBESW_LBESW21_MASK)

