zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_LBESW_LBESW22_MASK                  (0x400000U)
#define STCU_LBESW_LBESW22_SHIFT                 (22U)
#define STCU_LBESW_LBESW22_WIDTH                 (1U)
#define STCU_LBESW_LBESW22(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW22_SHIFT)) & STCU_LBESW_LBESW22_MASK)

#define STCU_LBESW_LBESW23_MASK                  (0x800000U)
#define STCU_LBESW_LBESW23_SHIFT                 (23U)
#define STCU_LBESW_LBESW23_WIDTH                 (1U)
#define STCU_LBESW_LBESW23(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW23_SHIFT)) & STCU_LBESW_LBESW23_MASK)

#define STCU_LBESW_LBESW24_MASK                  (0x1000000U)
#define STCU_LBESW_LBESW24_SHIFT                 (24U)
#define STCU_LBESW_LBESW24_WIDTH                 (1U)
#define STCU_LBESW_LBESW24(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW24_SHIFT)) & STCU_LBESW_LBESW24_MASK)

#define STCU_LBESW_LBESW25_MASK                  (0x2000000U)
#define STCU_LBESW_LBESW25_SHIFT                 (25U)
#define STCU_LBESW_LBESW25_WIDTH                 (1U)
#define STCU_LBESW_LBESW25(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW25_SHIFT)) & STCU_LBESW_LBESW25_MASK)

#define STCU_LBESW_LBESW26_MASK                  (0x4000000U)
#define STCU_LBESW_LBESW26_SHIFT                 (26U)
#define STCU_LBESW_LBESW26_WIDTH                 (1U)
#define STCU_LBESW_LBESW26(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW26_SHIFT)) & STCU_LBESW_LBESW26_MASK)

#define STCU_LBESW_LBESW27_MASK                  (0x8000000U)
#define STCU_LBESW_LBESW27_SHIFT                 (27U)
#define STCU_LBESW_LBESW27_WIDTH                 (1U)
#define STCU_LBESW_LBESW27(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW27_SHIFT)) & STCU_LBESW_LBESW27_MASK)

#define STCU_LBESW_LBESW28_MASK                  (0x10000000U)
#define STCU_LBESW_LBESW28_SHIFT                 (28U)
#define STCU_LBESW_LBESW28_WIDTH                 (1U)
#define STCU_LBESW_LBESW28(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW28_SHIFT)) & STCU_LBESW_LBESW28_MASK)

#define STCU_LBESW_LBESW29_MASK                  (0x20000000U)
#define STCU_LBESW_LBESW29_SHIFT                 (29U)
#define STCU_LBESW_LBESW29_WIDTH                 (1U)
#define STCU_LBESW_LBESW29(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW29_SHIFT)) & STCU_LBESW_LBESW29_MASK)

#define STCU_LBESW_LBESW30_MASK                  (0x40000000U)
#define STCU_LBESW_LBESW30_SHIFT                 (30U)
#define STCU_LBESW_LBESW30_WIDTH                 (1U)
#define STCU_LBESW_LBESW30(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW30_SHIFT)) & STCU_LBESW_LBESW30_MASK)

#define STCU_LBESW_LBESW31_MASK                  (0x80000000U)
#define STCU_LBESW_LBESW31_SHIFT                 (31U)
#define STCU_LBESW_LBESW31_WIDTH                 (1U)
#define STCU_LBESW_LBESW31(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW31_SHIFT)) & STCU_LBESW_LBESW31_MASK)

#define STCU_LBESW_LBESW32_MASK                  (0x1U)
#define STCU_LBESW_LBESW32_SHIFT                 (0U)
#define STCU_LBESW_LBESW32_WIDTH                 (1U)
#define STCU_LBESW_LBESW32(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW32_SHIFT)) & STCU_LBESW_LBESW32_MASK)

#define STCU_LBESW_LBESW33_MASK                  (0x2U)
#define STCU_LBESW_LBESW33_SHIFT                 (1U)
#define STCU_LBESW_LBESW33_WIDTH                 (1U)
#define STCU_LBESW_LBESW33(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW33_SHIFT)) & STCU_LBESW_LBESW33_MASK)

#define STCU_LBESW_LBESW34_MASK                  (0x4U)
#define STCU_LBESW_LBESW34_SHIFT                 (2U)
#define STCU_LBESW_LBESW34_WIDTH                 (1U)
#define STCU_LBESW_LBESW34(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW34_SHIFT)) & STCU_LBESW_LBESW34_MASK)

#define STCU_LBESW_LBESW35_MASK                  (0x8U)
#define STCU_LBESW_LBESW35_SHIFT                 (3U)
#define STCU_LBESW_LBESW35_WIDTH                 (1U)
#define STCU_LBESW_LBESW35(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW35_SHIFT)) & STCU_LBESW_LBESW35_MASK)

#define STCU_LBESW_LBESW36_MASK                  (0x10U)
#define STCU_LBESW_LBESW36_SHIFT                 (4U)
#define STCU_LBESW_LBESW36_WIDTH                 (1U)
#define STCU_LBESW_LBESW36(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW36_SHIFT)) & STCU_LBESW_LBESW36_MASK)

#define STCU_LBESW_LBESW37_MASK                  (0x20U)
#define STCU_LBESW_LBESW37_SHIFT                 (5U)
#define STCU_LBESW_LBESW37_WIDTH                 (1U)
#define STCU_LBESW_LBESW37(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW37_SHIFT)) & STCU_LBESW_LBESW37_MASK)

#define STCU_LBESW_LBESW38_MASK                  (0x40U)
#define STCU_LBESW_LBESW38_SHIFT                 (6U)
#define STCU_LBESW_LBESW38_WIDTH                 (1U)
#define STCU_LBESW_LBESW38(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW38_SHIFT)) & STCU_LBESW_LBESW38_MASK)

#define STCU_LBESW_LBESW39_MASK                  (0x80U)
#define STCU_LBESW_LBESW39_SHIFT                 (7U)
#define STCU_LBESW_LBESW39_WIDTH                 (1U)
#define STCU_LBESW_LBESW39(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW39_SHIFT)) & STCU_LBESW_LBESW39_MASK)

#define STCU_LBESW_LBESW40_MASK                  (0x100U)
#define STCU_LBESW_LBESW40_SHIFT                 (8U)
#define STCU_LBESW_LBESW40_WIDTH                 (1U)
#define STCU_LBESW_LBESW40(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW40_SHIFT)) & STCU_LBESW_LBESW40_MASK)

#define STCU_LBESW_LBESW41_MASK                  (0x200U)
#define STCU_LBESW_LBESW41_SHIFT                 (9U)
#define STCU_LBESW_LBESW41_WIDTH                 (1U)
#define STCU_LBESW_LBESW41(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW41_SHIFT)) & STCU_LBESW_LBESW41_MASK)

#define STCU_LBESW_LBESW42_MASK                  (0x400U)
#define STCU_LBESW_LBESW42_SHIFT                 (10U)
#define STCU_LBESW_LBESW42_WIDTH                 (1U)
#define STCU_LBESW_LBESW42(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW42_SHIFT)) & STCU_LBESW_LBESW42_MASK)

#define STCU_LBESW_LBESW43_MASK                  (0x800U)
#define STCU_LBESW_LBESW43_SHIFT                 (11U)
#define STCU_LBESW_LBESW43_WIDTH                 (1U)
#define STCU_LBESW_LBESW43(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW43_SHIFT)) & STCU_LBESW_LBESW43_MASK)

#define STCU_LBESW_LBESW44_MASK                  (0x1000U)
#define STCU_LBESW_LBESW44_SHIFT                 (12U)
#define STCU_LBESW_LBESW44_WIDTH                 (1U)
#define STCU_LBESW_LBESW44(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW44_SHIFT)) & STCU_LBESW_LBESW44_MASK)

#define STCU_LBESW_LBESW45_MASK                  (0x2000U)
#define STCU_LBESW_LBESW45_SHIFT                 (13U)
#define STCU_LBESW_LBESW45_WIDTH                 (1U)
#define STCU_LBESW_LBESW45(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW45_SHIFT)) & STCU_LBESW_LBESW45_MASK)

#define STCU_LBESW_LBESW46_MASK                  (0x4000U)
#define STCU_LBESW_LBESW46_SHIFT                 (14U)
#define STCU_LBESW_LBESW46_WIDTH                 (1U)
#define STCU_LBESW_LBESW46(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW46_SHIFT)) & STCU_LBESW_LBESW46_MASK)

#define STCU_LBESW_LBESW47_MASK                  (0x8000U)
#define STCU_LBESW_LBESW47_SHIFT                 (15U)
#define STCU_LBESW_LBESW47_WIDTH                 (1U)
#define STCU_LBESW_LBESW47(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW47_SHIFT)) & STCU_LBESW_LBESW47_MASK)

#define STCU_LBESW_LBESW48_MASK                  (0x10000U)
#define STCU_LBESW_LBESW48_SHIFT                 (16U)
#define STCU_LBESW_LBESW48_WIDTH                 (1U)
#define STCU_LBESW_LBESW48(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW48_SHIFT)) & STCU_LBESW_LBESW48_MASK)

#define STCU_LBESW_LBESW49_MASK                  (0x20000U)
#define STCU_LBESW_LBESW49_SHIFT                 (17U)
#define STCU_LBESW_LBESW49_WIDTH                 (1U)
#define STCU_LBESW_LBESW49(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW49_SHIFT)) & STCU_LBESW_LBESW49_MASK)

#define STCU_LBESW_LBESW50_MASK                  (0x40000U)
#define STCU_LBESW_LBESW50_SHIFT                 (18U)
#define STCU_LBESW_LBESW50_WIDTH                 (1U)
#define STCU_LBESW_LBESW50(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW50_SHIFT)) & STCU_LBESW_LBESW50_MASK)

#define STCU_LBESW_LBESW51_MASK                  (0x80000U)
#define STCU_LBESW_LBESW51_SHIFT                 (19U)
#define STCU_LBESW_LBESW51_WIDTH                 (1U)
#define STCU_LBESW_LBESW51(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW51_SHIFT)) & STCU_LBESW_LBESW51_MASK)

#define STCU_LBESW_LBESW52_MASK                  (0x100000U)
#define STCU_LBESW_LBESW52_SHIFT                 (20U)
#define STCU_LBESW_LBESW52_WIDTH                 (1U)
#define STCU_LBESW_LBESW52(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW52_SHIFT)) & STCU_LBESW_LBESW52_MASK)

#define STCU_LBESW_LBESW53_MASK                  (0x200000U)
#define STCU_LBESW_LBESW53_SHIFT                 (21U)
#define STCU_LBESW_LBESW53_WIDTH                 (1U)
#define STCU_LBESW_LBESW53(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW53_SHIFT)) & STCU_LBESW_LBESW53_MASK)

#define STCU_LBESW_LBESW54_MASK                  (0x400000U)
#define STCU_LBESW_LBESW54_SHIFT                 (22U)
#define STCU_LBESW_LBESW54_WIDTH                 (1U)
#define STCU_LBESW_LBESW54(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW54_SHIFT)) & STCU_LBESW_LBESW54_MASK)

#define STCU_LBESW_LBESW55_MASK                  (0x800000U)
#define STCU_LBESW_LBESW55_SHIFT                 (23U)
#define STCU_LBESW_LBESW55_WIDTH                 (1U)
#define STCU_LBESW_LBESW55(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW55_SHIFT)) & STCU_LBESW_LBESW55_MASK)

#define STCU_LBESW_LBESW56_MASK                  (0x1000000U)
#define STCU_LBESW_LBESW56_SHIFT                 (24U)
#define STCU_LBESW_LBESW56_WIDTH                 (1U)
#define STCU_LBESW_LBESW56(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW56_SHIFT)) & STCU_LBESW_LBESW56_MASK)

#define STCU_LBESW_LBESW57_MASK                  (0x2000000U)
#define STCU_LBESW_LBESW57_SHIFT                 (25U)
#define STCU_LBESW_LBESW57_WIDTH                 (1U)
#define STCU_LBESW_LBESW57(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW57_SHIFT)) & STCU_LBESW_LBESW57_MASK)

#define STCU_LBESW_LBESW58_MASK                  (0x4000000U)
#define STCU_LBESW_LBESW58_SHIFT                 (26U)
#define STCU_LBESW_LBESW58_WIDTH                 (1U)
#define STCU_LBESW_LBESW58(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW58_SHIFT)) & STCU_LBESW_LBESW58_MASK)

#define STCU_LBESW_LBESW59_MASK                  (0x8000000U)
#define STCU_LBESW_LBESW59_SHIFT                 (27U)
#define STCU_LBESW_LBESW59_WIDTH                 (1U)
#define STCU_LBESW_LBESW59(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW59_SHIFT)) & STCU_LBESW_LBESW59_MASK)

#define STCU_LBESW_LBESW60_MASK                  (0x10000000U)
#define STCU_LBESW_LBESW60_SHIFT                 (28U)
#define STCU_LBESW_LBESW60_WIDTH                 (1U)
#define STCU_LBESW_LBESW60(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW60_SHIFT)) & STCU_LBESW_LBESW60_MASK)

#define STCU_LBESW_LBESW61_MASK                  (0x20000000U)
#define STCU_LBESW_LBESW61_SHIFT                 (29U)
#define STCU_LBESW_LBESW61_WIDTH                 (1U)
#define STCU_LBESW_LBESW61(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW61_SHIFT)) & STCU_LBESW_LBESW61_MASK)

#define STCU_LBESW_LBESW62_MASK                  (0x40000000U)
#define STCU_LBESW_LBESW62_SHIFT                 (30U)
#define STCU_LBESW_LBESW62_WIDTH                 (1U)
#define STCU_LBESW_LBESW62(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW62_SHIFT)) & STCU_LBESW_LBESW62_MASK)

#define STCU_LBESW_LBESW63_MASK                  (0x80000000U)
#define STCU_LBESW_LBESW63_SHIFT                 (31U)
#define STCU_LBESW_LBESW63_WIDTH                 (1U)
#define STCU_LBESW_LBESW63(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW63_SHIFT)) & STCU_LBESW_LBESW63_MASK)

#define STCU_LBESW_LBESW64_MASK                  (0x1U)
#define STCU_LBESW_LBESW64_SHIFT                 (0U)
#define STCU_LBESW_LBESW64_WIDTH                 (1U)
#define STCU_LBESW_LBESW64(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW64_SHIFT)) & STCU_LBESW_LBESW64_MASK)

