zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_LBESW_LBESW65_MASK                  (0x2U)
#define STCU_LBESW_LBESW65_SHIFT                 (1U)
#define STCU_LBESW_LBESW65_WIDTH                 (1U)
#define STCU_LBESW_LBESW65(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW65_SHIFT)) & STCU_LBESW_LBESW65_MASK)

#define STCU_LBESW_LBESW66_MASK                  (0x4U)
#define STCU_LBESW_LBESW66_SHIFT                 (2U)
#define STCU_LBESW_LBESW66_WIDTH                 (1U)
#define STCU_LBESW_LBESW66(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW66_SHIFT)) & STCU_LBESW_LBESW66_MASK)

#define STCU_LBESW_LBESW67_MASK                  (0x8U)
#define STCU_LBESW_LBESW67_SHIFT                 (3U)
#define STCU_LBESW_LBESW67_WIDTH                 (1U)
#define STCU_LBESW_LBESW67(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW67_SHIFT)) & STCU_LBESW_LBESW67_MASK)

#define STCU_LBESW_LBESW68_MASK                  (0x10U)
#define STCU_LBESW_LBESW68_SHIFT                 (4U)
#define STCU_LBESW_LBESW68_WIDTH                 (1U)
#define STCU_LBESW_LBESW68(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW68_SHIFT)) & STCU_LBESW_LBESW68_MASK)

#define STCU_LBESW_LBESW69_MASK                  (0x20U)
#define STCU_LBESW_LBESW69_SHIFT                 (5U)
#define STCU_LBESW_LBESW69_WIDTH                 (1U)
#define STCU_LBESW_LBESW69(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW69_SHIFT)) & STCU_LBESW_LBESW69_MASK)

#define STCU_LBESW_LBESW70_MASK                  (0x40U)
#define STCU_LBESW_LBESW70_SHIFT                 (6U)
#define STCU_LBESW_LBESW70_WIDTH                 (1U)
#define STCU_LBESW_LBESW70(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW70_SHIFT)) & STCU_LBESW_LBESW70_MASK)

#define STCU_LBESW_LBESW71_MASK                  (0x80U)
#define STCU_LBESW_LBESW71_SHIFT                 (7U)
#define STCU_LBESW_LBESW71_WIDTH                 (1U)
#define STCU_LBESW_LBESW71(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW71_SHIFT)) & STCU_LBESW_LBESW71_MASK)

#define STCU_LBESW_LBESW72_MASK                  (0x100U)
#define STCU_LBESW_LBESW72_SHIFT                 (8U)
#define STCU_LBESW_LBESW72_WIDTH                 (1U)
#define STCU_LBESW_LBESW72(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW72_SHIFT)) & STCU_LBESW_LBESW72_MASK)

#define STCU_LBESW_LBESW73_MASK                  (0x200U)
#define STCU_LBESW_LBESW73_SHIFT                 (9U)
#define STCU_LBESW_LBESW73_WIDTH                 (1U)
#define STCU_LBESW_LBESW73(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW73_SHIFT)) & STCU_LBESW_LBESW73_MASK)

#define STCU_LBESW_LBESW74_MASK                  (0x400U)
#define STCU_LBESW_LBESW74_SHIFT                 (10U)
#define STCU_LBESW_LBESW74_WIDTH                 (1U)
#define STCU_LBESW_LBESW74(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW74_SHIFT)) & STCU_LBESW_LBESW74_MASK)

#define STCU_LBESW_LBESW75_MASK                  (0x800U)
#define STCU_LBESW_LBESW75_SHIFT                 (11U)
#define STCU_LBESW_LBESW75_WIDTH                 (1U)
#define STCU_LBESW_LBESW75(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW75_SHIFT)) & STCU_LBESW_LBESW75_MASK)

#define STCU_LBESW_LBESW76_MASK                  (0x1000U)
#define STCU_LBESW_LBESW76_SHIFT                 (12U)
#define STCU_LBESW_LBESW76_WIDTH                 (1U)
#define STCU_LBESW_LBESW76(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW76_SHIFT)) & STCU_LBESW_LBESW76_MASK)

#define STCU_LBESW_LBESW77_MASK                  (0x2000U)
#define STCU_LBESW_LBESW77_SHIFT                 (13U)
#define STCU_LBESW_LBESW77_WIDTH                 (1U)
#define STCU_LBESW_LBESW77(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW77_SHIFT)) & STCU_LBESW_LBESW77_MASK)

#define STCU_LBESW_LBESW78_MASK                  (0x4000U)
#define STCU_LBESW_LBESW78_SHIFT                 (14U)
#define STCU_LBESW_LBESW78_WIDTH                 (1U)
#define STCU_LBESW_LBESW78(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW78_SHIFT)) & STCU_LBESW_LBESW78_MASK)

#define STCU_LBESW_LBESW79_MASK                  (0x8000U)
#define STCU_LBESW_LBESW79_SHIFT                 (15U)
#define STCU_LBESW_LBESW79_WIDTH                 (1U)
#define STCU_LBESW_LBESW79(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW79_SHIFT)) & STCU_LBESW_LBESW79_MASK)

#define STCU_LBESW_LBESW80_MASK                  (0x10000U)
#define STCU_LBESW_LBESW80_SHIFT                 (16U)
#define STCU_LBESW_LBESW80_WIDTH                 (1U)
#define STCU_LBESW_LBESW80(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW80_SHIFT)) & STCU_LBESW_LBESW80_MASK)

#define STCU_LBESW_LBESW81_MASK                  (0x20000U)
#define STCU_LBESW_LBESW81_SHIFT                 (17U)
#define STCU_LBESW_LBESW81_WIDTH                 (1U)
#define STCU_LBESW_LBESW81(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW81_SHIFT)) & STCU_LBESW_LBESW81_MASK)

#define STCU_LBESW_LBESW82_MASK                  (0x40000U)
#define STCU_LBESW_LBESW82_SHIFT                 (18U)
#define STCU_LBESW_LBESW82_WIDTH                 (1U)
#define STCU_LBESW_LBESW82(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW82_SHIFT)) & STCU_LBESW_LBESW82_MASK)

#define STCU_LBESW_LBESW83_MASK                  (0x80000U)
#define STCU_LBESW_LBESW83_SHIFT                 (19U)
#define STCU_LBESW_LBESW83_WIDTH                 (1U)
#define STCU_LBESW_LBESW83(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW83_SHIFT)) & STCU_LBESW_LBESW83_MASK)

#define STCU_LBESW_LBESW84_MASK                  (0x100000U)
#define STCU_LBESW_LBESW84_SHIFT                 (20U)
#define STCU_LBESW_LBESW84_WIDTH                 (1U)
#define STCU_LBESW_LBESW84(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW84_SHIFT)) & STCU_LBESW_LBESW84_MASK)

#define STCU_LBESW_LBESW85_MASK                  (0x200000U)
#define STCU_LBESW_LBESW85_SHIFT                 (21U)
#define STCU_LBESW_LBESW85_WIDTH                 (1U)
#define STCU_LBESW_LBESW85(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW85_SHIFT)) & STCU_LBESW_LBESW85_MASK)

#define STCU_LBESW_LBESW86_MASK                  (0x400000U)
#define STCU_LBESW_LBESW86_SHIFT                 (22U)
#define STCU_LBESW_LBESW86_WIDTH                 (1U)
#define STCU_LBESW_LBESW86(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW86_SHIFT)) & STCU_LBESW_LBESW86_MASK)

