zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_LBESW_LBESW87_MASK                  (0x800000U)
#define STCU_LBESW_LBESW87_SHIFT                 (23U)
#define STCU_LBESW_LBESW87_WIDTH                 (1U)
#define STCU_LBESW_LBESW87(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW87_SHIFT)) & STCU_LBESW_LBESW87_MASK)

#define STCU_LBESW_LBESW88_MASK                  (0x1000000U)
#define STCU_LBESW_LBESW88_SHIFT                 (24U)
#define STCU_LBESW_LBESW88_WIDTH                 (1U)
#define STCU_LBESW_LBESW88(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW88_SHIFT)) & STCU_LBESW_LBESW88_MASK)

#define STCU_LBESW_LBESW89_MASK                  (0x2000000U)
#define STCU_LBESW_LBESW89_SHIFT                 (25U)
#define STCU_LBESW_LBESW89_WIDTH                 (1U)
#define STCU_LBESW_LBESW89(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW89_SHIFT)) & STCU_LBESW_LBESW89_MASK)

#define STCU_LBESW_LBESW90_MASK                  (0x4000000U)
#define STCU_LBESW_LBESW90_SHIFT                 (26U)
#define STCU_LBESW_LBESW90_WIDTH                 (1U)
#define STCU_LBESW_LBESW90(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW90_SHIFT)) & STCU_LBESW_LBESW90_MASK)

#define STCU_LBESW_LBESW91_MASK                  (0x8000000U)
#define STCU_LBESW_LBESW91_SHIFT                 (27U)
#define STCU_LBESW_LBESW91_WIDTH                 (1U)
#define STCU_LBESW_LBESW91(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW91_SHIFT)) & STCU_LBESW_LBESW91_MASK)

#define STCU_LBESW_LBESW92_MASK                  (0x10000000U)
#define STCU_LBESW_LBESW92_SHIFT                 (28U)
#define STCU_LBESW_LBESW92_WIDTH                 (1U)
#define STCU_LBESW_LBESW92(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW92_SHIFT)) & STCU_LBESW_LBESW92_MASK)

#define STCU_LBESW_LBESW93_MASK                  (0x20000000U)
#define STCU_LBESW_LBESW93_SHIFT                 (29U)
#define STCU_LBESW_LBESW93_WIDTH                 (1U)
#define STCU_LBESW_LBESW93(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW93_SHIFT)) & STCU_LBESW_LBESW93_MASK)

#define STCU_LBESW_LBESW94_MASK                  (0x40000000U)
#define STCU_LBESW_LBESW94_SHIFT                 (30U)
#define STCU_LBESW_LBESW94_WIDTH                 (1U)
#define STCU_LBESW_LBESW94(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW94_SHIFT)) & STCU_LBESW_LBESW94_MASK)

#define STCU_LBESW_LBESW95_MASK                  (0x80000000U)
#define STCU_LBESW_LBESW95_SHIFT                 (31U)
#define STCU_LBESW_LBESW95_WIDTH                 (1U)
#define STCU_LBESW_LBESW95(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW95_SHIFT)) & STCU_LBESW_LBESW95_MASK)

#define STCU_LBESW_LBESW96_MASK                  (0x1U)
#define STCU_LBESW_LBESW96_SHIFT                 (0U)
#define STCU_LBESW_LBESW96_WIDTH                 (1U)
#define STCU_LBESW_LBESW96(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW96_SHIFT)) & STCU_LBESW_LBESW96_MASK)

#define STCU_LBESW_LBESW97_MASK                  (0x2U)
#define STCU_LBESW_LBESW97_SHIFT                 (1U)
#define STCU_LBESW_LBESW97_WIDTH                 (1U)
#define STCU_LBESW_LBESW97(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW97_SHIFT)) & STCU_LBESW_LBESW97_MASK)

#define STCU_LBESW_LBESW98_MASK                  (0x4U)
#define STCU_LBESW_LBESW98_SHIFT                 (2U)
#define STCU_LBESW_LBESW98_WIDTH                 (1U)
#define STCU_LBESW_LBESW98(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW98_SHIFT)) & STCU_LBESW_LBESW98_MASK)

#define STCU_LBESW_LBESW99_MASK                  (0x8U)
#define STCU_LBESW_LBESW99_SHIFT                 (3U)
#define STCU_LBESW_LBESW99_WIDTH                 (1U)
#define STCU_LBESW_LBESW99(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW99_SHIFT)) & STCU_LBESW_LBESW99_MASK)

#define STCU_LBESW_LBESW100_MASK                 (0x10U)
#define STCU_LBESW_LBESW100_SHIFT                (4U)
#define STCU_LBESW_LBESW100_WIDTH                (1U)
#define STCU_LBESW_LBESW100(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW100_SHIFT)) & STCU_LBESW_LBESW100_MASK)

#define STCU_LBESW_LBESW101_MASK                 (0x20U)
#define STCU_LBESW_LBESW101_SHIFT                (5U)
#define STCU_LBESW_LBESW101_WIDTH                (1U)
#define STCU_LBESW_LBESW101(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW101_SHIFT)) & STCU_LBESW_LBESW101_MASK)

#define STCU_LBESW_LBESW102_MASK                 (0x40U)
#define STCU_LBESW_LBESW102_SHIFT                (6U)
#define STCU_LBESW_LBESW102_WIDTH                (1U)
#define STCU_LBESW_LBESW102(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW102_SHIFT)) & STCU_LBESW_LBESW102_MASK)

#define STCU_LBESW_LBESW103_MASK                 (0x80U)
#define STCU_LBESW_LBESW103_SHIFT                (7U)
#define STCU_LBESW_LBESW103_WIDTH                (1U)
#define STCU_LBESW_LBESW103(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW103_SHIFT)) & STCU_LBESW_LBESW103_MASK)

#define STCU_LBESW_LBESW104_MASK                 (0x100U)
#define STCU_LBESW_LBESW104_SHIFT                (8U)
#define STCU_LBESW_LBESW104_WIDTH                (1U)
#define STCU_LBESW_LBESW104(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW104_SHIFT)) & STCU_LBESW_LBESW104_MASK)

#define STCU_LBESW_LBESW105_MASK                 (0x200U)
#define STCU_LBESW_LBESW105_SHIFT                (9U)
#define STCU_LBESW_LBESW105_WIDTH                (1U)
#define STCU_LBESW_LBESW105(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW105_SHIFT)) & STCU_LBESW_LBESW105_MASK)

#define STCU_LBESW_LBESW106_MASK                 (0x400U)
#define STCU_LBESW_LBESW106_SHIFT                (10U)
#define STCU_LBESW_LBESW106_WIDTH                (1U)
#define STCU_LBESW_LBESW106(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW106_SHIFT)) & STCU_LBESW_LBESW106_MASK)

