zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_LBESW_LBESW107_MASK                 (0x800U)
#define STCU_LBESW_LBESW107_SHIFT                (11U)
#define STCU_LBESW_LBESW107_WIDTH                (1U)
#define STCU_LBESW_LBESW107(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW107_SHIFT)) & STCU_LBESW_LBESW107_MASK)

#define STCU_LBESW_LBESW108_MASK                 (0x1000U)
#define STCU_LBESW_LBESW108_SHIFT                (12U)
#define STCU_LBESW_LBESW108_WIDTH                (1U)
#define STCU_LBESW_LBESW108(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW108_SHIFT)) & STCU_LBESW_LBESW108_MASK)

#define STCU_LBESW_LBESW109_MASK                 (0x2000U)
#define STCU_LBESW_LBESW109_SHIFT                (13U)
#define STCU_LBESW_LBESW109_WIDTH                (1U)
#define STCU_LBESW_LBESW109(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW109_SHIFT)) & STCU_LBESW_LBESW109_MASK)

#define STCU_LBESW_LBESW110_MASK                 (0x4000U)
#define STCU_LBESW_LBESW110_SHIFT                (14U)
#define STCU_LBESW_LBESW110_WIDTH                (1U)
#define STCU_LBESW_LBESW110(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW110_SHIFT)) & STCU_LBESW_LBESW110_MASK)

#define STCU_LBESW_LBESW111_MASK                 (0x8000U)
#define STCU_LBESW_LBESW111_SHIFT                (15U)
#define STCU_LBESW_LBESW111_WIDTH                (1U)
#define STCU_LBESW_LBESW111(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW111_SHIFT)) & STCU_LBESW_LBESW111_MASK)

#define STCU_LBESW_LBESW112_MASK                 (0x10000U)
#define STCU_LBESW_LBESW112_SHIFT                (16U)
#define STCU_LBESW_LBESW112_WIDTH                (1U)
#define STCU_LBESW_LBESW112(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW112_SHIFT)) & STCU_LBESW_LBESW112_MASK)

#define STCU_LBESW_LBESW113_MASK                 (0x20000U)
#define STCU_LBESW_LBESW113_SHIFT                (17U)
#define STCU_LBESW_LBESW113_WIDTH                (1U)
#define STCU_LBESW_LBESW113(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW113_SHIFT)) & STCU_LBESW_LBESW113_MASK)

#define STCU_LBESW_LBESW114_MASK                 (0x40000U)
#define STCU_LBESW_LBESW114_SHIFT                (18U)
#define STCU_LBESW_LBESW114_WIDTH                (1U)
#define STCU_LBESW_LBESW114(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW114_SHIFT)) & STCU_LBESW_LBESW114_MASK)

#define STCU_LBESW_LBESW115_MASK                 (0x80000U)
#define STCU_LBESW_LBESW115_SHIFT                (19U)
#define STCU_LBESW_LBESW115_WIDTH                (1U)
#define STCU_LBESW_LBESW115(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW115_SHIFT)) & STCU_LBESW_LBESW115_MASK)

#define STCU_LBESW_LBESW116_MASK                 (0x100000U)
#define STCU_LBESW_LBESW116_SHIFT                (20U)
#define STCU_LBESW_LBESW116_WIDTH                (1U)
#define STCU_LBESW_LBESW116(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW116_SHIFT)) & STCU_LBESW_LBESW116_MASK)

#define STCU_LBESW_LBESW117_MASK                 (0x200000U)
#define STCU_LBESW_LBESW117_SHIFT                (21U)
#define STCU_LBESW_LBESW117_WIDTH                (1U)
#define STCU_LBESW_LBESW117(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW117_SHIFT)) & STCU_LBESW_LBESW117_MASK)

#define STCU_LBESW_LBESW118_MASK                 (0x400000U)
#define STCU_LBESW_LBESW118_SHIFT                (22U)
#define STCU_LBESW_LBESW118_WIDTH                (1U)
#define STCU_LBESW_LBESW118(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW118_SHIFT)) & STCU_LBESW_LBESW118_MASK)

#define STCU_LBESW_LBESW119_MASK                 (0x800000U)
#define STCU_LBESW_LBESW119_SHIFT                (23U)
#define STCU_LBESW_LBESW119_WIDTH                (1U)
#define STCU_LBESW_LBESW119(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW119_SHIFT)) & STCU_LBESW_LBESW119_MASK)

#define STCU_LBESW_LBESW120_MASK                 (0x1000000U)
#define STCU_LBESW_LBESW120_SHIFT                (24U)
#define STCU_LBESW_LBESW120_WIDTH                (1U)
#define STCU_LBESW_LBESW120(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW120_SHIFT)) & STCU_LBESW_LBESW120_MASK)

#define STCU_LBESW_LBESW121_MASK                 (0x2000000U)
#define STCU_LBESW_LBESW121_SHIFT                (25U)
#define STCU_LBESW_LBESW121_WIDTH                (1U)
#define STCU_LBESW_LBESW121(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW121_SHIFT)) & STCU_LBESW_LBESW121_MASK)

#define STCU_LBESW_LBESW122_MASK                 (0x4000000U)
#define STCU_LBESW_LBESW122_SHIFT                (26U)
#define STCU_LBESW_LBESW122_WIDTH                (1U)
#define STCU_LBESW_LBESW122(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW122_SHIFT)) & STCU_LBESW_LBESW122_MASK)

#define STCU_LBESW_LBESW123_MASK                 (0x8000000U)
#define STCU_LBESW_LBESW123_SHIFT                (27U)
#define STCU_LBESW_LBESW123_WIDTH                (1U)
#define STCU_LBESW_LBESW123(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW123_SHIFT)) & STCU_LBESW_LBESW123_MASK)

#define STCU_LBESW_LBESW124_MASK                 (0x10000000U)
#define STCU_LBESW_LBESW124_SHIFT                (28U)
#define STCU_LBESW_LBESW124_WIDTH                (1U)
#define STCU_LBESW_LBESW124(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW124_SHIFT)) & STCU_LBESW_LBESW124_MASK)

#define STCU_LBESW_LBESW125_MASK                 (0x20000000U)
#define STCU_LBESW_LBESW125_SHIFT                (29U)
#define STCU_LBESW_LBESW125_WIDTH                (1U)
#define STCU_LBESW_LBESW125(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW125_SHIFT)) & STCU_LBESW_LBESW125_MASK)

#define STCU_LBESW_LBESW126_MASK                 (0x40000000U)
#define STCU_LBESW_LBESW126_SHIFT                (30U)
#define STCU_LBESW_LBESW126_WIDTH                (1U)
#define STCU_LBESW_LBESW126(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW126_SHIFT)) & STCU_LBESW_LBESW126_MASK)

#define STCU_LBESW_LBESW127_MASK                 (0x80000000U)
#define STCU_LBESW_LBESW127_SHIFT                (31U)
#define STCU_LBESW_LBESW127_WIDTH                (1U)
#define STCU_LBESW_LBESW127(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBESW_LBESW127_SHIFT)) & STCU_LBESW_LBESW127_MASK)
/*! @} */

/*! @name LBRMSW - STCU2 Online LBIST Reset Management */
/*! @{ */

