zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_LBRMSW_LBRMSW0_MASK                 (0x1U)
#define STCU_LBRMSW_LBRMSW0_SHIFT                (0U)
#define STCU_LBRMSW_LBRMSW0_WIDTH                (1U)
#define STCU_LBRMSW_LBRMSW0(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW0_SHIFT)) & STCU_LBRMSW_LBRMSW0_MASK)

#define STCU_LBRMSW_LBRMSW1_MASK                 (0x2U)
#define STCU_LBRMSW_LBRMSW1_SHIFT                (1U)
#define STCU_LBRMSW_LBRMSW1_WIDTH                (1U)
#define STCU_LBRMSW_LBRMSW1(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW1_SHIFT)) & STCU_LBRMSW_LBRMSW1_MASK)

#define STCU_LBRMSW_LBRMSW2_MASK                 (0x4U)
#define STCU_LBRMSW_LBRMSW2_SHIFT                (2U)
#define STCU_LBRMSW_LBRMSW2_WIDTH                (1U)
#define STCU_LBRMSW_LBRMSW2(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW2_SHIFT)) & STCU_LBRMSW_LBRMSW2_MASK)

#define STCU_LBRMSW_LBRMSW3_MASK                 (0x8U)
#define STCU_LBRMSW_LBRMSW3_SHIFT                (3U)
#define STCU_LBRMSW_LBRMSW3_WIDTH                (1U)
#define STCU_LBRMSW_LBRMSW3(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW3_SHIFT)) & STCU_LBRMSW_LBRMSW3_MASK)

#define STCU_LBRMSW_LBRMSW4_MASK                 (0x10U)
#define STCU_LBRMSW_LBRMSW4_SHIFT                (4U)
#define STCU_LBRMSW_LBRMSW4_WIDTH                (1U)
#define STCU_LBRMSW_LBRMSW4(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW4_SHIFT)) & STCU_LBRMSW_LBRMSW4_MASK)

#define STCU_LBRMSW_LBRMSW5_MASK                 (0x20U)
#define STCU_LBRMSW_LBRMSW5_SHIFT                (5U)
#define STCU_LBRMSW_LBRMSW5_WIDTH                (1U)
#define STCU_LBRMSW_LBRMSW5(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW5_SHIFT)) & STCU_LBRMSW_LBRMSW5_MASK)

#define STCU_LBRMSW_LBRMSW6_MASK                 (0x40U)
#define STCU_LBRMSW_LBRMSW6_SHIFT                (6U)
#define STCU_LBRMSW_LBRMSW6_WIDTH                (1U)
#define STCU_LBRMSW_LBRMSW6(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW6_SHIFT)) & STCU_LBRMSW_LBRMSW6_MASK)

#define STCU_LBRMSW_LBRMSW7_MASK                 (0x80U)
#define STCU_LBRMSW_LBRMSW7_SHIFT                (7U)
#define STCU_LBRMSW_LBRMSW7_WIDTH                (1U)
#define STCU_LBRMSW_LBRMSW7(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW7_SHIFT)) & STCU_LBRMSW_LBRMSW7_MASK)

#define STCU_LBRMSW_LBRMSW8_MASK                 (0x100U)
#define STCU_LBRMSW_LBRMSW8_SHIFT                (8U)
#define STCU_LBRMSW_LBRMSW8_WIDTH                (1U)
#define STCU_LBRMSW_LBRMSW8(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW8_SHIFT)) & STCU_LBRMSW_LBRMSW8_MASK)

#define STCU_LBRMSW_LBRMSW9_MASK                 (0x200U)
#define STCU_LBRMSW_LBRMSW9_SHIFT                (9U)
#define STCU_LBRMSW_LBRMSW9_WIDTH                (1U)
#define STCU_LBRMSW_LBRMSW9(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW9_SHIFT)) & STCU_LBRMSW_LBRMSW9_MASK)

#define STCU_LBRMSW_LBRMSW10_MASK                (0x400U)
#define STCU_LBRMSW_LBRMSW10_SHIFT               (10U)
#define STCU_LBRMSW_LBRMSW10_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW10(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW10_SHIFT)) & STCU_LBRMSW_LBRMSW10_MASK)

#define STCU_LBRMSW_LBRMSW11_MASK                (0x800U)
#define STCU_LBRMSW_LBRMSW11_SHIFT               (11U)
#define STCU_LBRMSW_LBRMSW11_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW11(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW11_SHIFT)) & STCU_LBRMSW_LBRMSW11_MASK)

#define STCU_LBRMSW_LBRMSW12_MASK                (0x1000U)
#define STCU_LBRMSW_LBRMSW12_SHIFT               (12U)
#define STCU_LBRMSW_LBRMSW12_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW12(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW12_SHIFT)) & STCU_LBRMSW_LBRMSW12_MASK)

#define STCU_LBRMSW_LBRMSW13_MASK                (0x2000U)
#define STCU_LBRMSW_LBRMSW13_SHIFT               (13U)
#define STCU_LBRMSW_LBRMSW13_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW13(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW13_SHIFT)) & STCU_LBRMSW_LBRMSW13_MASK)

#define STCU_LBRMSW_LBRMSW14_MASK                (0x4000U)
#define STCU_LBRMSW_LBRMSW14_SHIFT               (14U)
#define STCU_LBRMSW_LBRMSW14_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW14(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW14_SHIFT)) & STCU_LBRMSW_LBRMSW14_MASK)

#define STCU_LBRMSW_LBRMSW15_MASK                (0x8000U)
#define STCU_LBRMSW_LBRMSW15_SHIFT               (15U)
#define STCU_LBRMSW_LBRMSW15_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW15(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW15_SHIFT)) & STCU_LBRMSW_LBRMSW15_MASK)

#define STCU_LBRMSW_LBRMSW16_MASK                (0x10000U)
#define STCU_LBRMSW_LBRMSW16_SHIFT               (16U)
#define STCU_LBRMSW_LBRMSW16_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW16(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW16_SHIFT)) & STCU_LBRMSW_LBRMSW16_MASK)

#define STCU_LBRMSW_LBRMSW17_MASK                (0x20000U)
#define STCU_LBRMSW_LBRMSW17_SHIFT               (17U)
#define STCU_LBRMSW_LBRMSW17_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW17(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW17_SHIFT)) & STCU_LBRMSW_LBRMSW17_MASK)

#define STCU_LBRMSW_LBRMSW18_MASK                (0x40000U)
#define STCU_LBRMSW_LBRMSW18_SHIFT               (18U)
#define STCU_LBRMSW_LBRMSW18_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW18(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW18_SHIFT)) & STCU_LBRMSW_LBRMSW18_MASK)

#define STCU_LBRMSW_LBRMSW19_MASK                (0x80000U)
#define STCU_LBRMSW_LBRMSW19_SHIFT               (19U)
#define STCU_LBRMSW_LBRMSW19_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW19(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW19_SHIFT)) & STCU_LBRMSW_LBRMSW19_MASK)

#define STCU_LBRMSW_LBRMSW20_MASK                (0x100000U)
#define STCU_LBRMSW_LBRMSW20_SHIFT               (20U)
#define STCU_LBRMSW_LBRMSW20_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW20(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW20_SHIFT)) & STCU_LBRMSW_LBRMSW20_MASK)

#define STCU_LBRMSW_LBRMSW21_MASK                (0x200000U)
#define STCU_LBRMSW_LBRMSW21_SHIFT               (21U)
#define STCU_LBRMSW_LBRMSW21_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW21(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW21_SHIFT)) & STCU_LBRMSW_LBRMSW21_MASK)

#define STCU_LBRMSW_LBRMSW22_MASK                (0x400000U)
#define STCU_LBRMSW_LBRMSW22_SHIFT               (22U)
#define STCU_LBRMSW_LBRMSW22_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW22(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW22_SHIFT)) & STCU_LBRMSW_LBRMSW22_MASK)

#define STCU_LBRMSW_LBRMSW23_MASK                (0x800000U)
#define STCU_LBRMSW_LBRMSW23_SHIFT               (23U)
#define STCU_LBRMSW_LBRMSW23_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW23(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW23_SHIFT)) & STCU_LBRMSW_LBRMSW23_MASK)

#define STCU_LBRMSW_LBRMSW24_MASK                (0x1000000U)
#define STCU_LBRMSW_LBRMSW24_SHIFT               (24U)
#define STCU_LBRMSW_LBRMSW24_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW24(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW24_SHIFT)) & STCU_LBRMSW_LBRMSW24_MASK)

#define STCU_LBRMSW_LBRMSW25_MASK                (0x2000000U)
#define STCU_LBRMSW_LBRMSW25_SHIFT               (25U)
#define STCU_LBRMSW_LBRMSW25_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW25(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW25_SHIFT)) & STCU_LBRMSW_LBRMSW25_MASK)

#define STCU_LBRMSW_LBRMSW26_MASK                (0x4000000U)
#define STCU_LBRMSW_LBRMSW26_SHIFT               (26U)
#define STCU_LBRMSW_LBRMSW26_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW26(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW26_SHIFT)) & STCU_LBRMSW_LBRMSW26_MASK)

