zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_LBRMSW_LBRMSW27_MASK                (0x8000000U)
#define STCU_LBRMSW_LBRMSW27_SHIFT               (27U)
#define STCU_LBRMSW_LBRMSW27_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW27(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW27_SHIFT)) & STCU_LBRMSW_LBRMSW27_MASK)

#define STCU_LBRMSW_LBRMSW28_MASK                (0x10000000U)
#define STCU_LBRMSW_LBRMSW28_SHIFT               (28U)
#define STCU_LBRMSW_LBRMSW28_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW28(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW28_SHIFT)) & STCU_LBRMSW_LBRMSW28_MASK)

#define STCU_LBRMSW_LBRMSW29_MASK                (0x20000000U)
#define STCU_LBRMSW_LBRMSW29_SHIFT               (29U)
#define STCU_LBRMSW_LBRMSW29_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW29(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW29_SHIFT)) & STCU_LBRMSW_LBRMSW29_MASK)

#define STCU_LBRMSW_LBRMSW30_MASK                (0x40000000U)
#define STCU_LBRMSW_LBRMSW30_SHIFT               (30U)
#define STCU_LBRMSW_LBRMSW30_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW30(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW30_SHIFT)) & STCU_LBRMSW_LBRMSW30_MASK)

#define STCU_LBRMSW_LBRMSW31_MASK                (0x80000000U)
#define STCU_LBRMSW_LBRMSW31_SHIFT               (31U)
#define STCU_LBRMSW_LBRMSW31_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW31(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW31_SHIFT)) & STCU_LBRMSW_LBRMSW31_MASK)

#define STCU_LBRMSW_LBRMSW32_MASK                (0x1U)
#define STCU_LBRMSW_LBRMSW32_SHIFT               (0U)
#define STCU_LBRMSW_LBRMSW32_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW32(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW32_SHIFT)) & STCU_LBRMSW_LBRMSW32_MASK)

#define STCU_LBRMSW_LBRMSW33_MASK                (0x2U)
#define STCU_LBRMSW_LBRMSW33_SHIFT               (1U)
#define STCU_LBRMSW_LBRMSW33_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW33(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW33_SHIFT)) & STCU_LBRMSW_LBRMSW33_MASK)

#define STCU_LBRMSW_LBRMSW34_MASK                (0x4U)
#define STCU_LBRMSW_LBRMSW34_SHIFT               (2U)
#define STCU_LBRMSW_LBRMSW34_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW34(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW34_SHIFT)) & STCU_LBRMSW_LBRMSW34_MASK)

#define STCU_LBRMSW_LBRMSW35_MASK                (0x8U)
#define STCU_LBRMSW_LBRMSW35_SHIFT               (3U)
#define STCU_LBRMSW_LBRMSW35_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW35(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW35_SHIFT)) & STCU_LBRMSW_LBRMSW35_MASK)

#define STCU_LBRMSW_LBRMSW36_MASK                (0x10U)
#define STCU_LBRMSW_LBRMSW36_SHIFT               (4U)
#define STCU_LBRMSW_LBRMSW36_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW36(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW36_SHIFT)) & STCU_LBRMSW_LBRMSW36_MASK)

#define STCU_LBRMSW_LBRMSW37_MASK                (0x20U)
#define STCU_LBRMSW_LBRMSW37_SHIFT               (5U)
#define STCU_LBRMSW_LBRMSW37_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW37(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW37_SHIFT)) & STCU_LBRMSW_LBRMSW37_MASK)

#define STCU_LBRMSW_LBRMSW38_MASK                (0x40U)
#define STCU_LBRMSW_LBRMSW38_SHIFT               (6U)
#define STCU_LBRMSW_LBRMSW38_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW38(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW38_SHIFT)) & STCU_LBRMSW_LBRMSW38_MASK)

#define STCU_LBRMSW_LBRMSW39_MASK                (0x80U)
#define STCU_LBRMSW_LBRMSW39_SHIFT               (7U)
#define STCU_LBRMSW_LBRMSW39_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW39(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW39_SHIFT)) & STCU_LBRMSW_LBRMSW39_MASK)

#define STCU_LBRMSW_LBRMSW40_MASK                (0x100U)
#define STCU_LBRMSW_LBRMSW40_SHIFT               (8U)
#define STCU_LBRMSW_LBRMSW40_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW40(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW40_SHIFT)) & STCU_LBRMSW_LBRMSW40_MASK)

#define STCU_LBRMSW_LBRMSW41_MASK                (0x200U)
#define STCU_LBRMSW_LBRMSW41_SHIFT               (9U)
#define STCU_LBRMSW_LBRMSW41_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW41(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW41_SHIFT)) & STCU_LBRMSW_LBRMSW41_MASK)

#define STCU_LBRMSW_LBRMSW42_MASK                (0x400U)
#define STCU_LBRMSW_LBRMSW42_SHIFT               (10U)
#define STCU_LBRMSW_LBRMSW42_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW42(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW42_SHIFT)) & STCU_LBRMSW_LBRMSW42_MASK)

#define STCU_LBRMSW_LBRMSW43_MASK                (0x800U)
#define STCU_LBRMSW_LBRMSW43_SHIFT               (11U)
#define STCU_LBRMSW_LBRMSW43_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW43(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW43_SHIFT)) & STCU_LBRMSW_LBRMSW43_MASK)

#define STCU_LBRMSW_LBRMSW44_MASK                (0x1000U)
#define STCU_LBRMSW_LBRMSW44_SHIFT               (12U)
#define STCU_LBRMSW_LBRMSW44_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW44(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW44_SHIFT)) & STCU_LBRMSW_LBRMSW44_MASK)

#define STCU_LBRMSW_LBRMSW45_MASK                (0x2000U)
#define STCU_LBRMSW_LBRMSW45_SHIFT               (13U)
#define STCU_LBRMSW_LBRMSW45_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW45(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW45_SHIFT)) & STCU_LBRMSW_LBRMSW45_MASK)

#define STCU_LBRMSW_LBRMSW46_MASK                (0x4000U)
#define STCU_LBRMSW_LBRMSW46_SHIFT               (14U)
#define STCU_LBRMSW_LBRMSW46_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW46(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW46_SHIFT)) & STCU_LBRMSW_LBRMSW46_MASK)

