zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_LBRMSW_LBRMSW47_MASK                (0x8000U)
#define STCU_LBRMSW_LBRMSW47_SHIFT               (15U)
#define STCU_LBRMSW_LBRMSW47_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW47(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW47_SHIFT)) & STCU_LBRMSW_LBRMSW47_MASK)

#define STCU_LBRMSW_LBRMSW48_MASK                (0x10000U)
#define STCU_LBRMSW_LBRMSW48_SHIFT               (16U)
#define STCU_LBRMSW_LBRMSW48_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW48(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW48_SHIFT)) & STCU_LBRMSW_LBRMSW48_MASK)

#define STCU_LBRMSW_LBRMSW49_MASK                (0x20000U)
#define STCU_LBRMSW_LBRMSW49_SHIFT               (17U)
#define STCU_LBRMSW_LBRMSW49_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW49(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW49_SHIFT)) & STCU_LBRMSW_LBRMSW49_MASK)

#define STCU_LBRMSW_LBRMSW50_MASK                (0x40000U)
#define STCU_LBRMSW_LBRMSW50_SHIFT               (18U)
#define STCU_LBRMSW_LBRMSW50_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW50(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW50_SHIFT)) & STCU_LBRMSW_LBRMSW50_MASK)

#define STCU_LBRMSW_LBRMSW51_MASK                (0x80000U)
#define STCU_LBRMSW_LBRMSW51_SHIFT               (19U)
#define STCU_LBRMSW_LBRMSW51_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW51(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW51_SHIFT)) & STCU_LBRMSW_LBRMSW51_MASK)

#define STCU_LBRMSW_LBRMSW52_MASK                (0x100000U)
#define STCU_LBRMSW_LBRMSW52_SHIFT               (20U)
#define STCU_LBRMSW_LBRMSW52_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW52(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW52_SHIFT)) & STCU_LBRMSW_LBRMSW52_MASK)

#define STCU_LBRMSW_LBRMSW53_MASK                (0x200000U)
#define STCU_LBRMSW_LBRMSW53_SHIFT               (21U)
#define STCU_LBRMSW_LBRMSW53_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW53(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW53_SHIFT)) & STCU_LBRMSW_LBRMSW53_MASK)

#define STCU_LBRMSW_LBRMSW54_MASK                (0x400000U)
#define STCU_LBRMSW_LBRMSW54_SHIFT               (22U)
#define STCU_LBRMSW_LBRMSW54_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW54(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW54_SHIFT)) & STCU_LBRMSW_LBRMSW54_MASK)

#define STCU_LBRMSW_LBRMSW55_MASK                (0x800000U)
#define STCU_LBRMSW_LBRMSW55_SHIFT               (23U)
#define STCU_LBRMSW_LBRMSW55_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW55(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW55_SHIFT)) & STCU_LBRMSW_LBRMSW55_MASK)

#define STCU_LBRMSW_LBRMSW56_MASK                (0x1000000U)
#define STCU_LBRMSW_LBRMSW56_SHIFT               (24U)
#define STCU_LBRMSW_LBRMSW56_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW56(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW56_SHIFT)) & STCU_LBRMSW_LBRMSW56_MASK)

#define STCU_LBRMSW_LBRMSW57_MASK                (0x2000000U)
#define STCU_LBRMSW_LBRMSW57_SHIFT               (25U)
#define STCU_LBRMSW_LBRMSW57_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW57(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW57_SHIFT)) & STCU_LBRMSW_LBRMSW57_MASK)

#define STCU_LBRMSW_LBRMSW58_MASK                (0x4000000U)
#define STCU_LBRMSW_LBRMSW58_SHIFT               (26U)
#define STCU_LBRMSW_LBRMSW58_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW58(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW58_SHIFT)) & STCU_LBRMSW_LBRMSW58_MASK)

#define STCU_LBRMSW_LBRMSW59_MASK                (0x8000000U)
#define STCU_LBRMSW_LBRMSW59_SHIFT               (27U)
#define STCU_LBRMSW_LBRMSW59_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW59(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW59_SHIFT)) & STCU_LBRMSW_LBRMSW59_MASK)

#define STCU_LBRMSW_LBRMSW60_MASK                (0x10000000U)
#define STCU_LBRMSW_LBRMSW60_SHIFT               (28U)
#define STCU_LBRMSW_LBRMSW60_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW60(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW60_SHIFT)) & STCU_LBRMSW_LBRMSW60_MASK)

#define STCU_LBRMSW_LBRMSW61_MASK                (0x20000000U)
#define STCU_LBRMSW_LBRMSW61_SHIFT               (29U)
#define STCU_LBRMSW_LBRMSW61_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW61(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW61_SHIFT)) & STCU_LBRMSW_LBRMSW61_MASK)

#define STCU_LBRMSW_LBRMSW62_MASK                (0x40000000U)
#define STCU_LBRMSW_LBRMSW62_SHIFT               (30U)
#define STCU_LBRMSW_LBRMSW62_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW62(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW62_SHIFT)) & STCU_LBRMSW_LBRMSW62_MASK)

#define STCU_LBRMSW_LBRMSW63_MASK                (0x80000000U)
#define STCU_LBRMSW_LBRMSW63_SHIFT               (31U)
#define STCU_LBRMSW_LBRMSW63_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW63(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW63_SHIFT)) & STCU_LBRMSW_LBRMSW63_MASK)

#define STCU_LBRMSW_LBRMSW64_MASK                (0x1U)
#define STCU_LBRMSW_LBRMSW64_SHIFT               (0U)
#define STCU_LBRMSW_LBRMSW64_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW64(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW64_SHIFT)) & STCU_LBRMSW_LBRMSW64_MASK)

#define STCU_LBRMSW_LBRMSW65_MASK                (0x2U)
#define STCU_LBRMSW_LBRMSW65_SHIFT               (1U)
#define STCU_LBRMSW_LBRMSW65_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW65(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW65_SHIFT)) & STCU_LBRMSW_LBRMSW65_MASK)

#define STCU_LBRMSW_LBRMSW66_MASK                (0x4U)
#define STCU_LBRMSW_LBRMSW66_SHIFT               (2U)
#define STCU_LBRMSW_LBRMSW66_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW66(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW66_SHIFT)) & STCU_LBRMSW_LBRMSW66_MASK)

