zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_LBRMSW_LBRMSW67_MASK                (0x8U)
#define STCU_LBRMSW_LBRMSW67_SHIFT               (3U)
#define STCU_LBRMSW_LBRMSW67_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW67(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW67_SHIFT)) & STCU_LBRMSW_LBRMSW67_MASK)

#define STCU_LBRMSW_LBRMSW68_MASK                (0x10U)
#define STCU_LBRMSW_LBRMSW68_SHIFT               (4U)
#define STCU_LBRMSW_LBRMSW68_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW68(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW68_SHIFT)) & STCU_LBRMSW_LBRMSW68_MASK)

#define STCU_LBRMSW_LBRMSW69_MASK                (0x20U)
#define STCU_LBRMSW_LBRMSW69_SHIFT               (5U)
#define STCU_LBRMSW_LBRMSW69_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW69(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW69_SHIFT)) & STCU_LBRMSW_LBRMSW69_MASK)

#define STCU_LBRMSW_LBRMSW70_MASK                (0x40U)
#define STCU_LBRMSW_LBRMSW70_SHIFT               (6U)
#define STCU_LBRMSW_LBRMSW70_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW70(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW70_SHIFT)) & STCU_LBRMSW_LBRMSW70_MASK)

#define STCU_LBRMSW_LBRMSW71_MASK                (0x80U)
#define STCU_LBRMSW_LBRMSW71_SHIFT               (7U)
#define STCU_LBRMSW_LBRMSW71_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW71(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW71_SHIFT)) & STCU_LBRMSW_LBRMSW71_MASK)

#define STCU_LBRMSW_LBRMSW72_MASK                (0x100U)
#define STCU_LBRMSW_LBRMSW72_SHIFT               (8U)
#define STCU_LBRMSW_LBRMSW72_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW72(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW72_SHIFT)) & STCU_LBRMSW_LBRMSW72_MASK)

#define STCU_LBRMSW_LBRMSW73_MASK                (0x200U)
#define STCU_LBRMSW_LBRMSW73_SHIFT               (9U)
#define STCU_LBRMSW_LBRMSW73_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW73(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW73_SHIFT)) & STCU_LBRMSW_LBRMSW73_MASK)

#define STCU_LBRMSW_LBRMSW74_MASK                (0x400U)
#define STCU_LBRMSW_LBRMSW74_SHIFT               (10U)
#define STCU_LBRMSW_LBRMSW74_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW74(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW74_SHIFT)) & STCU_LBRMSW_LBRMSW74_MASK)

#define STCU_LBRMSW_LBRMSW75_MASK                (0x800U)
#define STCU_LBRMSW_LBRMSW75_SHIFT               (11U)
#define STCU_LBRMSW_LBRMSW75_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW75(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW75_SHIFT)) & STCU_LBRMSW_LBRMSW75_MASK)

#define STCU_LBRMSW_LBRMSW76_MASK                (0x1000U)
#define STCU_LBRMSW_LBRMSW76_SHIFT               (12U)
#define STCU_LBRMSW_LBRMSW76_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW76(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW76_SHIFT)) & STCU_LBRMSW_LBRMSW76_MASK)

#define STCU_LBRMSW_LBRMSW77_MASK                (0x2000U)
#define STCU_LBRMSW_LBRMSW77_SHIFT               (13U)
#define STCU_LBRMSW_LBRMSW77_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW77(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW77_SHIFT)) & STCU_LBRMSW_LBRMSW77_MASK)

#define STCU_LBRMSW_LBRMSW78_MASK                (0x4000U)
#define STCU_LBRMSW_LBRMSW78_SHIFT               (14U)
#define STCU_LBRMSW_LBRMSW78_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW78(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW78_SHIFT)) & STCU_LBRMSW_LBRMSW78_MASK)

#define STCU_LBRMSW_LBRMSW79_MASK                (0x8000U)
#define STCU_LBRMSW_LBRMSW79_SHIFT               (15U)
#define STCU_LBRMSW_LBRMSW79_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW79(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW79_SHIFT)) & STCU_LBRMSW_LBRMSW79_MASK)

#define STCU_LBRMSW_LBRMSW80_MASK                (0x10000U)
#define STCU_LBRMSW_LBRMSW80_SHIFT               (16U)
#define STCU_LBRMSW_LBRMSW80_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW80(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW80_SHIFT)) & STCU_LBRMSW_LBRMSW80_MASK)

#define STCU_LBRMSW_LBRMSW81_MASK                (0x20000U)
#define STCU_LBRMSW_LBRMSW81_SHIFT               (17U)
#define STCU_LBRMSW_LBRMSW81_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW81(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW81_SHIFT)) & STCU_LBRMSW_LBRMSW81_MASK)

#define STCU_LBRMSW_LBRMSW82_MASK                (0x40000U)
#define STCU_LBRMSW_LBRMSW82_SHIFT               (18U)
#define STCU_LBRMSW_LBRMSW82_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW82(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW82_SHIFT)) & STCU_LBRMSW_LBRMSW82_MASK)

#define STCU_LBRMSW_LBRMSW83_MASK                (0x80000U)
#define STCU_LBRMSW_LBRMSW83_SHIFT               (19U)
#define STCU_LBRMSW_LBRMSW83_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW83(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW83_SHIFT)) & STCU_LBRMSW_LBRMSW83_MASK)

#define STCU_LBRMSW_LBRMSW84_MASK                (0x100000U)
#define STCU_LBRMSW_LBRMSW84_SHIFT               (20U)
#define STCU_LBRMSW_LBRMSW84_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW84(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW84_SHIFT)) & STCU_LBRMSW_LBRMSW84_MASK)

#define STCU_LBRMSW_LBRMSW85_MASK                (0x200000U)
#define STCU_LBRMSW_LBRMSW85_SHIFT               (21U)
#define STCU_LBRMSW_LBRMSW85_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW85(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW85_SHIFT)) & STCU_LBRMSW_LBRMSW85_MASK)

#define STCU_LBRMSW_LBRMSW86_MASK                (0x400000U)
#define STCU_LBRMSW_LBRMSW86_SHIFT               (22U)
#define STCU_LBRMSW_LBRMSW86_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW86(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW86_SHIFT)) & STCU_LBRMSW_LBRMSW86_MASK)

