zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_LBRMSW_LBRMSW87_MASK                (0x800000U)
#define STCU_LBRMSW_LBRMSW87_SHIFT               (23U)
#define STCU_LBRMSW_LBRMSW87_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW87(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW87_SHIFT)) & STCU_LBRMSW_LBRMSW87_MASK)

#define STCU_LBRMSW_LBRMSW88_MASK                (0x1000000U)
#define STCU_LBRMSW_LBRMSW88_SHIFT               (24U)
#define STCU_LBRMSW_LBRMSW88_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW88(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW88_SHIFT)) & STCU_LBRMSW_LBRMSW88_MASK)

#define STCU_LBRMSW_LBRMSW89_MASK                (0x2000000U)
#define STCU_LBRMSW_LBRMSW89_SHIFT               (25U)
#define STCU_LBRMSW_LBRMSW89_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW89(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW89_SHIFT)) & STCU_LBRMSW_LBRMSW89_MASK)

#define STCU_LBRMSW_LBRMSW90_MASK                (0x4000000U)
#define STCU_LBRMSW_LBRMSW90_SHIFT               (26U)
#define STCU_LBRMSW_LBRMSW90_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW90(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW90_SHIFT)) & STCU_LBRMSW_LBRMSW90_MASK)

#define STCU_LBRMSW_LBRMSW91_MASK                (0x8000000U)
#define STCU_LBRMSW_LBRMSW91_SHIFT               (27U)
#define STCU_LBRMSW_LBRMSW91_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW91(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW91_SHIFT)) & STCU_LBRMSW_LBRMSW91_MASK)

#define STCU_LBRMSW_LBRMSW92_MASK                (0x10000000U)
#define STCU_LBRMSW_LBRMSW92_SHIFT               (28U)
#define STCU_LBRMSW_LBRMSW92_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW92(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW92_SHIFT)) & STCU_LBRMSW_LBRMSW92_MASK)

#define STCU_LBRMSW_LBRMSW93_MASK                (0x20000000U)
#define STCU_LBRMSW_LBRMSW93_SHIFT               (29U)
#define STCU_LBRMSW_LBRMSW93_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW93(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW93_SHIFT)) & STCU_LBRMSW_LBRMSW93_MASK)

#define STCU_LBRMSW_LBRMSW94_MASK                (0x40000000U)
#define STCU_LBRMSW_LBRMSW94_SHIFT               (30U)
#define STCU_LBRMSW_LBRMSW94_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW94(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW94_SHIFT)) & STCU_LBRMSW_LBRMSW94_MASK)

#define STCU_LBRMSW_LBRMSW95_MASK                (0x80000000U)
#define STCU_LBRMSW_LBRMSW95_SHIFT               (31U)
#define STCU_LBRMSW_LBRMSW95_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW95(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW95_SHIFT)) & STCU_LBRMSW_LBRMSW95_MASK)

#define STCU_LBRMSW_LBRMSW96_MASK                (0x1U)
#define STCU_LBRMSW_LBRMSW96_SHIFT               (0U)
#define STCU_LBRMSW_LBRMSW96_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW96(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW96_SHIFT)) & STCU_LBRMSW_LBRMSW96_MASK)

#define STCU_LBRMSW_LBRMSW97_MASK                (0x2U)
#define STCU_LBRMSW_LBRMSW97_SHIFT               (1U)
#define STCU_LBRMSW_LBRMSW97_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW97(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW97_SHIFT)) & STCU_LBRMSW_LBRMSW97_MASK)

#define STCU_LBRMSW_LBRMSW98_MASK                (0x4U)
#define STCU_LBRMSW_LBRMSW98_SHIFT               (2U)
#define STCU_LBRMSW_LBRMSW98_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW98(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW98_SHIFT)) & STCU_LBRMSW_LBRMSW98_MASK)

#define STCU_LBRMSW_LBRMSW99_MASK                (0x8U)
#define STCU_LBRMSW_LBRMSW99_SHIFT               (3U)
#define STCU_LBRMSW_LBRMSW99_WIDTH               (1U)
#define STCU_LBRMSW_LBRMSW99(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW99_SHIFT)) & STCU_LBRMSW_LBRMSW99_MASK)

#define STCU_LBRMSW_LBRMSW100_MASK               (0x10U)
#define STCU_LBRMSW_LBRMSW100_SHIFT              (4U)
#define STCU_LBRMSW_LBRMSW100_WIDTH              (1U)
#define STCU_LBRMSW_LBRMSW100(x)                 (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW100_SHIFT)) & STCU_LBRMSW_LBRMSW100_MASK)

#define STCU_LBRMSW_LBRMSW101_MASK               (0x20U)
#define STCU_LBRMSW_LBRMSW101_SHIFT              (5U)
#define STCU_LBRMSW_LBRMSW101_WIDTH              (1U)
#define STCU_LBRMSW_LBRMSW101(x)                 (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW101_SHIFT)) & STCU_LBRMSW_LBRMSW101_MASK)

#define STCU_LBRMSW_LBRMSW102_MASK               (0x40U)
#define STCU_LBRMSW_LBRMSW102_SHIFT              (6U)
#define STCU_LBRMSW_LBRMSW102_WIDTH              (1U)
#define STCU_LBRMSW_LBRMSW102(x)                 (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW102_SHIFT)) & STCU_LBRMSW_LBRMSW102_MASK)

#define STCU_LBRMSW_LBRMSW103_MASK               (0x80U)
#define STCU_LBRMSW_LBRMSW103_SHIFT              (7U)
#define STCU_LBRMSW_LBRMSW103_WIDTH              (1U)
#define STCU_LBRMSW_LBRMSW103(x)                 (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW103_SHIFT)) & STCU_LBRMSW_LBRMSW103_MASK)

#define STCU_LBRMSW_LBRMSW104_MASK               (0x100U)
#define STCU_LBRMSW_LBRMSW104_SHIFT              (8U)
#define STCU_LBRMSW_LBRMSW104_WIDTH              (1U)
#define STCU_LBRMSW_LBRMSW104(x)                 (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW104_SHIFT)) & STCU_LBRMSW_LBRMSW104_MASK)

#define STCU_LBRMSW_LBRMSW105_MASK               (0x200U)
#define STCU_LBRMSW_LBRMSW105_SHIFT              (9U)
#define STCU_LBRMSW_LBRMSW105_WIDTH              (1U)
#define STCU_LBRMSW_LBRMSW105(x)                 (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW105_SHIFT)) & STCU_LBRMSW_LBRMSW105_MASK)

#define STCU_LBRMSW_LBRMSW106_MASK               (0x400U)
#define STCU_LBRMSW_LBRMSW106_SHIFT              (10U)
#define STCU_LBRMSW_LBRMSW106_WIDTH              (1U)
#define STCU_LBRMSW_LBRMSW106(x)                 (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW106_SHIFT)) & STCU_LBRMSW_LBRMSW106_MASK)

#define STCU_LBRMSW_LBRMSW107_MASK               (0x800U)
#define STCU_LBRMSW_LBRMSW107_SHIFT              (11U)
#define STCU_LBRMSW_LBRMSW107_WIDTH              (1U)
#define STCU_LBRMSW_LBRMSW107(x)                 (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW107_SHIFT)) & STCU_LBRMSW_LBRMSW107_MASK)

#define STCU_LBRMSW_LBRMSW108_MASK               (0x1000U)
#define STCU_LBRMSW_LBRMSW108_SHIFT              (12U)
#define STCU_LBRMSW_LBRMSW108_WIDTH              (1U)
#define STCU_LBRMSW_LBRMSW108(x)                 (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW108_SHIFT)) & STCU_LBRMSW_LBRMSW108_MASK)

#define STCU_LBRMSW_LBRMSW109_MASK               (0x2000U)
#define STCU_LBRMSW_LBRMSW109_SHIFT              (13U)
#define STCU_LBRMSW_LBRMSW109_WIDTH              (1U)
#define STCU_LBRMSW_LBRMSW109(x)                 (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW109_SHIFT)) & STCU_LBRMSW_LBRMSW109_MASK)

#define STCU_LBRMSW_LBRMSW110_MASK               (0x4000U)
#define STCU_LBRMSW_LBRMSW110_SHIFT              (14U)
#define STCU_LBRMSW_LBRMSW110_WIDTH              (1U)
#define STCU_LBRMSW_LBRMSW110(x)                 (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW110_SHIFT)) & STCU_LBRMSW_LBRMSW110_MASK)

#define STCU_LBRMSW_LBRMSW111_MASK               (0x8000U)
#define STCU_LBRMSW_LBRMSW111_SHIFT              (15U)
#define STCU_LBRMSW_LBRMSW111_WIDTH              (1U)
#define STCU_LBRMSW_LBRMSW111(x)                 (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW111_SHIFT)) & STCU_LBRMSW_LBRMSW111_MASK)

#define STCU_LBRMSW_LBRMSW112_MASK               (0x10000U)
#define STCU_LBRMSW_LBRMSW112_SHIFT              (16U)
#define STCU_LBRMSW_LBRMSW112_WIDTH              (1U)
#define STCU_LBRMSW_LBRMSW112(x)                 (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW112_SHIFT)) & STCU_LBRMSW_LBRMSW112_MASK)

#define STCU_LBRMSW_LBRMSW113_MASK               (0x20000U)
#define STCU_LBRMSW_LBRMSW113_SHIFT              (17U)
#define STCU_LBRMSW_LBRMSW113_WIDTH              (1U)
#define STCU_LBRMSW_LBRMSW113(x)                 (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW113_SHIFT)) & STCU_LBRMSW_LBRMSW113_MASK)

#define STCU_LBRMSW_LBRMSW114_MASK               (0x40000U)
#define STCU_LBRMSW_LBRMSW114_SHIFT              (18U)
#define STCU_LBRMSW_LBRMSW114_WIDTH              (1U)
#define STCU_LBRMSW_LBRMSW114(x)                 (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW114_SHIFT)) & STCU_LBRMSW_LBRMSW114_MASK)

#define STCU_LBRMSW_LBRMSW115_MASK               (0x80000U)
#define STCU_LBRMSW_LBRMSW115_SHIFT              (19U)
#define STCU_LBRMSW_LBRMSW115_WIDTH              (1U)
#define STCU_LBRMSW_LBRMSW115(x)                 (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW115_SHIFT)) & STCU_LBRMSW_LBRMSW115_MASK)

#define STCU_LBRMSW_LBRMSW116_MASK               (0x100000U)
#define STCU_LBRMSW_LBRMSW116_SHIFT              (20U)
#define STCU_LBRMSW_LBRMSW116_WIDTH              (1U)
#define STCU_LBRMSW_LBRMSW116(x)                 (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW116_SHIFT)) & STCU_LBRMSW_LBRMSW116_MASK)

#define STCU_LBRMSW_LBRMSW117_MASK               (0x200000U)
#define STCU_LBRMSW_LBRMSW117_SHIFT              (21U)
#define STCU_LBRMSW_LBRMSW117_WIDTH              (1U)
#define STCU_LBRMSW_LBRMSW117(x)                 (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW117_SHIFT)) & STCU_LBRMSW_LBRMSW117_MASK)

#define STCU_LBRMSW_LBRMSW118_MASK               (0x400000U)
#define STCU_LBRMSW_LBRMSW118_SHIFT              (22U)
#define STCU_LBRMSW_LBRMSW118_WIDTH              (1U)
#define STCU_LBRMSW_LBRMSW118(x)                 (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW118_SHIFT)) & STCU_LBRMSW_LBRMSW118_MASK)

