zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_LBRMSW_LBRMSW119_MASK               (0x800000U)
#define STCU_LBRMSW_LBRMSW119_SHIFT              (23U)
#define STCU_LBRMSW_LBRMSW119_WIDTH              (1U)
#define STCU_LBRMSW_LBRMSW119(x)                 (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW119_SHIFT)) & STCU_LBRMSW_LBRMSW119_MASK)

#define STCU_LBRMSW_LBRMSW120_MASK               (0x1000000U)
#define STCU_LBRMSW_LBRMSW120_SHIFT              (24U)
#define STCU_LBRMSW_LBRMSW120_WIDTH              (1U)
#define STCU_LBRMSW_LBRMSW120(x)                 (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW120_SHIFT)) & STCU_LBRMSW_LBRMSW120_MASK)

#define STCU_LBRMSW_LBRMSW121_MASK               (0x2000000U)
#define STCU_LBRMSW_LBRMSW121_SHIFT              (25U)
#define STCU_LBRMSW_LBRMSW121_WIDTH              (1U)
#define STCU_LBRMSW_LBRMSW121(x)                 (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW121_SHIFT)) & STCU_LBRMSW_LBRMSW121_MASK)

#define STCU_LBRMSW_LBRMSW122_MASK               (0x4000000U)
#define STCU_LBRMSW_LBRMSW122_SHIFT              (26U)
#define STCU_LBRMSW_LBRMSW122_WIDTH              (1U)
#define STCU_LBRMSW_LBRMSW122(x)                 (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW122_SHIFT)) & STCU_LBRMSW_LBRMSW122_MASK)

#define STCU_LBRMSW_LBRMSW123_MASK               (0x8000000U)
#define STCU_LBRMSW_LBRMSW123_SHIFT              (27U)
#define STCU_LBRMSW_LBRMSW123_WIDTH              (1U)
#define STCU_LBRMSW_LBRMSW123(x)                 (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW123_SHIFT)) & STCU_LBRMSW_LBRMSW123_MASK)

#define STCU_LBRMSW_LBRMSW124_MASK               (0x10000000U)
#define STCU_LBRMSW_LBRMSW124_SHIFT              (28U)
#define STCU_LBRMSW_LBRMSW124_WIDTH              (1U)
#define STCU_LBRMSW_LBRMSW124(x)                 (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW124_SHIFT)) & STCU_LBRMSW_LBRMSW124_MASK)

#define STCU_LBRMSW_LBRMSW125_MASK               (0x20000000U)
#define STCU_LBRMSW_LBRMSW125_SHIFT              (29U)
#define STCU_LBRMSW_LBRMSW125_WIDTH              (1U)
#define STCU_LBRMSW_LBRMSW125(x)                 (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW125_SHIFT)) & STCU_LBRMSW_LBRMSW125_MASK)

#define STCU_LBRMSW_LBRMSW126_MASK               (0x40000000U)
#define STCU_LBRMSW_LBRMSW126_SHIFT              (30U)
#define STCU_LBRMSW_LBRMSW126_WIDTH              (1U)
#define STCU_LBRMSW_LBRMSW126(x)                 (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW126_SHIFT)) & STCU_LBRMSW_LBRMSW126_MASK)

#define STCU_LBRMSW_LBRMSW127_MASK               (0x80000000U)
#define STCU_LBRMSW_LBRMSW127_SHIFT              (31U)
#define STCU_LBRMSW_LBRMSW127_WIDTH              (1U)
#define STCU_LBRMSW_LBRMSW127(x)                 (((uint32_t)(((uint32_t)(x)) << STCU_LBRMSW_LBRMSW127_SHIFT)) & STCU_LBRMSW_LBRMSW127_MASK)
/*! @} */

/*! @name LBUFM - STCU2 Online LBIST Unrecoverable FM */
/*! @{ */

#define STCU_LBUFM_LBUFM0_MASK                   (0x1U)
#define STCU_LBUFM_LBUFM0_SHIFT                  (0U)
#define STCU_LBUFM_LBUFM0_WIDTH                  (1U)
#define STCU_LBUFM_LBUFM0(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM0_SHIFT)) & STCU_LBUFM_LBUFM0_MASK)

#define STCU_LBUFM_LBUFM1_MASK                   (0x2U)
#define STCU_LBUFM_LBUFM1_SHIFT                  (1U)
#define STCU_LBUFM_LBUFM1_WIDTH                  (1U)
#define STCU_LBUFM_LBUFM1(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM1_SHIFT)) & STCU_LBUFM_LBUFM1_MASK)

#define STCU_LBUFM_LBUFM2_MASK                   (0x4U)
#define STCU_LBUFM_LBUFM2_SHIFT                  (2U)
#define STCU_LBUFM_LBUFM2_WIDTH                  (1U)
#define STCU_LBUFM_LBUFM2(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM2_SHIFT)) & STCU_LBUFM_LBUFM2_MASK)

#define STCU_LBUFM_LBUFM3_MASK                   (0x8U)
#define STCU_LBUFM_LBUFM3_SHIFT                  (3U)
#define STCU_LBUFM_LBUFM3_WIDTH                  (1U)
#define STCU_LBUFM_LBUFM3(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM3_SHIFT)) & STCU_LBUFM_LBUFM3_MASK)

#define STCU_LBUFM_LBUFM4_MASK                   (0x10U)
#define STCU_LBUFM_LBUFM4_SHIFT                  (4U)
#define STCU_LBUFM_LBUFM4_WIDTH                  (1U)
#define STCU_LBUFM_LBUFM4(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM4_SHIFT)) & STCU_LBUFM_LBUFM4_MASK)

#define STCU_LBUFM_LBUFM5_MASK                   (0x20U)
#define STCU_LBUFM_LBUFM5_SHIFT                  (5U)
#define STCU_LBUFM_LBUFM5_WIDTH                  (1U)
#define STCU_LBUFM_LBUFM5(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM5_SHIFT)) & STCU_LBUFM_LBUFM5_MASK)

#define STCU_LBUFM_LBUFM6_MASK                   (0x40U)
#define STCU_LBUFM_LBUFM6_SHIFT                  (6U)
#define STCU_LBUFM_LBUFM6_WIDTH                  (1U)
#define STCU_LBUFM_LBUFM6(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM6_SHIFT)) & STCU_LBUFM_LBUFM6_MASK)

#define STCU_LBUFM_LBUFM7_MASK                   (0x80U)
#define STCU_LBUFM_LBUFM7_SHIFT                  (7U)
#define STCU_LBUFM_LBUFM7_WIDTH                  (1U)
#define STCU_LBUFM_LBUFM7(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM7_SHIFT)) & STCU_LBUFM_LBUFM7_MASK)

#define STCU_LBUFM_LBUFM8_MASK                   (0x100U)
#define STCU_LBUFM_LBUFM8_SHIFT                  (8U)
#define STCU_LBUFM_LBUFM8_WIDTH                  (1U)
#define STCU_LBUFM_LBUFM8(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM8_SHIFT)) & STCU_LBUFM_LBUFM8_MASK)

#define STCU_LBUFM_LBUFM9_MASK                   (0x200U)
#define STCU_LBUFM_LBUFM9_SHIFT                  (9U)
#define STCU_LBUFM_LBUFM9_WIDTH                  (1U)
#define STCU_LBUFM_LBUFM9(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM9_SHIFT)) & STCU_LBUFM_LBUFM9_MASK)

#define STCU_LBUFM_LBUFM10_MASK                  (0x400U)
#define STCU_LBUFM_LBUFM10_SHIFT                 (10U)
#define STCU_LBUFM_LBUFM10_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM10(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM10_SHIFT)) & STCU_LBUFM_LBUFM10_MASK)

#define STCU_LBUFM_LBUFM11_MASK                  (0x800U)
#define STCU_LBUFM_LBUFM11_SHIFT                 (11U)
#define STCU_LBUFM_LBUFM11_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM11(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM11_SHIFT)) & STCU_LBUFM_LBUFM11_MASK)

