zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_LBUFM_LBUFM12_MASK                  (0x1000U)
#define STCU_LBUFM_LBUFM12_SHIFT                 (12U)
#define STCU_LBUFM_LBUFM12_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM12(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM12_SHIFT)) & STCU_LBUFM_LBUFM12_MASK)

#define STCU_LBUFM_LBUFM13_MASK                  (0x2000U)
#define STCU_LBUFM_LBUFM13_SHIFT                 (13U)
#define STCU_LBUFM_LBUFM13_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM13(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM13_SHIFT)) & STCU_LBUFM_LBUFM13_MASK)

#define STCU_LBUFM_LBUFM14_MASK                  (0x4000U)
#define STCU_LBUFM_LBUFM14_SHIFT                 (14U)
#define STCU_LBUFM_LBUFM14_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM14(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM14_SHIFT)) & STCU_LBUFM_LBUFM14_MASK)

#define STCU_LBUFM_LBUFM15_MASK                  (0x8000U)
#define STCU_LBUFM_LBUFM15_SHIFT                 (15U)
#define STCU_LBUFM_LBUFM15_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM15(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM15_SHIFT)) & STCU_LBUFM_LBUFM15_MASK)

#define STCU_LBUFM_LBUFM16_MASK                  (0x10000U)
#define STCU_LBUFM_LBUFM16_SHIFT                 (16U)
#define STCU_LBUFM_LBUFM16_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM16(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM16_SHIFT)) & STCU_LBUFM_LBUFM16_MASK)

#define STCU_LBUFM_LBUFM17_MASK                  (0x20000U)
#define STCU_LBUFM_LBUFM17_SHIFT                 (17U)
#define STCU_LBUFM_LBUFM17_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM17(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM17_SHIFT)) & STCU_LBUFM_LBUFM17_MASK)

#define STCU_LBUFM_LBUFM18_MASK                  (0x40000U)
#define STCU_LBUFM_LBUFM18_SHIFT                 (18U)
#define STCU_LBUFM_LBUFM18_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM18(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM18_SHIFT)) & STCU_LBUFM_LBUFM18_MASK)

#define STCU_LBUFM_LBUFM19_MASK                  (0x80000U)
#define STCU_LBUFM_LBUFM19_SHIFT                 (19U)
#define STCU_LBUFM_LBUFM19_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM19(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM19_SHIFT)) & STCU_LBUFM_LBUFM19_MASK)

#define STCU_LBUFM_LBUFM20_MASK                  (0x100000U)
#define STCU_LBUFM_LBUFM20_SHIFT                 (20U)
#define STCU_LBUFM_LBUFM20_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM20(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM20_SHIFT)) & STCU_LBUFM_LBUFM20_MASK)

#define STCU_LBUFM_LBUFM21_MASK                  (0x200000U)
#define STCU_LBUFM_LBUFM21_SHIFT                 (21U)
#define STCU_LBUFM_LBUFM21_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM21(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM21_SHIFT)) & STCU_LBUFM_LBUFM21_MASK)

#define STCU_LBUFM_LBUFM22_MASK                  (0x400000U)
#define STCU_LBUFM_LBUFM22_SHIFT                 (22U)
#define STCU_LBUFM_LBUFM22_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM22(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM22_SHIFT)) & STCU_LBUFM_LBUFM22_MASK)

#define STCU_LBUFM_LBUFM23_MASK                  (0x800000U)
#define STCU_LBUFM_LBUFM23_SHIFT                 (23U)
#define STCU_LBUFM_LBUFM23_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM23(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM23_SHIFT)) & STCU_LBUFM_LBUFM23_MASK)

#define STCU_LBUFM_LBUFM24_MASK                  (0x1000000U)
#define STCU_LBUFM_LBUFM24_SHIFT                 (24U)
#define STCU_LBUFM_LBUFM24_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM24(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM24_SHIFT)) & STCU_LBUFM_LBUFM24_MASK)

#define STCU_LBUFM_LBUFM25_MASK                  (0x2000000U)
#define STCU_LBUFM_LBUFM25_SHIFT                 (25U)
#define STCU_LBUFM_LBUFM25_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM25(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM25_SHIFT)) & STCU_LBUFM_LBUFM25_MASK)

#define STCU_LBUFM_LBUFM26_MASK                  (0x4000000U)
#define STCU_LBUFM_LBUFM26_SHIFT                 (26U)
#define STCU_LBUFM_LBUFM26_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM26(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM26_SHIFT)) & STCU_LBUFM_LBUFM26_MASK)

#define STCU_LBUFM_LBUFM27_MASK                  (0x8000000U)
#define STCU_LBUFM_LBUFM27_SHIFT                 (27U)
#define STCU_LBUFM_LBUFM27_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM27(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM27_SHIFT)) & STCU_LBUFM_LBUFM27_MASK)

#define STCU_LBUFM_LBUFM28_MASK                  (0x10000000U)
#define STCU_LBUFM_LBUFM28_SHIFT                 (28U)
#define STCU_LBUFM_LBUFM28_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM28(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM28_SHIFT)) & STCU_LBUFM_LBUFM28_MASK)

#define STCU_LBUFM_LBUFM29_MASK                  (0x20000000U)
#define STCU_LBUFM_LBUFM29_SHIFT                 (29U)
#define STCU_LBUFM_LBUFM29_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM29(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM29_SHIFT)) & STCU_LBUFM_LBUFM29_MASK)

#define STCU_LBUFM_LBUFM30_MASK                  (0x40000000U)
#define STCU_LBUFM_LBUFM30_SHIFT                 (30U)
#define STCU_LBUFM_LBUFM30_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM30(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM30_SHIFT)) & STCU_LBUFM_LBUFM30_MASK)

#define STCU_LBUFM_LBUFM31_MASK                  (0x80000000U)
#define STCU_LBUFM_LBUFM31_SHIFT                 (31U)
#define STCU_LBUFM_LBUFM31_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM31(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM31_SHIFT)) & STCU_LBUFM_LBUFM31_MASK)

