zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_LBUFM_LBUFM32_MASK                  (0x1U)
#define STCU_LBUFM_LBUFM32_SHIFT                 (0U)
#define STCU_LBUFM_LBUFM32_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM32(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM32_SHIFT)) & STCU_LBUFM_LBUFM32_MASK)

#define STCU_LBUFM_LBUFM33_MASK                  (0x2U)
#define STCU_LBUFM_LBUFM33_SHIFT                 (1U)
#define STCU_LBUFM_LBUFM33_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM33(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM33_SHIFT)) & STCU_LBUFM_LBUFM33_MASK)

#define STCU_LBUFM_LBUFM34_MASK                  (0x4U)
#define STCU_LBUFM_LBUFM34_SHIFT                 (2U)
#define STCU_LBUFM_LBUFM34_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM34(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM34_SHIFT)) & STCU_LBUFM_LBUFM34_MASK)

#define STCU_LBUFM_LBUFM35_MASK                  (0x8U)
#define STCU_LBUFM_LBUFM35_SHIFT                 (3U)
#define STCU_LBUFM_LBUFM35_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM35(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM35_SHIFT)) & STCU_LBUFM_LBUFM35_MASK)

#define STCU_LBUFM_LBUFM36_MASK                  (0x10U)
#define STCU_LBUFM_LBUFM36_SHIFT                 (4U)
#define STCU_LBUFM_LBUFM36_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM36(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM36_SHIFT)) & STCU_LBUFM_LBUFM36_MASK)

#define STCU_LBUFM_LBUFM37_MASK                  (0x20U)
#define STCU_LBUFM_LBUFM37_SHIFT                 (5U)
#define STCU_LBUFM_LBUFM37_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM37(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM37_SHIFT)) & STCU_LBUFM_LBUFM37_MASK)

#define STCU_LBUFM_LBUFM38_MASK                  (0x40U)
#define STCU_LBUFM_LBUFM38_SHIFT                 (6U)
#define STCU_LBUFM_LBUFM38_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM38(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM38_SHIFT)) & STCU_LBUFM_LBUFM38_MASK)

#define STCU_LBUFM_LBUFM39_MASK                  (0x80U)
#define STCU_LBUFM_LBUFM39_SHIFT                 (7U)
#define STCU_LBUFM_LBUFM39_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM39(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM39_SHIFT)) & STCU_LBUFM_LBUFM39_MASK)

#define STCU_LBUFM_LBUFM40_MASK                  (0x100U)
#define STCU_LBUFM_LBUFM40_SHIFT                 (8U)
#define STCU_LBUFM_LBUFM40_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM40(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM40_SHIFT)) & STCU_LBUFM_LBUFM40_MASK)

#define STCU_LBUFM_LBUFM41_MASK                  (0x200U)
#define STCU_LBUFM_LBUFM41_SHIFT                 (9U)
#define STCU_LBUFM_LBUFM41_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM41(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM41_SHIFT)) & STCU_LBUFM_LBUFM41_MASK)

#define STCU_LBUFM_LBUFM42_MASK                  (0x400U)
#define STCU_LBUFM_LBUFM42_SHIFT                 (10U)
#define STCU_LBUFM_LBUFM42_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM42(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM42_SHIFT)) & STCU_LBUFM_LBUFM42_MASK)

#define STCU_LBUFM_LBUFM43_MASK                  (0x800U)
#define STCU_LBUFM_LBUFM43_SHIFT                 (11U)
#define STCU_LBUFM_LBUFM43_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM43(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM43_SHIFT)) & STCU_LBUFM_LBUFM43_MASK)

#define STCU_LBUFM_LBUFM44_MASK                  (0x1000U)
#define STCU_LBUFM_LBUFM44_SHIFT                 (12U)
#define STCU_LBUFM_LBUFM44_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM44(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM44_SHIFT)) & STCU_LBUFM_LBUFM44_MASK)

#define STCU_LBUFM_LBUFM45_MASK                  (0x2000U)
#define STCU_LBUFM_LBUFM45_SHIFT                 (13U)
#define STCU_LBUFM_LBUFM45_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM45(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM45_SHIFT)) & STCU_LBUFM_LBUFM45_MASK)

#define STCU_LBUFM_LBUFM46_MASK                  (0x4000U)
#define STCU_LBUFM_LBUFM46_SHIFT                 (14U)
#define STCU_LBUFM_LBUFM46_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM46(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM46_SHIFT)) & STCU_LBUFM_LBUFM46_MASK)

#define STCU_LBUFM_LBUFM47_MASK                  (0x8000U)
#define STCU_LBUFM_LBUFM47_SHIFT                 (15U)
#define STCU_LBUFM_LBUFM47_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM47(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM47_SHIFT)) & STCU_LBUFM_LBUFM47_MASK)

#define STCU_LBUFM_LBUFM48_MASK                  (0x10000U)
#define STCU_LBUFM_LBUFM48_SHIFT                 (16U)
#define STCU_LBUFM_LBUFM48_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM48(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM48_SHIFT)) & STCU_LBUFM_LBUFM48_MASK)

#define STCU_LBUFM_LBUFM49_MASK                  (0x20000U)
#define STCU_LBUFM_LBUFM49_SHIFT                 (17U)
#define STCU_LBUFM_LBUFM49_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM49(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM49_SHIFT)) & STCU_LBUFM_LBUFM49_MASK)

#define STCU_LBUFM_LBUFM50_MASK                  (0x40000U)
#define STCU_LBUFM_LBUFM50_SHIFT                 (18U)
#define STCU_LBUFM_LBUFM50_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM50(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM50_SHIFT)) & STCU_LBUFM_LBUFM50_MASK)

#define STCU_LBUFM_LBUFM51_MASK                  (0x80000U)
#define STCU_LBUFM_LBUFM51_SHIFT                 (19U)
#define STCU_LBUFM_LBUFM51_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM51(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM51_SHIFT)) & STCU_LBUFM_LBUFM51_MASK)

#define STCU_LBUFM_LBUFM52_MASK                  (0x100000U)
#define STCU_LBUFM_LBUFM52_SHIFT                 (20U)
#define STCU_LBUFM_LBUFM52_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM52(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM52_SHIFT)) & STCU_LBUFM_LBUFM52_MASK)

