zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_LBUFM_LBUFM53_MASK                  (0x200000U)
#define STCU_LBUFM_LBUFM53_SHIFT                 (21U)
#define STCU_LBUFM_LBUFM53_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM53(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM53_SHIFT)) & STCU_LBUFM_LBUFM53_MASK)

#define STCU_LBUFM_LBUFM54_MASK                  (0x400000U)
#define STCU_LBUFM_LBUFM54_SHIFT                 (22U)
#define STCU_LBUFM_LBUFM54_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM54(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM54_SHIFT)) & STCU_LBUFM_LBUFM54_MASK)

#define STCU_LBUFM_LBUFM55_MASK                  (0x800000U)
#define STCU_LBUFM_LBUFM55_SHIFT                 (23U)
#define STCU_LBUFM_LBUFM55_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM55(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM55_SHIFT)) & STCU_LBUFM_LBUFM55_MASK)

#define STCU_LBUFM_LBUFM56_MASK                  (0x1000000U)
#define STCU_LBUFM_LBUFM56_SHIFT                 (24U)
#define STCU_LBUFM_LBUFM56_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM56(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM56_SHIFT)) & STCU_LBUFM_LBUFM56_MASK)

#define STCU_LBUFM_LBUFM57_MASK                  (0x2000000U)
#define STCU_LBUFM_LBUFM57_SHIFT                 (25U)
#define STCU_LBUFM_LBUFM57_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM57(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM57_SHIFT)) & STCU_LBUFM_LBUFM57_MASK)

#define STCU_LBUFM_LBUFM58_MASK                  (0x4000000U)
#define STCU_LBUFM_LBUFM58_SHIFT                 (26U)
#define STCU_LBUFM_LBUFM58_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM58(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM58_SHIFT)) & STCU_LBUFM_LBUFM58_MASK)

#define STCU_LBUFM_LBUFM59_MASK                  (0x8000000U)
#define STCU_LBUFM_LBUFM59_SHIFT                 (27U)
#define STCU_LBUFM_LBUFM59_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM59(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM59_SHIFT)) & STCU_LBUFM_LBUFM59_MASK)

#define STCU_LBUFM_LBUFM60_MASK                  (0x10000000U)
#define STCU_LBUFM_LBUFM60_SHIFT                 (28U)
#define STCU_LBUFM_LBUFM60_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM60(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM60_SHIFT)) & STCU_LBUFM_LBUFM60_MASK)

#define STCU_LBUFM_LBUFM61_MASK                  (0x20000000U)
#define STCU_LBUFM_LBUFM61_SHIFT                 (29U)
#define STCU_LBUFM_LBUFM61_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM61(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM61_SHIFT)) & STCU_LBUFM_LBUFM61_MASK)

#define STCU_LBUFM_LBUFM62_MASK                  (0x40000000U)
#define STCU_LBUFM_LBUFM62_SHIFT                 (30U)
#define STCU_LBUFM_LBUFM62_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM62(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM62_SHIFT)) & STCU_LBUFM_LBUFM62_MASK)

#define STCU_LBUFM_LBUFM63_MASK                  (0x80000000U)
#define STCU_LBUFM_LBUFM63_SHIFT                 (31U)
#define STCU_LBUFM_LBUFM63_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM63(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM63_SHIFT)) & STCU_LBUFM_LBUFM63_MASK)

#define STCU_LBUFM_LBUFM64_MASK                  (0x1U)
#define STCU_LBUFM_LBUFM64_SHIFT                 (0U)
#define STCU_LBUFM_LBUFM64_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM64(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM64_SHIFT)) & STCU_LBUFM_LBUFM64_MASK)

#define STCU_LBUFM_LBUFM65_MASK                  (0x2U)
#define STCU_LBUFM_LBUFM65_SHIFT                 (1U)
#define STCU_LBUFM_LBUFM65_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM65(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM65_SHIFT)) & STCU_LBUFM_LBUFM65_MASK)

#define STCU_LBUFM_LBUFM66_MASK                  (0x4U)
#define STCU_LBUFM_LBUFM66_SHIFT                 (2U)
#define STCU_LBUFM_LBUFM66_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM66(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM66_SHIFT)) & STCU_LBUFM_LBUFM66_MASK)

#define STCU_LBUFM_LBUFM67_MASK                  (0x8U)
#define STCU_LBUFM_LBUFM67_SHIFT                 (3U)
#define STCU_LBUFM_LBUFM67_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM67(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM67_SHIFT)) & STCU_LBUFM_LBUFM67_MASK)

#define STCU_LBUFM_LBUFM68_MASK                  (0x10U)
#define STCU_LBUFM_LBUFM68_SHIFT                 (4U)
#define STCU_LBUFM_LBUFM68_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM68(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM68_SHIFT)) & STCU_LBUFM_LBUFM68_MASK)

#define STCU_LBUFM_LBUFM69_MASK                  (0x20U)
#define STCU_LBUFM_LBUFM69_SHIFT                 (5U)
#define STCU_LBUFM_LBUFM69_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM69(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM69_SHIFT)) & STCU_LBUFM_LBUFM69_MASK)

#define STCU_LBUFM_LBUFM70_MASK                  (0x40U)
#define STCU_LBUFM_LBUFM70_SHIFT                 (6U)
#define STCU_LBUFM_LBUFM70_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM70(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM70_SHIFT)) & STCU_LBUFM_LBUFM70_MASK)

#define STCU_LBUFM_LBUFM71_MASK                  (0x80U)
#define STCU_LBUFM_LBUFM71_SHIFT                 (7U)
#define STCU_LBUFM_LBUFM71_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM71(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM71_SHIFT)) & STCU_LBUFM_LBUFM71_MASK)

#define STCU_LBUFM_LBUFM72_MASK                  (0x100U)
#define STCU_LBUFM_LBUFM72_SHIFT                 (8U)
#define STCU_LBUFM_LBUFM72_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM72(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM72_SHIFT)) & STCU_LBUFM_LBUFM72_MASK)

#define STCU_LBUFM_LBUFM73_MASK                  (0x200U)
#define STCU_LBUFM_LBUFM73_SHIFT                 (9U)
#define STCU_LBUFM_LBUFM73_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM73(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM73_SHIFT)) & STCU_LBUFM_LBUFM73_MASK)

