zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_LBUFM_LBUFM74_MASK                  (0x400U)
#define STCU_LBUFM_LBUFM74_SHIFT                 (10U)
#define STCU_LBUFM_LBUFM74_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM74(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM74_SHIFT)) & STCU_LBUFM_LBUFM74_MASK)

#define STCU_LBUFM_LBUFM75_MASK                  (0x800U)
#define STCU_LBUFM_LBUFM75_SHIFT                 (11U)
#define STCU_LBUFM_LBUFM75_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM75(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM75_SHIFT)) & STCU_LBUFM_LBUFM75_MASK)

#define STCU_LBUFM_LBUFM76_MASK                  (0x1000U)
#define STCU_LBUFM_LBUFM76_SHIFT                 (12U)
#define STCU_LBUFM_LBUFM76_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM76(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM76_SHIFT)) & STCU_LBUFM_LBUFM76_MASK)

#define STCU_LBUFM_LBUFM77_MASK                  (0x2000U)
#define STCU_LBUFM_LBUFM77_SHIFT                 (13U)
#define STCU_LBUFM_LBUFM77_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM77(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM77_SHIFT)) & STCU_LBUFM_LBUFM77_MASK)

#define STCU_LBUFM_LBUFM78_MASK                  (0x4000U)
#define STCU_LBUFM_LBUFM78_SHIFT                 (14U)
#define STCU_LBUFM_LBUFM78_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM78(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM78_SHIFT)) & STCU_LBUFM_LBUFM78_MASK)

#define STCU_LBUFM_LBUFM79_MASK                  (0x8000U)
#define STCU_LBUFM_LBUFM79_SHIFT                 (15U)
#define STCU_LBUFM_LBUFM79_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM79(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM79_SHIFT)) & STCU_LBUFM_LBUFM79_MASK)

#define STCU_LBUFM_LBUFM80_MASK                  (0x10000U)
#define STCU_LBUFM_LBUFM80_SHIFT                 (16U)
#define STCU_LBUFM_LBUFM80_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM80(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM80_SHIFT)) & STCU_LBUFM_LBUFM80_MASK)

#define STCU_LBUFM_LBUFM81_MASK                  (0x20000U)
#define STCU_LBUFM_LBUFM81_SHIFT                 (17U)
#define STCU_LBUFM_LBUFM81_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM81(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM81_SHIFT)) & STCU_LBUFM_LBUFM81_MASK)

#define STCU_LBUFM_LBUFM82_MASK                  (0x40000U)
#define STCU_LBUFM_LBUFM82_SHIFT                 (18U)
#define STCU_LBUFM_LBUFM82_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM82(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM82_SHIFT)) & STCU_LBUFM_LBUFM82_MASK)

#define STCU_LBUFM_LBUFM83_MASK                  (0x80000U)
#define STCU_LBUFM_LBUFM83_SHIFT                 (19U)
#define STCU_LBUFM_LBUFM83_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM83(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM83_SHIFT)) & STCU_LBUFM_LBUFM83_MASK)

#define STCU_LBUFM_LBUFM84_MASK                  (0x100000U)
#define STCU_LBUFM_LBUFM84_SHIFT                 (20U)
#define STCU_LBUFM_LBUFM84_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM84(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM84_SHIFT)) & STCU_LBUFM_LBUFM84_MASK)

#define STCU_LBUFM_LBUFM85_MASK                  (0x200000U)
#define STCU_LBUFM_LBUFM85_SHIFT                 (21U)
#define STCU_LBUFM_LBUFM85_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM85(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM85_SHIFT)) & STCU_LBUFM_LBUFM85_MASK)

#define STCU_LBUFM_LBUFM86_MASK                  (0x400000U)
#define STCU_LBUFM_LBUFM86_SHIFT                 (22U)
#define STCU_LBUFM_LBUFM86_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM86(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM86_SHIFT)) & STCU_LBUFM_LBUFM86_MASK)

#define STCU_LBUFM_LBUFM87_MASK                  (0x800000U)
#define STCU_LBUFM_LBUFM87_SHIFT                 (23U)
#define STCU_LBUFM_LBUFM87_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM87(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM87_SHIFT)) & STCU_LBUFM_LBUFM87_MASK)

#define STCU_LBUFM_LBUFM88_MASK                  (0x1000000U)
#define STCU_LBUFM_LBUFM88_SHIFT                 (24U)
#define STCU_LBUFM_LBUFM88_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM88(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM88_SHIFT)) & STCU_LBUFM_LBUFM88_MASK)

#define STCU_LBUFM_LBUFM89_MASK                  (0x2000000U)
#define STCU_LBUFM_LBUFM89_SHIFT                 (25U)
#define STCU_LBUFM_LBUFM89_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM89(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM89_SHIFT)) & STCU_LBUFM_LBUFM89_MASK)

#define STCU_LBUFM_LBUFM90_MASK                  (0x4000000U)
#define STCU_LBUFM_LBUFM90_SHIFT                 (26U)
#define STCU_LBUFM_LBUFM90_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM90(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM90_SHIFT)) & STCU_LBUFM_LBUFM90_MASK)

#define STCU_LBUFM_LBUFM91_MASK                  (0x8000000U)
#define STCU_LBUFM_LBUFM91_SHIFT                 (27U)
#define STCU_LBUFM_LBUFM91_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM91(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM91_SHIFT)) & STCU_LBUFM_LBUFM91_MASK)

#define STCU_LBUFM_LBUFM92_MASK                  (0x10000000U)
#define STCU_LBUFM_LBUFM92_SHIFT                 (28U)
#define STCU_LBUFM_LBUFM92_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM92(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM92_SHIFT)) & STCU_LBUFM_LBUFM92_MASK)

#define STCU_LBUFM_LBUFM93_MASK                  (0x20000000U)
#define STCU_LBUFM_LBUFM93_SHIFT                 (29U)
#define STCU_LBUFM_LBUFM93_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM93(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM93_SHIFT)) & STCU_LBUFM_LBUFM93_MASK)

#define STCU_LBUFM_LBUFM94_MASK                  (0x40000000U)
#define STCU_LBUFM_LBUFM94_SHIFT                 (30U)
#define STCU_LBUFM_LBUFM94_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM94(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM94_SHIFT)) & STCU_LBUFM_LBUFM94_MASK)

#define STCU_LBUFM_LBUFM95_MASK                  (0x80000000U)
#define STCU_LBUFM_LBUFM95_SHIFT                 (31U)
#define STCU_LBUFM_LBUFM95_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM95(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM95_SHIFT)) & STCU_LBUFM_LBUFM95_MASK)

#define STCU_LBUFM_LBUFM96_MASK                  (0x1U)
#define STCU_LBUFM_LBUFM96_SHIFT                 (0U)
#define STCU_LBUFM_LBUFM96_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM96(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM96_SHIFT)) & STCU_LBUFM_LBUFM96_MASK)

#define STCU_LBUFM_LBUFM97_MASK                  (0x2U)
#define STCU_LBUFM_LBUFM97_SHIFT                 (1U)
#define STCU_LBUFM_LBUFM97_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM97(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM97_SHIFT)) & STCU_LBUFM_LBUFM97_MASK)

