zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_LBUFM_LBUFM98_MASK                  (0x4U)
#define STCU_LBUFM_LBUFM98_SHIFT                 (2U)
#define STCU_LBUFM_LBUFM98_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM98(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM98_SHIFT)) & STCU_LBUFM_LBUFM98_MASK)

#define STCU_LBUFM_LBUFM99_MASK                  (0x8U)
#define STCU_LBUFM_LBUFM99_SHIFT                 (3U)
#define STCU_LBUFM_LBUFM99_WIDTH                 (1U)
#define STCU_LBUFM_LBUFM99(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM99_SHIFT)) & STCU_LBUFM_LBUFM99_MASK)

#define STCU_LBUFM_LBUFM100_MASK                 (0x10U)
#define STCU_LBUFM_LBUFM100_SHIFT                (4U)
#define STCU_LBUFM_LBUFM100_WIDTH                (1U)
#define STCU_LBUFM_LBUFM100(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM100_SHIFT)) & STCU_LBUFM_LBUFM100_MASK)

#define STCU_LBUFM_LBUFM101_MASK                 (0x20U)
#define STCU_LBUFM_LBUFM101_SHIFT                (5U)
#define STCU_LBUFM_LBUFM101_WIDTH                (1U)
#define STCU_LBUFM_LBUFM101(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM101_SHIFT)) & STCU_LBUFM_LBUFM101_MASK)

#define STCU_LBUFM_LBUFM102_MASK                 (0x40U)
#define STCU_LBUFM_LBUFM102_SHIFT                (6U)
#define STCU_LBUFM_LBUFM102_WIDTH                (1U)
#define STCU_LBUFM_LBUFM102(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM102_SHIFT)) & STCU_LBUFM_LBUFM102_MASK)

#define STCU_LBUFM_LBUFM103_MASK                 (0x80U)
#define STCU_LBUFM_LBUFM103_SHIFT                (7U)
#define STCU_LBUFM_LBUFM103_WIDTH                (1U)
#define STCU_LBUFM_LBUFM103(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM103_SHIFT)) & STCU_LBUFM_LBUFM103_MASK)

#define STCU_LBUFM_LBUFM104_MASK                 (0x100U)
#define STCU_LBUFM_LBUFM104_SHIFT                (8U)
#define STCU_LBUFM_LBUFM104_WIDTH                (1U)
#define STCU_LBUFM_LBUFM104(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM104_SHIFT)) & STCU_LBUFM_LBUFM104_MASK)

#define STCU_LBUFM_LBUFM105_MASK                 (0x200U)
#define STCU_LBUFM_LBUFM105_SHIFT                (9U)
#define STCU_LBUFM_LBUFM105_WIDTH                (1U)
#define STCU_LBUFM_LBUFM105(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM105_SHIFT)) & STCU_LBUFM_LBUFM105_MASK)

#define STCU_LBUFM_LBUFM106_MASK                 (0x400U)
#define STCU_LBUFM_LBUFM106_SHIFT                (10U)
#define STCU_LBUFM_LBUFM106_WIDTH                (1U)
#define STCU_LBUFM_LBUFM106(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM106_SHIFT)) & STCU_LBUFM_LBUFM106_MASK)

#define STCU_LBUFM_LBUFM107_MASK                 (0x800U)
#define STCU_LBUFM_LBUFM107_SHIFT                (11U)
#define STCU_LBUFM_LBUFM107_WIDTH                (1U)
#define STCU_LBUFM_LBUFM107(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM107_SHIFT)) & STCU_LBUFM_LBUFM107_MASK)

#define STCU_LBUFM_LBUFM108_MASK                 (0x1000U)
#define STCU_LBUFM_LBUFM108_SHIFT                (12U)
#define STCU_LBUFM_LBUFM108_WIDTH                (1U)
#define STCU_LBUFM_LBUFM108(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM108_SHIFT)) & STCU_LBUFM_LBUFM108_MASK)

#define STCU_LBUFM_LBUFM109_MASK                 (0x2000U)
#define STCU_LBUFM_LBUFM109_SHIFT                (13U)
#define STCU_LBUFM_LBUFM109_WIDTH                (1U)
#define STCU_LBUFM_LBUFM109(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM109_SHIFT)) & STCU_LBUFM_LBUFM109_MASK)

#define STCU_LBUFM_LBUFM110_MASK                 (0x4000U)
#define STCU_LBUFM_LBUFM110_SHIFT                (14U)
#define STCU_LBUFM_LBUFM110_WIDTH                (1U)
#define STCU_LBUFM_LBUFM110(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM110_SHIFT)) & STCU_LBUFM_LBUFM110_MASK)

#define STCU_LBUFM_LBUFM111_MASK                 (0x8000U)
#define STCU_LBUFM_LBUFM111_SHIFT                (15U)
#define STCU_LBUFM_LBUFM111_WIDTH                (1U)
#define STCU_LBUFM_LBUFM111(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM111_SHIFT)) & STCU_LBUFM_LBUFM111_MASK)

#define STCU_LBUFM_LBUFM112_MASK                 (0x10000U)
#define STCU_LBUFM_LBUFM112_SHIFT                (16U)
#define STCU_LBUFM_LBUFM112_WIDTH                (1U)
#define STCU_LBUFM_LBUFM112(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM112_SHIFT)) & STCU_LBUFM_LBUFM112_MASK)

#define STCU_LBUFM_LBUFM113_MASK                 (0x20000U)
#define STCU_LBUFM_LBUFM113_SHIFT                (17U)
#define STCU_LBUFM_LBUFM113_WIDTH                (1U)
#define STCU_LBUFM_LBUFM113(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM113_SHIFT)) & STCU_LBUFM_LBUFM113_MASK)

#define STCU_LBUFM_LBUFM114_MASK                 (0x40000U)
#define STCU_LBUFM_LBUFM114_SHIFT                (18U)
#define STCU_LBUFM_LBUFM114_WIDTH                (1U)
#define STCU_LBUFM_LBUFM114(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM114_SHIFT)) & STCU_LBUFM_LBUFM114_MASK)

#define STCU_LBUFM_LBUFM115_MASK                 (0x80000U)
#define STCU_LBUFM_LBUFM115_SHIFT                (19U)
#define STCU_LBUFM_LBUFM115_WIDTH                (1U)
#define STCU_LBUFM_LBUFM115(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM115_SHIFT)) & STCU_LBUFM_LBUFM115_MASK)

#define STCU_LBUFM_LBUFM116_MASK                 (0x100000U)
#define STCU_LBUFM_LBUFM116_SHIFT                (20U)
#define STCU_LBUFM_LBUFM116_WIDTH                (1U)
#define STCU_LBUFM_LBUFM116(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM116_SHIFT)) & STCU_LBUFM_LBUFM116_MASK)

#define STCU_LBUFM_LBUFM117_MASK                 (0x200000U)
#define STCU_LBUFM_LBUFM117_SHIFT                (21U)
#define STCU_LBUFM_LBUFM117_WIDTH                (1U)
#define STCU_LBUFM_LBUFM117(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM117_SHIFT)) & STCU_LBUFM_LBUFM117_MASK)

