zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_LBUFM_LBUFM118_MASK                 (0x400000U)
#define STCU_LBUFM_LBUFM118_SHIFT                (22U)
#define STCU_LBUFM_LBUFM118_WIDTH                (1U)
#define STCU_LBUFM_LBUFM118(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM118_SHIFT)) & STCU_LBUFM_LBUFM118_MASK)

#define STCU_LBUFM_LBUFM119_MASK                 (0x800000U)
#define STCU_LBUFM_LBUFM119_SHIFT                (23U)
#define STCU_LBUFM_LBUFM119_WIDTH                (1U)
#define STCU_LBUFM_LBUFM119(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM119_SHIFT)) & STCU_LBUFM_LBUFM119_MASK)

#define STCU_LBUFM_LBUFM120_MASK                 (0x1000000U)
#define STCU_LBUFM_LBUFM120_SHIFT                (24U)
#define STCU_LBUFM_LBUFM120_WIDTH                (1U)
#define STCU_LBUFM_LBUFM120(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM120_SHIFT)) & STCU_LBUFM_LBUFM120_MASK)

#define STCU_LBUFM_LBUFM121_MASK                 (0x2000000U)
#define STCU_LBUFM_LBUFM121_SHIFT                (25U)
#define STCU_LBUFM_LBUFM121_WIDTH                (1U)
#define STCU_LBUFM_LBUFM121(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM121_SHIFT)) & STCU_LBUFM_LBUFM121_MASK)

#define STCU_LBUFM_LBUFM122_MASK                 (0x4000000U)
#define STCU_LBUFM_LBUFM122_SHIFT                (26U)
#define STCU_LBUFM_LBUFM122_WIDTH                (1U)
#define STCU_LBUFM_LBUFM122(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM122_SHIFT)) & STCU_LBUFM_LBUFM122_MASK)

#define STCU_LBUFM_LBUFM123_MASK                 (0x8000000U)
#define STCU_LBUFM_LBUFM123_SHIFT                (27U)
#define STCU_LBUFM_LBUFM123_WIDTH                (1U)
#define STCU_LBUFM_LBUFM123(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM123_SHIFT)) & STCU_LBUFM_LBUFM123_MASK)

#define STCU_LBUFM_LBUFM124_MASK                 (0x10000000U)
#define STCU_LBUFM_LBUFM124_SHIFT                (28U)
#define STCU_LBUFM_LBUFM124_WIDTH                (1U)
#define STCU_LBUFM_LBUFM124(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM124_SHIFT)) & STCU_LBUFM_LBUFM124_MASK)

#define STCU_LBUFM_LBUFM125_MASK                 (0x20000000U)
#define STCU_LBUFM_LBUFM125_SHIFT                (29U)
#define STCU_LBUFM_LBUFM125_WIDTH                (1U)
#define STCU_LBUFM_LBUFM125(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM125_SHIFT)) & STCU_LBUFM_LBUFM125_MASK)

#define STCU_LBUFM_LBUFM126_MASK                 (0x40000000U)
#define STCU_LBUFM_LBUFM126_SHIFT                (30U)
#define STCU_LBUFM_LBUFM126_WIDTH                (1U)
#define STCU_LBUFM_LBUFM126(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM126_SHIFT)) & STCU_LBUFM_LBUFM126_MASK)

#define STCU_LBUFM_LBUFM127_MASK                 (0x80000000U)
#define STCU_LBUFM_LBUFM127_SHIFT                (31U)
#define STCU_LBUFM_LBUFM127_WIDTH                (1U)
#define STCU_LBUFM_LBUFM127(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM_LBUFM127_SHIFT)) & STCU_LBUFM_LBUFM127_MASK)
/*! @} */

/*! @name MBSSW - STCU2 Online MBIST Status */
/*! @{ */

#define STCU_MBSSW_MBSSW0_MASK                   (0x1U)
#define STCU_MBSSW_MBSSW0_SHIFT                  (0U)
#define STCU_MBSSW_MBSSW0_WIDTH                  (1U)
#define STCU_MBSSW_MBSSW0(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW0_SHIFT)) & STCU_MBSSW_MBSSW0_MASK)

#define STCU_MBSSW_MBSSW1_MASK                   (0x2U)
#define STCU_MBSSW_MBSSW1_SHIFT                  (1U)
#define STCU_MBSSW_MBSSW1_WIDTH                  (1U)
#define STCU_MBSSW_MBSSW1(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW1_SHIFT)) & STCU_MBSSW_MBSSW1_MASK)

#define STCU_MBSSW_MBSSW2_MASK                   (0x4U)
#define STCU_MBSSW_MBSSW2_SHIFT                  (2U)
#define STCU_MBSSW_MBSSW2_WIDTH                  (1U)
#define STCU_MBSSW_MBSSW2(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW2_SHIFT)) & STCU_MBSSW_MBSSW2_MASK)

#define STCU_MBSSW_MBSSW3_MASK                   (0x8U)
#define STCU_MBSSW_MBSSW3_SHIFT                  (3U)
#define STCU_MBSSW_MBSSW3_WIDTH                  (1U)
#define STCU_MBSSW_MBSSW3(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW3_SHIFT)) & STCU_MBSSW_MBSSW3_MASK)

#define STCU_MBSSW_MBSSW4_MASK                   (0x10U)
#define STCU_MBSSW_MBSSW4_SHIFT                  (4U)
#define STCU_MBSSW_MBSSW4_WIDTH                  (1U)
#define STCU_MBSSW_MBSSW4(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW4_SHIFT)) & STCU_MBSSW_MBSSW4_MASK)

#define STCU_MBSSW_MBSSW5_MASK                   (0x20U)
#define STCU_MBSSW_MBSSW5_SHIFT                  (5U)
#define STCU_MBSSW_MBSSW5_WIDTH                  (1U)
#define STCU_MBSSW_MBSSW5(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW5_SHIFT)) & STCU_MBSSW_MBSSW5_MASK)

#define STCU_MBSSW_MBSSW6_MASK                   (0x40U)
#define STCU_MBSSW_MBSSW6_SHIFT                  (6U)
#define STCU_MBSSW_MBSSW6_WIDTH                  (1U)
#define STCU_MBSSW_MBSSW6(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW6_SHIFT)) & STCU_MBSSW_MBSSW6_MASK)

#define STCU_MBSSW_MBSSW7_MASK                   (0x80U)
#define STCU_MBSSW_MBSSW7_SHIFT                  (7U)
#define STCU_MBSSW_MBSSW7_WIDTH                  (1U)
#define STCU_MBSSW_MBSSW7(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW7_SHIFT)) & STCU_MBSSW_MBSSW7_MASK)

#define STCU_MBSSW_MBSSW8_MASK                   (0x100U)
#define STCU_MBSSW_MBSSW8_SHIFT                  (8U)
#define STCU_MBSSW_MBSSW8_WIDTH                  (1U)
#define STCU_MBSSW_MBSSW8(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW8_SHIFT)) & STCU_MBSSW_MBSSW8_MASK)

#define STCU_MBSSW_MBSSW9_MASK                   (0x200U)
#define STCU_MBSSW_MBSSW9_SHIFT                  (9U)
#define STCU_MBSSW_MBSSW9_WIDTH                  (1U)
#define STCU_MBSSW_MBSSW9(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW9_SHIFT)) & STCU_MBSSW_MBSSW9_MASK)

