zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBSSW_MBSSW10_MASK                  (0x400U)
#define STCU_MBSSW_MBSSW10_SHIFT                 (10U)
#define STCU_MBSSW_MBSSW10_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW10(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW10_SHIFT)) & STCU_MBSSW_MBSSW10_MASK)

#define STCU_MBSSW_MBSSW11_MASK                  (0x800U)
#define STCU_MBSSW_MBSSW11_SHIFT                 (11U)
#define STCU_MBSSW_MBSSW11_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW11(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW11_SHIFT)) & STCU_MBSSW_MBSSW11_MASK)

#define STCU_MBSSW_MBSSW12_MASK                  (0x1000U)
#define STCU_MBSSW_MBSSW12_SHIFT                 (12U)
#define STCU_MBSSW_MBSSW12_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW12(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW12_SHIFT)) & STCU_MBSSW_MBSSW12_MASK)

#define STCU_MBSSW_MBSSW13_MASK                  (0x2000U)
#define STCU_MBSSW_MBSSW13_SHIFT                 (13U)
#define STCU_MBSSW_MBSSW13_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW13(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW13_SHIFT)) & STCU_MBSSW_MBSSW13_MASK)

#define STCU_MBSSW_MBSSW14_MASK                  (0x4000U)
#define STCU_MBSSW_MBSSW14_SHIFT                 (14U)
#define STCU_MBSSW_MBSSW14_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW14(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW14_SHIFT)) & STCU_MBSSW_MBSSW14_MASK)

#define STCU_MBSSW_MBSSW15_MASK                  (0x8000U)
#define STCU_MBSSW_MBSSW15_SHIFT                 (15U)
#define STCU_MBSSW_MBSSW15_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW15(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW15_SHIFT)) & STCU_MBSSW_MBSSW15_MASK)

#define STCU_MBSSW_MBSSW16_MASK                  (0x10000U)
#define STCU_MBSSW_MBSSW16_SHIFT                 (16U)
#define STCU_MBSSW_MBSSW16_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW16(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW16_SHIFT)) & STCU_MBSSW_MBSSW16_MASK)

#define STCU_MBSSW_MBSSW17_MASK                  (0x20000U)
#define STCU_MBSSW_MBSSW17_SHIFT                 (17U)
#define STCU_MBSSW_MBSSW17_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW17(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW17_SHIFT)) & STCU_MBSSW_MBSSW17_MASK)

#define STCU_MBSSW_MBSSW18_MASK                  (0x40000U)
#define STCU_MBSSW_MBSSW18_SHIFT                 (18U)
#define STCU_MBSSW_MBSSW18_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW18(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW18_SHIFT)) & STCU_MBSSW_MBSSW18_MASK)

#define STCU_MBSSW_MBSSW19_MASK                  (0x80000U)
#define STCU_MBSSW_MBSSW19_SHIFT                 (19U)
#define STCU_MBSSW_MBSSW19_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW19(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW19_SHIFT)) & STCU_MBSSW_MBSSW19_MASK)

#define STCU_MBSSW_MBSSW20_MASK                  (0x100000U)
#define STCU_MBSSW_MBSSW20_SHIFT                 (20U)
#define STCU_MBSSW_MBSSW20_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW20(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW20_SHIFT)) & STCU_MBSSW_MBSSW20_MASK)

#define STCU_MBSSW_MBSSW21_MASK                  (0x200000U)
#define STCU_MBSSW_MBSSW21_SHIFT                 (21U)
#define STCU_MBSSW_MBSSW21_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW21(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW21_SHIFT)) & STCU_MBSSW_MBSSW21_MASK)

#define STCU_MBSSW_MBSSW22_MASK                  (0x400000U)
#define STCU_MBSSW_MBSSW22_SHIFT                 (22U)
#define STCU_MBSSW_MBSSW22_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW22(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW22_SHIFT)) & STCU_MBSSW_MBSSW22_MASK)

#define STCU_MBSSW_MBSSW23_MASK                  (0x800000U)
#define STCU_MBSSW_MBSSW23_SHIFT                 (23U)
#define STCU_MBSSW_MBSSW23_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW23(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW23_SHIFT)) & STCU_MBSSW_MBSSW23_MASK)

#define STCU_MBSSW_MBSSW24_MASK                  (0x1000000U)
#define STCU_MBSSW_MBSSW24_SHIFT                 (24U)
#define STCU_MBSSW_MBSSW24_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW24(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW24_SHIFT)) & STCU_MBSSW_MBSSW24_MASK)

#define STCU_MBSSW_MBSSW25_MASK                  (0x2000000U)
#define STCU_MBSSW_MBSSW25_SHIFT                 (25U)
#define STCU_MBSSW_MBSSW25_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW25(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW25_SHIFT)) & STCU_MBSSW_MBSSW25_MASK)

#define STCU_MBSSW_MBSSW26_MASK                  (0x4000000U)
#define STCU_MBSSW_MBSSW26_SHIFT                 (26U)
#define STCU_MBSSW_MBSSW26_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW26(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW26_SHIFT)) & STCU_MBSSW_MBSSW26_MASK)

#define STCU_MBSSW_MBSSW27_MASK                  (0x8000000U)
#define STCU_MBSSW_MBSSW27_SHIFT                 (27U)
#define STCU_MBSSW_MBSSW27_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW27(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW27_SHIFT)) & STCU_MBSSW_MBSSW27_MASK)

#define STCU_MBSSW_MBSSW28_MASK                  (0x10000000U)
#define STCU_MBSSW_MBSSW28_SHIFT                 (28U)
#define STCU_MBSSW_MBSSW28_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW28(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW28_SHIFT)) & STCU_MBSSW_MBSSW28_MASK)

#define STCU_MBSSW_MBSSW29_MASK                  (0x20000000U)
#define STCU_MBSSW_MBSSW29_SHIFT                 (29U)
#define STCU_MBSSW_MBSSW29_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW29(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW29_SHIFT)) & STCU_MBSSW_MBSSW29_MASK)

#define STCU_MBSSW_MBSSW30_MASK                  (0x40000000U)
#define STCU_MBSSW_MBSSW30_SHIFT                 (30U)
#define STCU_MBSSW_MBSSW30_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW30(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW30_SHIFT)) & STCU_MBSSW_MBSSW30_MASK)

#define STCU_MBSSW_MBSSW31_MASK                  (0x80000000U)
#define STCU_MBSSW_MBSSW31_SHIFT                 (31U)
#define STCU_MBSSW_MBSSW31_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW31(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW31_SHIFT)) & STCU_MBSSW_MBSSW31_MASK)

#define STCU_MBSSW_MBSSW32_MASK                  (0x1U)
#define STCU_MBSSW_MBSSW32_SHIFT                 (0U)
#define STCU_MBSSW_MBSSW32_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW32(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW32_SHIFT)) & STCU_MBSSW_MBSSW32_MASK)

#define STCU_MBSSW_MBSSW33_MASK                  (0x2U)
#define STCU_MBSSW_MBSSW33_SHIFT                 (1U)
#define STCU_MBSSW_MBSSW33_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW33(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW33_SHIFT)) & STCU_MBSSW_MBSSW33_MASK)

#define STCU_MBSSW_MBSSW34_MASK                  (0x4U)
#define STCU_MBSSW_MBSSW34_SHIFT                 (2U)
#define STCU_MBSSW_MBSSW34_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW34(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW34_SHIFT)) & STCU_MBSSW_MBSSW34_MASK)

#define STCU_MBSSW_MBSSW35_MASK                  (0x8U)
#define STCU_MBSSW_MBSSW35_SHIFT                 (3U)
#define STCU_MBSSW_MBSSW35_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW35(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW35_SHIFT)) & STCU_MBSSW_MBSSW35_MASK)

