zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBSSW_MBSSW36_MASK                  (0x10U)
#define STCU_MBSSW_MBSSW36_SHIFT                 (4U)
#define STCU_MBSSW_MBSSW36_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW36(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW36_SHIFT)) & STCU_MBSSW_MBSSW36_MASK)

#define STCU_MBSSW_MBSSW37_MASK                  (0x20U)
#define STCU_MBSSW_MBSSW37_SHIFT                 (5U)
#define STCU_MBSSW_MBSSW37_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW37(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW37_SHIFT)) & STCU_MBSSW_MBSSW37_MASK)

#define STCU_MBSSW_MBSSW38_MASK                  (0x40U)
#define STCU_MBSSW_MBSSW38_SHIFT                 (6U)
#define STCU_MBSSW_MBSSW38_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW38(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW38_SHIFT)) & STCU_MBSSW_MBSSW38_MASK)

#define STCU_MBSSW_MBSSW39_MASK                  (0x80U)
#define STCU_MBSSW_MBSSW39_SHIFT                 (7U)
#define STCU_MBSSW_MBSSW39_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW39(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW39_SHIFT)) & STCU_MBSSW_MBSSW39_MASK)

#define STCU_MBSSW_MBSSW40_MASK                  (0x100U)
#define STCU_MBSSW_MBSSW40_SHIFT                 (8U)
#define STCU_MBSSW_MBSSW40_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW40(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW40_SHIFT)) & STCU_MBSSW_MBSSW40_MASK)

#define STCU_MBSSW_MBSSW41_MASK                  (0x200U)
#define STCU_MBSSW_MBSSW41_SHIFT                 (9U)
#define STCU_MBSSW_MBSSW41_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW41(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW41_SHIFT)) & STCU_MBSSW_MBSSW41_MASK)

#define STCU_MBSSW_MBSSW42_MASK                  (0x400U)
#define STCU_MBSSW_MBSSW42_SHIFT                 (10U)
#define STCU_MBSSW_MBSSW42_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW42(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW42_SHIFT)) & STCU_MBSSW_MBSSW42_MASK)

#define STCU_MBSSW_MBSSW43_MASK                  (0x800U)
#define STCU_MBSSW_MBSSW43_SHIFT                 (11U)
#define STCU_MBSSW_MBSSW43_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW43(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW43_SHIFT)) & STCU_MBSSW_MBSSW43_MASK)

#define STCU_MBSSW_MBSSW44_MASK                  (0x1000U)
#define STCU_MBSSW_MBSSW44_SHIFT                 (12U)
#define STCU_MBSSW_MBSSW44_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW44(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW44_SHIFT)) & STCU_MBSSW_MBSSW44_MASK)

#define STCU_MBSSW_MBSSW45_MASK                  (0x2000U)
#define STCU_MBSSW_MBSSW45_SHIFT                 (13U)
#define STCU_MBSSW_MBSSW45_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW45(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW45_SHIFT)) & STCU_MBSSW_MBSSW45_MASK)

#define STCU_MBSSW_MBSSW46_MASK                  (0x4000U)
#define STCU_MBSSW_MBSSW46_SHIFT                 (14U)
#define STCU_MBSSW_MBSSW46_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW46(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW46_SHIFT)) & STCU_MBSSW_MBSSW46_MASK)

#define STCU_MBSSW_MBSSW47_MASK                  (0x8000U)
#define STCU_MBSSW_MBSSW47_SHIFT                 (15U)
#define STCU_MBSSW_MBSSW47_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW47(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW47_SHIFT)) & STCU_MBSSW_MBSSW47_MASK)

#define STCU_MBSSW_MBSSW48_MASK                  (0x10000U)
#define STCU_MBSSW_MBSSW48_SHIFT                 (16U)
#define STCU_MBSSW_MBSSW48_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW48(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW48_SHIFT)) & STCU_MBSSW_MBSSW48_MASK)

#define STCU_MBSSW_MBSSW49_MASK                  (0x20000U)
#define STCU_MBSSW_MBSSW49_SHIFT                 (17U)
#define STCU_MBSSW_MBSSW49_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW49(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW49_SHIFT)) & STCU_MBSSW_MBSSW49_MASK)

#define STCU_MBSSW_MBSSW50_MASK                  (0x40000U)
#define STCU_MBSSW_MBSSW50_SHIFT                 (18U)
#define STCU_MBSSW_MBSSW50_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW50(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW50_SHIFT)) & STCU_MBSSW_MBSSW50_MASK)

#define STCU_MBSSW_MBSSW51_MASK                  (0x80000U)
#define STCU_MBSSW_MBSSW51_SHIFT                 (19U)
#define STCU_MBSSW_MBSSW51_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW51(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW51_SHIFT)) & STCU_MBSSW_MBSSW51_MASK)

#define STCU_MBSSW_MBSSW52_MASK                  (0x100000U)
#define STCU_MBSSW_MBSSW52_SHIFT                 (20U)
#define STCU_MBSSW_MBSSW52_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW52(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW52_SHIFT)) & STCU_MBSSW_MBSSW52_MASK)

#define STCU_MBSSW_MBSSW53_MASK                  (0x200000U)
#define STCU_MBSSW_MBSSW53_SHIFT                 (21U)
#define STCU_MBSSW_MBSSW53_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW53(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW53_SHIFT)) & STCU_MBSSW_MBSSW53_MASK)

#define STCU_MBSSW_MBSSW54_MASK                  (0x400000U)
#define STCU_MBSSW_MBSSW54_SHIFT                 (22U)
#define STCU_MBSSW_MBSSW54_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW54(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW54_SHIFT)) & STCU_MBSSW_MBSSW54_MASK)

#define STCU_MBSSW_MBSSW55_MASK                  (0x800000U)
#define STCU_MBSSW_MBSSW55_SHIFT                 (23U)
#define STCU_MBSSW_MBSSW55_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW55(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW55_SHIFT)) & STCU_MBSSW_MBSSW55_MASK)

#define STCU_MBSSW_MBSSW56_MASK                  (0x1000000U)
#define STCU_MBSSW_MBSSW56_SHIFT                 (24U)
#define STCU_MBSSW_MBSSW56_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW56(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW56_SHIFT)) & STCU_MBSSW_MBSSW56_MASK)

#define STCU_MBSSW_MBSSW57_MASK                  (0x2000000U)
#define STCU_MBSSW_MBSSW57_SHIFT                 (25U)
#define STCU_MBSSW_MBSSW57_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW57(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW57_SHIFT)) & STCU_MBSSW_MBSSW57_MASK)

