zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBSSW_MBSSW58_MASK                  (0x4000000U)
#define STCU_MBSSW_MBSSW58_SHIFT                 (26U)
#define STCU_MBSSW_MBSSW58_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW58(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW58_SHIFT)) & STCU_MBSSW_MBSSW58_MASK)

#define STCU_MBSSW_MBSSW59_MASK                  (0x8000000U)
#define STCU_MBSSW_MBSSW59_SHIFT                 (27U)
#define STCU_MBSSW_MBSSW59_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW59(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW59_SHIFT)) & STCU_MBSSW_MBSSW59_MASK)

#define STCU_MBSSW_MBSSW60_MASK                  (0x10000000U)
#define STCU_MBSSW_MBSSW60_SHIFT                 (28U)
#define STCU_MBSSW_MBSSW60_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW60(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW60_SHIFT)) & STCU_MBSSW_MBSSW60_MASK)

#define STCU_MBSSW_MBSSW61_MASK                  (0x20000000U)
#define STCU_MBSSW_MBSSW61_SHIFT                 (29U)
#define STCU_MBSSW_MBSSW61_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW61(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW61_SHIFT)) & STCU_MBSSW_MBSSW61_MASK)

#define STCU_MBSSW_MBSSW62_MASK                  (0x40000000U)
#define STCU_MBSSW_MBSSW62_SHIFT                 (30U)
#define STCU_MBSSW_MBSSW62_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW62(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW62_SHIFT)) & STCU_MBSSW_MBSSW62_MASK)

#define STCU_MBSSW_MBSSW63_MASK                  (0x80000000U)
#define STCU_MBSSW_MBSSW63_SHIFT                 (31U)
#define STCU_MBSSW_MBSSW63_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW63(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW63_SHIFT)) & STCU_MBSSW_MBSSW63_MASK)

#define STCU_MBSSW_MBSSW64_MASK                  (0x1U)
#define STCU_MBSSW_MBSSW64_SHIFT                 (0U)
#define STCU_MBSSW_MBSSW64_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW64(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW64_SHIFT)) & STCU_MBSSW_MBSSW64_MASK)

#define STCU_MBSSW_MBSSW65_MASK                  (0x2U)
#define STCU_MBSSW_MBSSW65_SHIFT                 (1U)
#define STCU_MBSSW_MBSSW65_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW65(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW65_SHIFT)) & STCU_MBSSW_MBSSW65_MASK)

#define STCU_MBSSW_MBSSW66_MASK                  (0x4U)
#define STCU_MBSSW_MBSSW66_SHIFT                 (2U)
#define STCU_MBSSW_MBSSW66_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW66(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW66_SHIFT)) & STCU_MBSSW_MBSSW66_MASK)

#define STCU_MBSSW_MBSSW67_MASK                  (0x8U)
#define STCU_MBSSW_MBSSW67_SHIFT                 (3U)
#define STCU_MBSSW_MBSSW67_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW67(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW67_SHIFT)) & STCU_MBSSW_MBSSW67_MASK)

#define STCU_MBSSW_MBSSW68_MASK                  (0x10U)
#define STCU_MBSSW_MBSSW68_SHIFT                 (4U)
#define STCU_MBSSW_MBSSW68_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW68(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW68_SHIFT)) & STCU_MBSSW_MBSSW68_MASK)

#define STCU_MBSSW_MBSSW69_MASK                  (0x20U)
#define STCU_MBSSW_MBSSW69_SHIFT                 (5U)
#define STCU_MBSSW_MBSSW69_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW69(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW69_SHIFT)) & STCU_MBSSW_MBSSW69_MASK)

#define STCU_MBSSW_MBSSW70_MASK                  (0x40U)
#define STCU_MBSSW_MBSSW70_SHIFT                 (6U)
#define STCU_MBSSW_MBSSW70_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW70(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW70_SHIFT)) & STCU_MBSSW_MBSSW70_MASK)

#define STCU_MBSSW_MBSSW71_MASK                  (0x80U)
#define STCU_MBSSW_MBSSW71_SHIFT                 (7U)
#define STCU_MBSSW_MBSSW71_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW71(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW71_SHIFT)) & STCU_MBSSW_MBSSW71_MASK)

#define STCU_MBSSW_MBSSW72_MASK                  (0x100U)
#define STCU_MBSSW_MBSSW72_SHIFT                 (8U)
#define STCU_MBSSW_MBSSW72_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW72(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW72_SHIFT)) & STCU_MBSSW_MBSSW72_MASK)

#define STCU_MBSSW_MBSSW73_MASK                  (0x200U)
#define STCU_MBSSW_MBSSW73_SHIFT                 (9U)
#define STCU_MBSSW_MBSSW73_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW73(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW73_SHIFT)) & STCU_MBSSW_MBSSW73_MASK)

#define STCU_MBSSW_MBSSW74_MASK                  (0x400U)
#define STCU_MBSSW_MBSSW74_SHIFT                 (10U)
#define STCU_MBSSW_MBSSW74_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW74(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW74_SHIFT)) & STCU_MBSSW_MBSSW74_MASK)

#define STCU_MBSSW_MBSSW75_MASK                  (0x800U)
#define STCU_MBSSW_MBSSW75_SHIFT                 (11U)
#define STCU_MBSSW_MBSSW75_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW75(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW75_SHIFT)) & STCU_MBSSW_MBSSW75_MASK)

#define STCU_MBSSW_MBSSW76_MASK                  (0x1000U)
#define STCU_MBSSW_MBSSW76_SHIFT                 (12U)
#define STCU_MBSSW_MBSSW76_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW76(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW76_SHIFT)) & STCU_MBSSW_MBSSW76_MASK)

#define STCU_MBSSW_MBSSW77_MASK                  (0x2000U)
#define STCU_MBSSW_MBSSW77_SHIFT                 (13U)
#define STCU_MBSSW_MBSSW77_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW77(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW77_SHIFT)) & STCU_MBSSW_MBSSW77_MASK)

#define STCU_MBSSW_MBSSW78_MASK                  (0x4000U)
#define STCU_MBSSW_MBSSW78_SHIFT                 (14U)
#define STCU_MBSSW_MBSSW78_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW78(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW78_SHIFT)) & STCU_MBSSW_MBSSW78_MASK)

#define STCU_MBSSW_MBSSW79_MASK                  (0x8000U)
#define STCU_MBSSW_MBSSW79_SHIFT                 (15U)
#define STCU_MBSSW_MBSSW79_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW79(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW79_SHIFT)) & STCU_MBSSW_MBSSW79_MASK)

#define STCU_MBSSW_MBSSW80_MASK                  (0x10000U)
#define STCU_MBSSW_MBSSW80_SHIFT                 (16U)
#define STCU_MBSSW_MBSSW80_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW80(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW80_SHIFT)) & STCU_MBSSW_MBSSW80_MASK)

