zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBSSW_MBSSW81_MASK                  (0x20000U)
#define STCU_MBSSW_MBSSW81_SHIFT                 (17U)
#define STCU_MBSSW_MBSSW81_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW81(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW81_SHIFT)) & STCU_MBSSW_MBSSW81_MASK)

#define STCU_MBSSW_MBSSW82_MASK                  (0x40000U)
#define STCU_MBSSW_MBSSW82_SHIFT                 (18U)
#define STCU_MBSSW_MBSSW82_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW82(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW82_SHIFT)) & STCU_MBSSW_MBSSW82_MASK)

#define STCU_MBSSW_MBSSW83_MASK                  (0x80000U)
#define STCU_MBSSW_MBSSW83_SHIFT                 (19U)
#define STCU_MBSSW_MBSSW83_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW83(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW83_SHIFT)) & STCU_MBSSW_MBSSW83_MASK)

#define STCU_MBSSW_MBSSW84_MASK                  (0x100000U)
#define STCU_MBSSW_MBSSW84_SHIFT                 (20U)
#define STCU_MBSSW_MBSSW84_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW84(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW84_SHIFT)) & STCU_MBSSW_MBSSW84_MASK)

#define STCU_MBSSW_MBSSW85_MASK                  (0x200000U)
#define STCU_MBSSW_MBSSW85_SHIFT                 (21U)
#define STCU_MBSSW_MBSSW85_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW85(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW85_SHIFT)) & STCU_MBSSW_MBSSW85_MASK)

#define STCU_MBSSW_MBSSW86_MASK                  (0x400000U)
#define STCU_MBSSW_MBSSW86_SHIFT                 (22U)
#define STCU_MBSSW_MBSSW86_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW86(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW86_SHIFT)) & STCU_MBSSW_MBSSW86_MASK)

#define STCU_MBSSW_MBSSW87_MASK                  (0x800000U)
#define STCU_MBSSW_MBSSW87_SHIFT                 (23U)
#define STCU_MBSSW_MBSSW87_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW87(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW87_SHIFT)) & STCU_MBSSW_MBSSW87_MASK)

#define STCU_MBSSW_MBSSW88_MASK                  (0x1000000U)
#define STCU_MBSSW_MBSSW88_SHIFT                 (24U)
#define STCU_MBSSW_MBSSW88_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW88(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW88_SHIFT)) & STCU_MBSSW_MBSSW88_MASK)

#define STCU_MBSSW_MBSSW89_MASK                  (0x2000000U)
#define STCU_MBSSW_MBSSW89_SHIFT                 (25U)
#define STCU_MBSSW_MBSSW89_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW89(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW89_SHIFT)) & STCU_MBSSW_MBSSW89_MASK)

#define STCU_MBSSW_MBSSW90_MASK                  (0x4000000U)
#define STCU_MBSSW_MBSSW90_SHIFT                 (26U)
#define STCU_MBSSW_MBSSW90_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW90(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW90_SHIFT)) & STCU_MBSSW_MBSSW90_MASK)

#define STCU_MBSSW_MBSSW91_MASK                  (0x8000000U)
#define STCU_MBSSW_MBSSW91_SHIFT                 (27U)
#define STCU_MBSSW_MBSSW91_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW91(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW91_SHIFT)) & STCU_MBSSW_MBSSW91_MASK)

#define STCU_MBSSW_MBSSW92_MASK                  (0x10000000U)
#define STCU_MBSSW_MBSSW92_SHIFT                 (28U)
#define STCU_MBSSW_MBSSW92_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW92(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW92_SHIFT)) & STCU_MBSSW_MBSSW92_MASK)

#define STCU_MBSSW_MBSSW93_MASK                  (0x20000000U)
#define STCU_MBSSW_MBSSW93_SHIFT                 (29U)
#define STCU_MBSSW_MBSSW93_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW93(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW93_SHIFT)) & STCU_MBSSW_MBSSW93_MASK)

#define STCU_MBSSW_MBSSW94_MASK                  (0x40000000U)
#define STCU_MBSSW_MBSSW94_SHIFT                 (30U)
#define STCU_MBSSW_MBSSW94_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW94(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW94_SHIFT)) & STCU_MBSSW_MBSSW94_MASK)

#define STCU_MBSSW_MBSSW95_MASK                  (0x80000000U)
#define STCU_MBSSW_MBSSW95_SHIFT                 (31U)
#define STCU_MBSSW_MBSSW95_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW95(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW95_SHIFT)) & STCU_MBSSW_MBSSW95_MASK)

#define STCU_MBSSW_MBSSW96_MASK                  (0x1U)
#define STCU_MBSSW_MBSSW96_SHIFT                 (0U)
#define STCU_MBSSW_MBSSW96_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW96(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW96_SHIFT)) & STCU_MBSSW_MBSSW96_MASK)

#define STCU_MBSSW_MBSSW97_MASK                  (0x2U)
#define STCU_MBSSW_MBSSW97_SHIFT                 (1U)
#define STCU_MBSSW_MBSSW97_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW97(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW97_SHIFT)) & STCU_MBSSW_MBSSW97_MASK)

#define STCU_MBSSW_MBSSW98_MASK                  (0x4U)
#define STCU_MBSSW_MBSSW98_SHIFT                 (2U)
#define STCU_MBSSW_MBSSW98_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW98(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW98_SHIFT)) & STCU_MBSSW_MBSSW98_MASK)

#define STCU_MBSSW_MBSSW99_MASK                  (0x8U)
#define STCU_MBSSW_MBSSW99_SHIFT                 (3U)
#define STCU_MBSSW_MBSSW99_WIDTH                 (1U)
#define STCU_MBSSW_MBSSW99(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW99_SHIFT)) & STCU_MBSSW_MBSSW99_MASK)

#define STCU_MBSSW_MBSSW100_MASK                 (0x10U)
#define STCU_MBSSW_MBSSW100_SHIFT                (4U)
#define STCU_MBSSW_MBSSW100_WIDTH                (1U)
#define STCU_MBSSW_MBSSW100(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW100_SHIFT)) & STCU_MBSSW_MBSSW100_MASK)

#define STCU_MBSSW_MBSSW101_MASK                 (0x20U)
#define STCU_MBSSW_MBSSW101_SHIFT                (5U)
#define STCU_MBSSW_MBSSW101_WIDTH                (1U)
#define STCU_MBSSW_MBSSW101(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW101_SHIFT)) & STCU_MBSSW_MBSSW101_MASK)

#define STCU_MBSSW_MBSSW102_MASK                 (0x40U)
#define STCU_MBSSW_MBSSW102_SHIFT                (6U)
#define STCU_MBSSW_MBSSW102_WIDTH                (1U)
#define STCU_MBSSW_MBSSW102(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW102_SHIFT)) & STCU_MBSSW_MBSSW102_MASK)

#define STCU_MBSSW_MBSSW103_MASK                 (0x80U)
#define STCU_MBSSW_MBSSW103_SHIFT                (7U)
#define STCU_MBSSW_MBSSW103_WIDTH                (1U)
#define STCU_MBSSW_MBSSW103(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW103_SHIFT)) & STCU_MBSSW_MBSSW103_MASK)

#define STCU_MBSSW_MBSSW104_MASK                 (0x100U)
#define STCU_MBSSW_MBSSW104_SHIFT                (8U)
#define STCU_MBSSW_MBSSW104_WIDTH                (1U)
#define STCU_MBSSW_MBSSW104(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW104_SHIFT)) & STCU_MBSSW_MBSSW104_MASK)

#define STCU_MBSSW_MBSSW105_MASK                 (0x200U)
#define STCU_MBSSW_MBSSW105_SHIFT                (9U)
#define STCU_MBSSW_MBSSW105_WIDTH                (1U)
#define STCU_MBSSW_MBSSW105(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW105_SHIFT)) & STCU_MBSSW_MBSSW105_MASK)

