zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBSSW_MBSSW106_MASK                 (0x400U)
#define STCU_MBSSW_MBSSW106_SHIFT                (10U)
#define STCU_MBSSW_MBSSW106_WIDTH                (1U)
#define STCU_MBSSW_MBSSW106(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW106_SHIFT)) & STCU_MBSSW_MBSSW106_MASK)

#define STCU_MBSSW_MBSSW107_MASK                 (0x800U)
#define STCU_MBSSW_MBSSW107_SHIFT                (11U)
#define STCU_MBSSW_MBSSW107_WIDTH                (1U)
#define STCU_MBSSW_MBSSW107(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW107_SHIFT)) & STCU_MBSSW_MBSSW107_MASK)

#define STCU_MBSSW_MBSSW108_MASK                 (0x1000U)
#define STCU_MBSSW_MBSSW108_SHIFT                (12U)
#define STCU_MBSSW_MBSSW108_WIDTH                (1U)
#define STCU_MBSSW_MBSSW108(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW108_SHIFT)) & STCU_MBSSW_MBSSW108_MASK)

#define STCU_MBSSW_MBSSW109_MASK                 (0x2000U)
#define STCU_MBSSW_MBSSW109_SHIFT                (13U)
#define STCU_MBSSW_MBSSW109_WIDTH                (1U)
#define STCU_MBSSW_MBSSW109(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW109_SHIFT)) & STCU_MBSSW_MBSSW109_MASK)

#define STCU_MBSSW_MBSSW110_MASK                 (0x4000U)
#define STCU_MBSSW_MBSSW110_SHIFT                (14U)
#define STCU_MBSSW_MBSSW110_WIDTH                (1U)
#define STCU_MBSSW_MBSSW110(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW110_SHIFT)) & STCU_MBSSW_MBSSW110_MASK)

#define STCU_MBSSW_MBSSW111_MASK                 (0x8000U)
#define STCU_MBSSW_MBSSW111_SHIFT                (15U)
#define STCU_MBSSW_MBSSW111_WIDTH                (1U)
#define STCU_MBSSW_MBSSW111(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW111_SHIFT)) & STCU_MBSSW_MBSSW111_MASK)

#define STCU_MBSSW_MBSSW112_MASK                 (0x10000U)
#define STCU_MBSSW_MBSSW112_SHIFT                (16U)
#define STCU_MBSSW_MBSSW112_WIDTH                (1U)
#define STCU_MBSSW_MBSSW112(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW112_SHIFT)) & STCU_MBSSW_MBSSW112_MASK)

#define STCU_MBSSW_MBSSW113_MASK                 (0x20000U)
#define STCU_MBSSW_MBSSW113_SHIFT                (17U)
#define STCU_MBSSW_MBSSW113_WIDTH                (1U)
#define STCU_MBSSW_MBSSW113(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW113_SHIFT)) & STCU_MBSSW_MBSSW113_MASK)

#define STCU_MBSSW_MBSSW114_MASK                 (0x40000U)
#define STCU_MBSSW_MBSSW114_SHIFT                (18U)
#define STCU_MBSSW_MBSSW114_WIDTH                (1U)
#define STCU_MBSSW_MBSSW114(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW114_SHIFT)) & STCU_MBSSW_MBSSW114_MASK)

#define STCU_MBSSW_MBSSW115_MASK                 (0x80000U)
#define STCU_MBSSW_MBSSW115_SHIFT                (19U)
#define STCU_MBSSW_MBSSW115_WIDTH                (1U)
#define STCU_MBSSW_MBSSW115(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW115_SHIFT)) & STCU_MBSSW_MBSSW115_MASK)

#define STCU_MBSSW_MBSSW116_MASK                 (0x100000U)
#define STCU_MBSSW_MBSSW116_SHIFT                (20U)
#define STCU_MBSSW_MBSSW116_WIDTH                (1U)
#define STCU_MBSSW_MBSSW116(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW116_SHIFT)) & STCU_MBSSW_MBSSW116_MASK)

#define STCU_MBSSW_MBSSW117_MASK                 (0x200000U)
#define STCU_MBSSW_MBSSW117_SHIFT                (21U)
#define STCU_MBSSW_MBSSW117_WIDTH                (1U)
#define STCU_MBSSW_MBSSW117(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW117_SHIFT)) & STCU_MBSSW_MBSSW117_MASK)

#define STCU_MBSSW_MBSSW118_MASK                 (0x400000U)
#define STCU_MBSSW_MBSSW118_SHIFT                (22U)
#define STCU_MBSSW_MBSSW118_WIDTH                (1U)
#define STCU_MBSSW_MBSSW118(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW118_SHIFT)) & STCU_MBSSW_MBSSW118_MASK)

#define STCU_MBSSW_MBSSW119_MASK                 (0x800000U)
#define STCU_MBSSW_MBSSW119_SHIFT                (23U)
#define STCU_MBSSW_MBSSW119_WIDTH                (1U)
#define STCU_MBSSW_MBSSW119(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW119_SHIFT)) & STCU_MBSSW_MBSSW119_MASK)

#define STCU_MBSSW_MBSSW120_MASK                 (0x1000000U)
#define STCU_MBSSW_MBSSW120_SHIFT                (24U)
#define STCU_MBSSW_MBSSW120_WIDTH                (1U)
#define STCU_MBSSW_MBSSW120(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW120_SHIFT)) & STCU_MBSSW_MBSSW120_MASK)

#define STCU_MBSSW_MBSSW121_MASK                 (0x2000000U)
#define STCU_MBSSW_MBSSW121_SHIFT                (25U)
#define STCU_MBSSW_MBSSW121_WIDTH                (1U)
#define STCU_MBSSW_MBSSW121(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW121_SHIFT)) & STCU_MBSSW_MBSSW121_MASK)

#define STCU_MBSSW_MBSSW122_MASK                 (0x4000000U)
#define STCU_MBSSW_MBSSW122_SHIFT                (26U)
#define STCU_MBSSW_MBSSW122_WIDTH                (1U)
#define STCU_MBSSW_MBSSW122(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW122_SHIFT)) & STCU_MBSSW_MBSSW122_MASK)

#define STCU_MBSSW_MBSSW123_MASK                 (0x8000000U)
#define STCU_MBSSW_MBSSW123_SHIFT                (27U)
#define STCU_MBSSW_MBSSW123_WIDTH                (1U)
#define STCU_MBSSW_MBSSW123(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW123_SHIFT)) & STCU_MBSSW_MBSSW123_MASK)

#define STCU_MBSSW_MBSSW124_MASK                 (0x10000000U)
#define STCU_MBSSW_MBSSW124_SHIFT                (28U)
#define STCU_MBSSW_MBSSW124_WIDTH                (1U)
#define STCU_MBSSW_MBSSW124(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW124_SHIFT)) & STCU_MBSSW_MBSSW124_MASK)

#define STCU_MBSSW_MBSSW125_MASK                 (0x20000000U)
#define STCU_MBSSW_MBSSW125_SHIFT                (29U)
#define STCU_MBSSW_MBSSW125_WIDTH                (1U)
#define STCU_MBSSW_MBSSW125(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW125_SHIFT)) & STCU_MBSSW_MBSSW125_MASK)

#define STCU_MBSSW_MBSSW126_MASK                 (0x40000000U)
#define STCU_MBSSW_MBSSW126_SHIFT                (30U)
#define STCU_MBSSW_MBSSW126_WIDTH                (1U)
#define STCU_MBSSW_MBSSW126(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW126_SHIFT)) & STCU_MBSSW_MBSSW126_MASK)

