zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBSSW_MBSSW127_MASK                 (0x80000000U)
#define STCU_MBSSW_MBSSW127_SHIFT                (31U)
#define STCU_MBSSW_MBSSW127_WIDTH                (1U)
#define STCU_MBSSW_MBSSW127(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW127_SHIFT)) & STCU_MBSSW_MBSSW127_MASK)

#define STCU_MBSSW_MBSSW128_MASK                 (0x1U)
#define STCU_MBSSW_MBSSW128_SHIFT                (0U)
#define STCU_MBSSW_MBSSW128_WIDTH                (1U)
#define STCU_MBSSW_MBSSW128(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW128_SHIFT)) & STCU_MBSSW_MBSSW128_MASK)

#define STCU_MBSSW_MBSSW129_MASK                 (0x2U)
#define STCU_MBSSW_MBSSW129_SHIFT                (1U)
#define STCU_MBSSW_MBSSW129_WIDTH                (1U)
#define STCU_MBSSW_MBSSW129(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW129_SHIFT)) & STCU_MBSSW_MBSSW129_MASK)

#define STCU_MBSSW_MBSSW130_MASK                 (0x4U)
#define STCU_MBSSW_MBSSW130_SHIFT                (2U)
#define STCU_MBSSW_MBSSW130_WIDTH                (1U)
#define STCU_MBSSW_MBSSW130(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW130_SHIFT)) & STCU_MBSSW_MBSSW130_MASK)

#define STCU_MBSSW_MBSSW131_MASK                 (0x8U)
#define STCU_MBSSW_MBSSW131_SHIFT                (3U)
#define STCU_MBSSW_MBSSW131_WIDTH                (1U)
#define STCU_MBSSW_MBSSW131(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW131_SHIFT)) & STCU_MBSSW_MBSSW131_MASK)

#define STCU_MBSSW_MBSSW132_MASK                 (0x10U)
#define STCU_MBSSW_MBSSW132_SHIFT                (4U)
#define STCU_MBSSW_MBSSW132_WIDTH                (1U)
#define STCU_MBSSW_MBSSW132(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW132_SHIFT)) & STCU_MBSSW_MBSSW132_MASK)

#define STCU_MBSSW_MBSSW133_MASK                 (0x20U)
#define STCU_MBSSW_MBSSW133_SHIFT                (5U)
#define STCU_MBSSW_MBSSW133_WIDTH                (1U)
#define STCU_MBSSW_MBSSW133(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW133_SHIFT)) & STCU_MBSSW_MBSSW133_MASK)

#define STCU_MBSSW_MBSSW134_MASK                 (0x40U)
#define STCU_MBSSW_MBSSW134_SHIFT                (6U)
#define STCU_MBSSW_MBSSW134_WIDTH                (1U)
#define STCU_MBSSW_MBSSW134(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW134_SHIFT)) & STCU_MBSSW_MBSSW134_MASK)

#define STCU_MBSSW_MBSSW135_MASK                 (0x80U)
#define STCU_MBSSW_MBSSW135_SHIFT                (7U)
#define STCU_MBSSW_MBSSW135_WIDTH                (1U)
#define STCU_MBSSW_MBSSW135(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW135_SHIFT)) & STCU_MBSSW_MBSSW135_MASK)

#define STCU_MBSSW_MBSSW136_MASK                 (0x100U)
#define STCU_MBSSW_MBSSW136_SHIFT                (8U)
#define STCU_MBSSW_MBSSW136_WIDTH                (1U)
#define STCU_MBSSW_MBSSW136(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW136_SHIFT)) & STCU_MBSSW_MBSSW136_MASK)

#define STCU_MBSSW_MBSSW137_MASK                 (0x200U)
#define STCU_MBSSW_MBSSW137_SHIFT                (9U)
#define STCU_MBSSW_MBSSW137_WIDTH                (1U)
#define STCU_MBSSW_MBSSW137(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW137_SHIFT)) & STCU_MBSSW_MBSSW137_MASK)

#define STCU_MBSSW_MBSSW138_MASK                 (0x400U)
#define STCU_MBSSW_MBSSW138_SHIFT                (10U)
#define STCU_MBSSW_MBSSW138_WIDTH                (1U)
#define STCU_MBSSW_MBSSW138(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW138_SHIFT)) & STCU_MBSSW_MBSSW138_MASK)

#define STCU_MBSSW_MBSSW139_MASK                 (0x800U)
#define STCU_MBSSW_MBSSW139_SHIFT                (11U)
#define STCU_MBSSW_MBSSW139_WIDTH                (1U)
#define STCU_MBSSW_MBSSW139(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW139_SHIFT)) & STCU_MBSSW_MBSSW139_MASK)

#define STCU_MBSSW_MBSSW140_MASK                 (0x1000U)
#define STCU_MBSSW_MBSSW140_SHIFT                (12U)
#define STCU_MBSSW_MBSSW140_WIDTH                (1U)
#define STCU_MBSSW_MBSSW140(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW140_SHIFT)) & STCU_MBSSW_MBSSW140_MASK)

#define STCU_MBSSW_MBSSW141_MASK                 (0x2000U)
#define STCU_MBSSW_MBSSW141_SHIFT                (13U)
#define STCU_MBSSW_MBSSW141_WIDTH                (1U)
#define STCU_MBSSW_MBSSW141(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW141_SHIFT)) & STCU_MBSSW_MBSSW141_MASK)

#define STCU_MBSSW_MBSSW142_MASK                 (0x4000U)
#define STCU_MBSSW_MBSSW142_SHIFT                (14U)
#define STCU_MBSSW_MBSSW142_WIDTH                (1U)
#define STCU_MBSSW_MBSSW142(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW142_SHIFT)) & STCU_MBSSW_MBSSW142_MASK)

#define STCU_MBSSW_MBSSW143_MASK                 (0x8000U)
#define STCU_MBSSW_MBSSW143_SHIFT                (15U)
#define STCU_MBSSW_MBSSW143_WIDTH                (1U)
#define STCU_MBSSW_MBSSW143(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW143_SHIFT)) & STCU_MBSSW_MBSSW143_MASK)

#define STCU_MBSSW_MBSSW144_MASK                 (0x10000U)
#define STCU_MBSSW_MBSSW144_SHIFT                (16U)
#define STCU_MBSSW_MBSSW144_WIDTH                (1U)
#define STCU_MBSSW_MBSSW144(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW144_SHIFT)) & STCU_MBSSW_MBSSW144_MASK)

#define STCU_MBSSW_MBSSW145_MASK                 (0x20000U)
#define STCU_MBSSW_MBSSW145_SHIFT                (17U)
#define STCU_MBSSW_MBSSW145_WIDTH                (1U)
#define STCU_MBSSW_MBSSW145(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW145_SHIFT)) & STCU_MBSSW_MBSSW145_MASK)

#define STCU_MBSSW_MBSSW146_MASK                 (0x40000U)
#define STCU_MBSSW_MBSSW146_SHIFT                (18U)
#define STCU_MBSSW_MBSSW146_WIDTH                (1U)
#define STCU_MBSSW_MBSSW146(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW146_SHIFT)) & STCU_MBSSW_MBSSW146_MASK)

#define STCU_MBSSW_MBSSW147_MASK                 (0x80000U)
#define STCU_MBSSW_MBSSW147_SHIFT                (19U)
#define STCU_MBSSW_MBSSW147_WIDTH                (1U)
#define STCU_MBSSW_MBSSW147(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW147_SHIFT)) & STCU_MBSSW_MBSSW147_MASK)

#define STCU_MBSSW_MBSSW148_MASK                 (0x100000U)
#define STCU_MBSSW_MBSSW148_SHIFT                (20U)
#define STCU_MBSSW_MBSSW148_WIDTH                (1U)
#define STCU_MBSSW_MBSSW148(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW148_SHIFT)) & STCU_MBSSW_MBSSW148_MASK)

