zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBSSW_MBSSW149_MASK                 (0x200000U)
#define STCU_MBSSW_MBSSW149_SHIFT                (21U)
#define STCU_MBSSW_MBSSW149_WIDTH                (1U)
#define STCU_MBSSW_MBSSW149(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW149_SHIFT)) & STCU_MBSSW_MBSSW149_MASK)

#define STCU_MBSSW_MBSSW150_MASK                 (0x400000U)
#define STCU_MBSSW_MBSSW150_SHIFT                (22U)
#define STCU_MBSSW_MBSSW150_WIDTH                (1U)
#define STCU_MBSSW_MBSSW150(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW150_SHIFT)) & STCU_MBSSW_MBSSW150_MASK)

#define STCU_MBSSW_MBSSW151_MASK                 (0x800000U)
#define STCU_MBSSW_MBSSW151_SHIFT                (23U)
#define STCU_MBSSW_MBSSW151_WIDTH                (1U)
#define STCU_MBSSW_MBSSW151(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW151_SHIFT)) & STCU_MBSSW_MBSSW151_MASK)

#define STCU_MBSSW_MBSSW152_MASK                 (0x1000000U)
#define STCU_MBSSW_MBSSW152_SHIFT                (24U)
#define STCU_MBSSW_MBSSW152_WIDTH                (1U)
#define STCU_MBSSW_MBSSW152(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW152_SHIFT)) & STCU_MBSSW_MBSSW152_MASK)

#define STCU_MBSSW_MBSSW153_MASK                 (0x2000000U)
#define STCU_MBSSW_MBSSW153_SHIFT                (25U)
#define STCU_MBSSW_MBSSW153_WIDTH                (1U)
#define STCU_MBSSW_MBSSW153(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW153_SHIFT)) & STCU_MBSSW_MBSSW153_MASK)

#define STCU_MBSSW_MBSSW154_MASK                 (0x4000000U)
#define STCU_MBSSW_MBSSW154_SHIFT                (26U)
#define STCU_MBSSW_MBSSW154_WIDTH                (1U)
#define STCU_MBSSW_MBSSW154(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW154_SHIFT)) & STCU_MBSSW_MBSSW154_MASK)

#define STCU_MBSSW_MBSSW155_MASK                 (0x8000000U)
#define STCU_MBSSW_MBSSW155_SHIFT                (27U)
#define STCU_MBSSW_MBSSW155_WIDTH                (1U)
#define STCU_MBSSW_MBSSW155(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW155_SHIFT)) & STCU_MBSSW_MBSSW155_MASK)

#define STCU_MBSSW_MBSSW156_MASK                 (0x10000000U)
#define STCU_MBSSW_MBSSW156_SHIFT                (28U)
#define STCU_MBSSW_MBSSW156_WIDTH                (1U)
#define STCU_MBSSW_MBSSW156(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW156_SHIFT)) & STCU_MBSSW_MBSSW156_MASK)

#define STCU_MBSSW_MBSSW157_MASK                 (0x20000000U)
#define STCU_MBSSW_MBSSW157_SHIFT                (29U)
#define STCU_MBSSW_MBSSW157_WIDTH                (1U)
#define STCU_MBSSW_MBSSW157(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW157_SHIFT)) & STCU_MBSSW_MBSSW157_MASK)

#define STCU_MBSSW_MBSSW158_MASK                 (0x40000000U)
#define STCU_MBSSW_MBSSW158_SHIFT                (30U)
#define STCU_MBSSW_MBSSW158_WIDTH                (1U)
#define STCU_MBSSW_MBSSW158(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW158_SHIFT)) & STCU_MBSSW_MBSSW158_MASK)

#define STCU_MBSSW_MBSSW159_MASK                 (0x80000000U)
#define STCU_MBSSW_MBSSW159_SHIFT                (31U)
#define STCU_MBSSW_MBSSW159_WIDTH                (1U)
#define STCU_MBSSW_MBSSW159(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW159_SHIFT)) & STCU_MBSSW_MBSSW159_MASK)

#define STCU_MBSSW_MBSSW160_MASK                 (0x1U)
#define STCU_MBSSW_MBSSW160_SHIFT                (0U)
#define STCU_MBSSW_MBSSW160_WIDTH                (1U)
#define STCU_MBSSW_MBSSW160(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW160_SHIFT)) & STCU_MBSSW_MBSSW160_MASK)

#define STCU_MBSSW_MBSSW161_MASK                 (0x2U)
#define STCU_MBSSW_MBSSW161_SHIFT                (1U)
#define STCU_MBSSW_MBSSW161_WIDTH                (1U)
#define STCU_MBSSW_MBSSW161(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW161_SHIFT)) & STCU_MBSSW_MBSSW161_MASK)

#define STCU_MBSSW_MBSSW162_MASK                 (0x4U)
#define STCU_MBSSW_MBSSW162_SHIFT                (2U)
#define STCU_MBSSW_MBSSW162_WIDTH                (1U)
#define STCU_MBSSW_MBSSW162(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW162_SHIFT)) & STCU_MBSSW_MBSSW162_MASK)

#define STCU_MBSSW_MBSSW163_MASK                 (0x8U)
#define STCU_MBSSW_MBSSW163_SHIFT                (3U)
#define STCU_MBSSW_MBSSW163_WIDTH                (1U)
#define STCU_MBSSW_MBSSW163(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW163_SHIFT)) & STCU_MBSSW_MBSSW163_MASK)

#define STCU_MBSSW_MBSSW164_MASK                 (0x10U)
#define STCU_MBSSW_MBSSW164_SHIFT                (4U)
#define STCU_MBSSW_MBSSW164_WIDTH                (1U)
#define STCU_MBSSW_MBSSW164(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW164_SHIFT)) & STCU_MBSSW_MBSSW164_MASK)

#define STCU_MBSSW_MBSSW165_MASK                 (0x20U)
#define STCU_MBSSW_MBSSW165_SHIFT                (5U)
#define STCU_MBSSW_MBSSW165_WIDTH                (1U)
#define STCU_MBSSW_MBSSW165(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW165_SHIFT)) & STCU_MBSSW_MBSSW165_MASK)

#define STCU_MBSSW_MBSSW166_MASK                 (0x40U)
#define STCU_MBSSW_MBSSW166_SHIFT                (6U)
#define STCU_MBSSW_MBSSW166_WIDTH                (1U)
#define STCU_MBSSW_MBSSW166(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW166_SHIFT)) & STCU_MBSSW_MBSSW166_MASK)

#define STCU_MBSSW_MBSSW167_MASK                 (0x80U)
#define STCU_MBSSW_MBSSW167_SHIFT                (7U)
#define STCU_MBSSW_MBSSW167_WIDTH                (1U)
#define STCU_MBSSW_MBSSW167(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW167_SHIFT)) & STCU_MBSSW_MBSSW167_MASK)

#define STCU_MBSSW_MBSSW168_MASK                 (0x100U)
#define STCU_MBSSW_MBSSW168_SHIFT                (8U)
#define STCU_MBSSW_MBSSW168_WIDTH                (1U)
#define STCU_MBSSW_MBSSW168(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW168_SHIFT)) & STCU_MBSSW_MBSSW168_MASK)

