zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBSSW_MBSSW169_MASK                 (0x200U)
#define STCU_MBSSW_MBSSW169_SHIFT                (9U)
#define STCU_MBSSW_MBSSW169_WIDTH                (1U)
#define STCU_MBSSW_MBSSW169(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW169_SHIFT)) & STCU_MBSSW_MBSSW169_MASK)

#define STCU_MBSSW_MBSSW170_MASK                 (0x400U)
#define STCU_MBSSW_MBSSW170_SHIFT                (10U)
#define STCU_MBSSW_MBSSW170_WIDTH                (1U)
#define STCU_MBSSW_MBSSW170(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW170_SHIFT)) & STCU_MBSSW_MBSSW170_MASK)

#define STCU_MBSSW_MBSSW171_MASK                 (0x800U)
#define STCU_MBSSW_MBSSW171_SHIFT                (11U)
#define STCU_MBSSW_MBSSW171_WIDTH                (1U)
#define STCU_MBSSW_MBSSW171(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW171_SHIFT)) & STCU_MBSSW_MBSSW171_MASK)

#define STCU_MBSSW_MBSSW172_MASK                 (0x1000U)
#define STCU_MBSSW_MBSSW172_SHIFT                (12U)
#define STCU_MBSSW_MBSSW172_WIDTH                (1U)
#define STCU_MBSSW_MBSSW172(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW172_SHIFT)) & STCU_MBSSW_MBSSW172_MASK)

#define STCU_MBSSW_MBSSW173_MASK                 (0x2000U)
#define STCU_MBSSW_MBSSW173_SHIFT                (13U)
#define STCU_MBSSW_MBSSW173_WIDTH                (1U)
#define STCU_MBSSW_MBSSW173(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW173_SHIFT)) & STCU_MBSSW_MBSSW173_MASK)

#define STCU_MBSSW_MBSSW174_MASK                 (0x4000U)
#define STCU_MBSSW_MBSSW174_SHIFT                (14U)
#define STCU_MBSSW_MBSSW174_WIDTH                (1U)
#define STCU_MBSSW_MBSSW174(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW174_SHIFT)) & STCU_MBSSW_MBSSW174_MASK)

#define STCU_MBSSW_MBSSW175_MASK                 (0x8000U)
#define STCU_MBSSW_MBSSW175_SHIFT                (15U)
#define STCU_MBSSW_MBSSW175_WIDTH                (1U)
#define STCU_MBSSW_MBSSW175(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW175_SHIFT)) & STCU_MBSSW_MBSSW175_MASK)

#define STCU_MBSSW_MBSSW176_MASK                 (0x10000U)
#define STCU_MBSSW_MBSSW176_SHIFT                (16U)
#define STCU_MBSSW_MBSSW176_WIDTH                (1U)
#define STCU_MBSSW_MBSSW176(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW176_SHIFT)) & STCU_MBSSW_MBSSW176_MASK)

#define STCU_MBSSW_MBSSW177_MASK                 (0x20000U)
#define STCU_MBSSW_MBSSW177_SHIFT                (17U)
#define STCU_MBSSW_MBSSW177_WIDTH                (1U)
#define STCU_MBSSW_MBSSW177(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW177_SHIFT)) & STCU_MBSSW_MBSSW177_MASK)

#define STCU_MBSSW_MBSSW178_MASK                 (0x40000U)
#define STCU_MBSSW_MBSSW178_SHIFT                (18U)
#define STCU_MBSSW_MBSSW178_WIDTH                (1U)
#define STCU_MBSSW_MBSSW178(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW178_SHIFT)) & STCU_MBSSW_MBSSW178_MASK)

#define STCU_MBSSW_MBSSW179_MASK                 (0x80000U)
#define STCU_MBSSW_MBSSW179_SHIFT                (19U)
#define STCU_MBSSW_MBSSW179_WIDTH                (1U)
#define STCU_MBSSW_MBSSW179(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW179_SHIFT)) & STCU_MBSSW_MBSSW179_MASK)

#define STCU_MBSSW_MBSSW180_MASK                 (0x100000U)
#define STCU_MBSSW_MBSSW180_SHIFT                (20U)
#define STCU_MBSSW_MBSSW180_WIDTH                (1U)
#define STCU_MBSSW_MBSSW180(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW180_SHIFT)) & STCU_MBSSW_MBSSW180_MASK)

#define STCU_MBSSW_MBSSW181_MASK                 (0x200000U)
#define STCU_MBSSW_MBSSW181_SHIFT                (21U)
#define STCU_MBSSW_MBSSW181_WIDTH                (1U)
#define STCU_MBSSW_MBSSW181(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW181_SHIFT)) & STCU_MBSSW_MBSSW181_MASK)

#define STCU_MBSSW_MBSSW182_MASK                 (0x400000U)
#define STCU_MBSSW_MBSSW182_SHIFT                (22U)
#define STCU_MBSSW_MBSSW182_WIDTH                (1U)
#define STCU_MBSSW_MBSSW182(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW182_SHIFT)) & STCU_MBSSW_MBSSW182_MASK)

#define STCU_MBSSW_MBSSW183_MASK                 (0x800000U)
#define STCU_MBSSW_MBSSW183_SHIFT                (23U)
#define STCU_MBSSW_MBSSW183_WIDTH                (1U)
#define STCU_MBSSW_MBSSW183(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW183_SHIFT)) & STCU_MBSSW_MBSSW183_MASK)

#define STCU_MBSSW_MBSSW184_MASK                 (0x1000000U)
#define STCU_MBSSW_MBSSW184_SHIFT                (24U)
#define STCU_MBSSW_MBSSW184_WIDTH                (1U)
#define STCU_MBSSW_MBSSW184(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW184_SHIFT)) & STCU_MBSSW_MBSSW184_MASK)

#define STCU_MBSSW_MBSSW185_MASK                 (0x2000000U)
#define STCU_MBSSW_MBSSW185_SHIFT                (25U)
#define STCU_MBSSW_MBSSW185_WIDTH                (1U)
#define STCU_MBSSW_MBSSW185(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW185_SHIFT)) & STCU_MBSSW_MBSSW185_MASK)

#define STCU_MBSSW_MBSSW186_MASK                 (0x4000000U)
#define STCU_MBSSW_MBSSW186_SHIFT                (26U)
#define STCU_MBSSW_MBSSW186_WIDTH                (1U)
#define STCU_MBSSW_MBSSW186(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW186_SHIFT)) & STCU_MBSSW_MBSSW186_MASK)

#define STCU_MBSSW_MBSSW187_MASK                 (0x8000000U)
#define STCU_MBSSW_MBSSW187_SHIFT                (27U)
#define STCU_MBSSW_MBSSW187_WIDTH                (1U)
#define STCU_MBSSW_MBSSW187(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW187_SHIFT)) & STCU_MBSSW_MBSSW187_MASK)

#define STCU_MBSSW_MBSSW188_MASK                 (0x10000000U)
#define STCU_MBSSW_MBSSW188_SHIFT                (28U)
#define STCU_MBSSW_MBSSW188_WIDTH                (1U)
#define STCU_MBSSW_MBSSW188(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW188_SHIFT)) & STCU_MBSSW_MBSSW188_MASK)

#define STCU_MBSSW_MBSSW189_MASK                 (0x20000000U)
#define STCU_MBSSW_MBSSW189_SHIFT                (29U)
#define STCU_MBSSW_MBSSW189_WIDTH                (1U)
#define STCU_MBSSW_MBSSW189(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW189_SHIFT)) & STCU_MBSSW_MBSSW189_MASK)

#define STCU_MBSSW_MBSSW190_MASK                 (0x40000000U)
#define STCU_MBSSW_MBSSW190_SHIFT                (30U)
#define STCU_MBSSW_MBSSW190_WIDTH                (1U)
#define STCU_MBSSW_MBSSW190(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW190_SHIFT)) & STCU_MBSSW_MBSSW190_MASK)

#define STCU_MBSSW_MBSSW191_MASK                 (0x80000000U)
#define STCU_MBSSW_MBSSW191_SHIFT                (31U)
#define STCU_MBSSW_MBSSW191_WIDTH                (1U)
#define STCU_MBSSW_MBSSW191(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW191_SHIFT)) & STCU_MBSSW_MBSSW191_MASK)

