zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBSSW_MBSSW192_MASK                 (0x1U)
#define STCU_MBSSW_MBSSW192_SHIFT                (0U)
#define STCU_MBSSW_MBSSW192_WIDTH                (1U)
#define STCU_MBSSW_MBSSW192(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW192_SHIFT)) & STCU_MBSSW_MBSSW192_MASK)

#define STCU_MBSSW_MBSSW193_MASK                 (0x2U)
#define STCU_MBSSW_MBSSW193_SHIFT                (1U)
#define STCU_MBSSW_MBSSW193_WIDTH                (1U)
#define STCU_MBSSW_MBSSW193(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW193_SHIFT)) & STCU_MBSSW_MBSSW193_MASK)

#define STCU_MBSSW_MBSSW194_MASK                 (0x4U)
#define STCU_MBSSW_MBSSW194_SHIFT                (2U)
#define STCU_MBSSW_MBSSW194_WIDTH                (1U)
#define STCU_MBSSW_MBSSW194(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW194_SHIFT)) & STCU_MBSSW_MBSSW194_MASK)

#define STCU_MBSSW_MBSSW195_MASK                 (0x8U)
#define STCU_MBSSW_MBSSW195_SHIFT                (3U)
#define STCU_MBSSW_MBSSW195_WIDTH                (1U)
#define STCU_MBSSW_MBSSW195(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW195_SHIFT)) & STCU_MBSSW_MBSSW195_MASK)

#define STCU_MBSSW_MBSSW196_MASK                 (0x10U)
#define STCU_MBSSW_MBSSW196_SHIFT                (4U)
#define STCU_MBSSW_MBSSW196_WIDTH                (1U)
#define STCU_MBSSW_MBSSW196(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW196_SHIFT)) & STCU_MBSSW_MBSSW196_MASK)

#define STCU_MBSSW_MBSSW197_MASK                 (0x20U)
#define STCU_MBSSW_MBSSW197_SHIFT                (5U)
#define STCU_MBSSW_MBSSW197_WIDTH                (1U)
#define STCU_MBSSW_MBSSW197(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW197_SHIFT)) & STCU_MBSSW_MBSSW197_MASK)

#define STCU_MBSSW_MBSSW198_MASK                 (0x40U)
#define STCU_MBSSW_MBSSW198_SHIFT                (6U)
#define STCU_MBSSW_MBSSW198_WIDTH                (1U)
#define STCU_MBSSW_MBSSW198(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW198_SHIFT)) & STCU_MBSSW_MBSSW198_MASK)

#define STCU_MBSSW_MBSSW199_MASK                 (0x80U)
#define STCU_MBSSW_MBSSW199_SHIFT                (7U)
#define STCU_MBSSW_MBSSW199_WIDTH                (1U)
#define STCU_MBSSW_MBSSW199(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW199_SHIFT)) & STCU_MBSSW_MBSSW199_MASK)

#define STCU_MBSSW_MBSSW200_MASK                 (0x100U)
#define STCU_MBSSW_MBSSW200_SHIFT                (8U)
#define STCU_MBSSW_MBSSW200_WIDTH                (1U)
#define STCU_MBSSW_MBSSW200(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW200_SHIFT)) & STCU_MBSSW_MBSSW200_MASK)

#define STCU_MBSSW_MBSSW201_MASK                 (0x200U)
#define STCU_MBSSW_MBSSW201_SHIFT                (9U)
#define STCU_MBSSW_MBSSW201_WIDTH                (1U)
#define STCU_MBSSW_MBSSW201(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW201_SHIFT)) & STCU_MBSSW_MBSSW201_MASK)

#define STCU_MBSSW_MBSSW202_MASK                 (0x400U)
#define STCU_MBSSW_MBSSW202_SHIFT                (10U)
#define STCU_MBSSW_MBSSW202_WIDTH                (1U)
#define STCU_MBSSW_MBSSW202(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW202_SHIFT)) & STCU_MBSSW_MBSSW202_MASK)

#define STCU_MBSSW_MBSSW203_MASK                 (0x800U)
#define STCU_MBSSW_MBSSW203_SHIFT                (11U)
#define STCU_MBSSW_MBSSW203_WIDTH                (1U)
#define STCU_MBSSW_MBSSW203(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW203_SHIFT)) & STCU_MBSSW_MBSSW203_MASK)

#define STCU_MBSSW_MBSSW204_MASK                 (0x1000U)
#define STCU_MBSSW_MBSSW204_SHIFT                (12U)
#define STCU_MBSSW_MBSSW204_WIDTH                (1U)
#define STCU_MBSSW_MBSSW204(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW204_SHIFT)) & STCU_MBSSW_MBSSW204_MASK)

#define STCU_MBSSW_MBSSW205_MASK                 (0x2000U)
#define STCU_MBSSW_MBSSW205_SHIFT                (13U)
#define STCU_MBSSW_MBSSW205_WIDTH                (1U)
#define STCU_MBSSW_MBSSW205(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW205_SHIFT)) & STCU_MBSSW_MBSSW205_MASK)

#define STCU_MBSSW_MBSSW206_MASK                 (0x4000U)
#define STCU_MBSSW_MBSSW206_SHIFT                (14U)
#define STCU_MBSSW_MBSSW206_WIDTH                (1U)
#define STCU_MBSSW_MBSSW206(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW206_SHIFT)) & STCU_MBSSW_MBSSW206_MASK)

#define STCU_MBSSW_MBSSW207_MASK                 (0x8000U)
#define STCU_MBSSW_MBSSW207_SHIFT                (15U)
#define STCU_MBSSW_MBSSW207_WIDTH                (1U)
#define STCU_MBSSW_MBSSW207(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW207_SHIFT)) & STCU_MBSSW_MBSSW207_MASK)

#define STCU_MBSSW_MBSSW208_MASK                 (0x10000U)
#define STCU_MBSSW_MBSSW208_SHIFT                (16U)
#define STCU_MBSSW_MBSSW208_WIDTH                (1U)
#define STCU_MBSSW_MBSSW208(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW208_SHIFT)) & STCU_MBSSW_MBSSW208_MASK)

#define STCU_MBSSW_MBSSW209_MASK                 (0x20000U)
#define STCU_MBSSW_MBSSW209_SHIFT                (17U)
#define STCU_MBSSW_MBSSW209_WIDTH                (1U)
#define STCU_MBSSW_MBSSW209(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW209_SHIFT)) & STCU_MBSSW_MBSSW209_MASK)

#define STCU_MBSSW_MBSSW210_MASK                 (0x40000U)
#define STCU_MBSSW_MBSSW210_SHIFT                (18U)
#define STCU_MBSSW_MBSSW210_WIDTH                (1U)
#define STCU_MBSSW_MBSSW210(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW210_SHIFT)) & STCU_MBSSW_MBSSW210_MASK)

#define STCU_MBSSW_MBSSW211_MASK                 (0x80000U)
#define STCU_MBSSW_MBSSW211_SHIFT                (19U)
#define STCU_MBSSW_MBSSW211_WIDTH                (1U)
#define STCU_MBSSW_MBSSW211(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW211_SHIFT)) & STCU_MBSSW_MBSSW211_MASK)

