zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBSSW_MBSSW212_MASK                 (0x100000U)
#define STCU_MBSSW_MBSSW212_SHIFT                (20U)
#define STCU_MBSSW_MBSSW212_WIDTH                (1U)
#define STCU_MBSSW_MBSSW212(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW212_SHIFT)) & STCU_MBSSW_MBSSW212_MASK)

#define STCU_MBSSW_MBSSW213_MASK                 (0x200000U)
#define STCU_MBSSW_MBSSW213_SHIFT                (21U)
#define STCU_MBSSW_MBSSW213_WIDTH                (1U)
#define STCU_MBSSW_MBSSW213(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW213_SHIFT)) & STCU_MBSSW_MBSSW213_MASK)

#define STCU_MBSSW_MBSSW214_MASK                 (0x400000U)
#define STCU_MBSSW_MBSSW214_SHIFT                (22U)
#define STCU_MBSSW_MBSSW214_WIDTH                (1U)
#define STCU_MBSSW_MBSSW214(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW214_SHIFT)) & STCU_MBSSW_MBSSW214_MASK)

#define STCU_MBSSW_MBSSW215_MASK                 (0x800000U)
#define STCU_MBSSW_MBSSW215_SHIFT                (23U)
#define STCU_MBSSW_MBSSW215_WIDTH                (1U)
#define STCU_MBSSW_MBSSW215(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW215_SHIFT)) & STCU_MBSSW_MBSSW215_MASK)

#define STCU_MBSSW_MBSSW216_MASK                 (0x1000000U)
#define STCU_MBSSW_MBSSW216_SHIFT                (24U)
#define STCU_MBSSW_MBSSW216_WIDTH                (1U)
#define STCU_MBSSW_MBSSW216(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW216_SHIFT)) & STCU_MBSSW_MBSSW216_MASK)

#define STCU_MBSSW_MBSSW217_MASK                 (0x2000000U)
#define STCU_MBSSW_MBSSW217_SHIFT                (25U)
#define STCU_MBSSW_MBSSW217_WIDTH                (1U)
#define STCU_MBSSW_MBSSW217(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW217_SHIFT)) & STCU_MBSSW_MBSSW217_MASK)

#define STCU_MBSSW_MBSSW218_MASK                 (0x4000000U)
#define STCU_MBSSW_MBSSW218_SHIFT                (26U)
#define STCU_MBSSW_MBSSW218_WIDTH                (1U)
#define STCU_MBSSW_MBSSW218(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW218_SHIFT)) & STCU_MBSSW_MBSSW218_MASK)

#define STCU_MBSSW_MBSSW219_MASK                 (0x8000000U)
#define STCU_MBSSW_MBSSW219_SHIFT                (27U)
#define STCU_MBSSW_MBSSW219_WIDTH                (1U)
#define STCU_MBSSW_MBSSW219(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW219_SHIFT)) & STCU_MBSSW_MBSSW219_MASK)

#define STCU_MBSSW_MBSSW220_MASK                 (0x10000000U)
#define STCU_MBSSW_MBSSW220_SHIFT                (28U)
#define STCU_MBSSW_MBSSW220_WIDTH                (1U)
#define STCU_MBSSW_MBSSW220(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW220_SHIFT)) & STCU_MBSSW_MBSSW220_MASK)

#define STCU_MBSSW_MBSSW221_MASK                 (0x20000000U)
#define STCU_MBSSW_MBSSW221_SHIFT                (29U)
#define STCU_MBSSW_MBSSW221_WIDTH                (1U)
#define STCU_MBSSW_MBSSW221(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW221_SHIFT)) & STCU_MBSSW_MBSSW221_MASK)

#define STCU_MBSSW_MBSSW222_MASK                 (0x40000000U)
#define STCU_MBSSW_MBSSW222_SHIFT                (30U)
#define STCU_MBSSW_MBSSW222_WIDTH                (1U)
#define STCU_MBSSW_MBSSW222(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW222_SHIFT)) & STCU_MBSSW_MBSSW222_MASK)

#define STCU_MBSSW_MBSSW223_MASK                 (0x80000000U)
#define STCU_MBSSW_MBSSW223_SHIFT                (31U)
#define STCU_MBSSW_MBSSW223_WIDTH                (1U)
#define STCU_MBSSW_MBSSW223(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW223_SHIFT)) & STCU_MBSSW_MBSSW223_MASK)

#define STCU_MBSSW_MBSSW224_MASK                 (0x1U)
#define STCU_MBSSW_MBSSW224_SHIFT                (0U)
#define STCU_MBSSW_MBSSW224_WIDTH                (1U)
#define STCU_MBSSW_MBSSW224(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW224_SHIFT)) & STCU_MBSSW_MBSSW224_MASK)

#define STCU_MBSSW_MBSSW225_MASK                 (0x2U)
#define STCU_MBSSW_MBSSW225_SHIFT                (1U)
#define STCU_MBSSW_MBSSW225_WIDTH                (1U)
#define STCU_MBSSW_MBSSW225(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW225_SHIFT)) & STCU_MBSSW_MBSSW225_MASK)

#define STCU_MBSSW_MBSSW226_MASK                 (0x4U)
#define STCU_MBSSW_MBSSW226_SHIFT                (2U)
#define STCU_MBSSW_MBSSW226_WIDTH                (1U)
#define STCU_MBSSW_MBSSW226(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW226_SHIFT)) & STCU_MBSSW_MBSSW226_MASK)

#define STCU_MBSSW_MBSSW227_MASK                 (0x8U)
#define STCU_MBSSW_MBSSW227_SHIFT                (3U)
#define STCU_MBSSW_MBSSW227_WIDTH                (1U)
#define STCU_MBSSW_MBSSW227(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW227_SHIFT)) & STCU_MBSSW_MBSSW227_MASK)

#define STCU_MBSSW_MBSSW228_MASK                 (0x10U)
#define STCU_MBSSW_MBSSW228_SHIFT                (4U)
#define STCU_MBSSW_MBSSW228_WIDTH                (1U)
#define STCU_MBSSW_MBSSW228(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW228_SHIFT)) & STCU_MBSSW_MBSSW228_MASK)

#define STCU_MBSSW_MBSSW229_MASK                 (0x20U)
#define STCU_MBSSW_MBSSW229_SHIFT                (5U)
#define STCU_MBSSW_MBSSW229_WIDTH                (1U)
#define STCU_MBSSW_MBSSW229(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW229_SHIFT)) & STCU_MBSSW_MBSSW229_MASK)

#define STCU_MBSSW_MBSSW230_MASK                 (0x40U)
#define STCU_MBSSW_MBSSW230_SHIFT                (6U)
#define STCU_MBSSW_MBSSW230_WIDTH                (1U)
#define STCU_MBSSW_MBSSW230(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW230_SHIFT)) & STCU_MBSSW_MBSSW230_MASK)

#define STCU_MBSSW_MBSSW231_MASK                 (0x80U)
#define STCU_MBSSW_MBSSW231_SHIFT                (7U)
#define STCU_MBSSW_MBSSW231_WIDTH                (1U)
#define STCU_MBSSW_MBSSW231(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW231_SHIFT)) & STCU_MBSSW_MBSSW231_MASK)

#define STCU_MBSSW_MBSSW232_MASK                 (0x100U)
#define STCU_MBSSW_MBSSW232_SHIFT                (8U)
#define STCU_MBSSW_MBSSW232_WIDTH                (1U)
#define STCU_MBSSW_MBSSW232(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW232_SHIFT)) & STCU_MBSSW_MBSSW232_MASK)

#define STCU_MBSSW_MBSSW233_MASK                 (0x200U)
#define STCU_MBSSW_MBSSW233_SHIFT                (9U)
#define STCU_MBSSW_MBSSW233_WIDTH                (1U)
#define STCU_MBSSW_MBSSW233(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW233_SHIFT)) & STCU_MBSSW_MBSSW233_MASK)

