zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBSSW_MBSSW234_MASK                 (0x400U)
#define STCU_MBSSW_MBSSW234_SHIFT                (10U)
#define STCU_MBSSW_MBSSW234_WIDTH                (1U)
#define STCU_MBSSW_MBSSW234(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW234_SHIFT)) & STCU_MBSSW_MBSSW234_MASK)

#define STCU_MBSSW_MBSSW235_MASK                 (0x800U)
#define STCU_MBSSW_MBSSW235_SHIFT                (11U)
#define STCU_MBSSW_MBSSW235_WIDTH                (1U)
#define STCU_MBSSW_MBSSW235(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW235_SHIFT)) & STCU_MBSSW_MBSSW235_MASK)

#define STCU_MBSSW_MBSSW236_MASK                 (0x1000U)
#define STCU_MBSSW_MBSSW236_SHIFT                (12U)
#define STCU_MBSSW_MBSSW236_WIDTH                (1U)
#define STCU_MBSSW_MBSSW236(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW236_SHIFT)) & STCU_MBSSW_MBSSW236_MASK)

#define STCU_MBSSW_MBSSW237_MASK                 (0x2000U)
#define STCU_MBSSW_MBSSW237_SHIFT                (13U)
#define STCU_MBSSW_MBSSW237_WIDTH                (1U)
#define STCU_MBSSW_MBSSW237(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW237_SHIFT)) & STCU_MBSSW_MBSSW237_MASK)

#define STCU_MBSSW_MBSSW238_MASK                 (0x4000U)
#define STCU_MBSSW_MBSSW238_SHIFT                (14U)
#define STCU_MBSSW_MBSSW238_WIDTH                (1U)
#define STCU_MBSSW_MBSSW238(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW238_SHIFT)) & STCU_MBSSW_MBSSW238_MASK)

#define STCU_MBSSW_MBSSW239_MASK                 (0x8000U)
#define STCU_MBSSW_MBSSW239_SHIFT                (15U)
#define STCU_MBSSW_MBSSW239_WIDTH                (1U)
#define STCU_MBSSW_MBSSW239(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW239_SHIFT)) & STCU_MBSSW_MBSSW239_MASK)

#define STCU_MBSSW_MBSSW240_MASK                 (0x10000U)
#define STCU_MBSSW_MBSSW240_SHIFT                (16U)
#define STCU_MBSSW_MBSSW240_WIDTH                (1U)
#define STCU_MBSSW_MBSSW240(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW240_SHIFT)) & STCU_MBSSW_MBSSW240_MASK)

#define STCU_MBSSW_MBSSW241_MASK                 (0x20000U)
#define STCU_MBSSW_MBSSW241_SHIFT                (17U)
#define STCU_MBSSW_MBSSW241_WIDTH                (1U)
#define STCU_MBSSW_MBSSW241(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW241_SHIFT)) & STCU_MBSSW_MBSSW241_MASK)

#define STCU_MBSSW_MBSSW242_MASK                 (0x40000U)
#define STCU_MBSSW_MBSSW242_SHIFT                (18U)
#define STCU_MBSSW_MBSSW242_WIDTH                (1U)
#define STCU_MBSSW_MBSSW242(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW242_SHIFT)) & STCU_MBSSW_MBSSW242_MASK)

#define STCU_MBSSW_MBSSW243_MASK                 (0x80000U)
#define STCU_MBSSW_MBSSW243_SHIFT                (19U)
#define STCU_MBSSW_MBSSW243_WIDTH                (1U)
#define STCU_MBSSW_MBSSW243(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW243_SHIFT)) & STCU_MBSSW_MBSSW243_MASK)

#define STCU_MBSSW_MBSSW244_MASK                 (0x100000U)
#define STCU_MBSSW_MBSSW244_SHIFT                (20U)
#define STCU_MBSSW_MBSSW244_WIDTH                (1U)
#define STCU_MBSSW_MBSSW244(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW244_SHIFT)) & STCU_MBSSW_MBSSW244_MASK)

#define STCU_MBSSW_MBSSW245_MASK                 (0x200000U)
#define STCU_MBSSW_MBSSW245_SHIFT                (21U)
#define STCU_MBSSW_MBSSW245_WIDTH                (1U)
#define STCU_MBSSW_MBSSW245(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW245_SHIFT)) & STCU_MBSSW_MBSSW245_MASK)

#define STCU_MBSSW_MBSSW246_MASK                 (0x400000U)
#define STCU_MBSSW_MBSSW246_SHIFT                (22U)
#define STCU_MBSSW_MBSSW246_WIDTH                (1U)
#define STCU_MBSSW_MBSSW246(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW246_SHIFT)) & STCU_MBSSW_MBSSW246_MASK)

#define STCU_MBSSW_MBSSW247_MASK                 (0x800000U)
#define STCU_MBSSW_MBSSW247_SHIFT                (23U)
#define STCU_MBSSW_MBSSW247_WIDTH                (1U)
#define STCU_MBSSW_MBSSW247(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW247_SHIFT)) & STCU_MBSSW_MBSSW247_MASK)

#define STCU_MBSSW_MBSSW248_MASK                 (0x1000000U)
#define STCU_MBSSW_MBSSW248_SHIFT                (24U)
#define STCU_MBSSW_MBSSW248_WIDTH                (1U)
#define STCU_MBSSW_MBSSW248(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW248_SHIFT)) & STCU_MBSSW_MBSSW248_MASK)

#define STCU_MBSSW_MBSSW249_MASK                 (0x2000000U)
#define STCU_MBSSW_MBSSW249_SHIFT                (25U)
#define STCU_MBSSW_MBSSW249_WIDTH                (1U)
#define STCU_MBSSW_MBSSW249(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW249_SHIFT)) & STCU_MBSSW_MBSSW249_MASK)

#define STCU_MBSSW_MBSSW250_MASK                 (0x4000000U)
#define STCU_MBSSW_MBSSW250_SHIFT                (26U)
#define STCU_MBSSW_MBSSW250_WIDTH                (1U)
#define STCU_MBSSW_MBSSW250(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW250_SHIFT)) & STCU_MBSSW_MBSSW250_MASK)

#define STCU_MBSSW_MBSSW251_MASK                 (0x8000000U)
#define STCU_MBSSW_MBSSW251_SHIFT                (27U)
#define STCU_MBSSW_MBSSW251_WIDTH                (1U)
#define STCU_MBSSW_MBSSW251(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW251_SHIFT)) & STCU_MBSSW_MBSSW251_MASK)

#define STCU_MBSSW_MBSSW252_MASK                 (0x10000000U)
#define STCU_MBSSW_MBSSW252_SHIFT                (28U)
#define STCU_MBSSW_MBSSW252_WIDTH                (1U)
#define STCU_MBSSW_MBSSW252(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW252_SHIFT)) & STCU_MBSSW_MBSSW252_MASK)

#define STCU_MBSSW_MBSSW253_MASK                 (0x20000000U)
#define STCU_MBSSW_MBSSW253_SHIFT                (29U)
#define STCU_MBSSW_MBSSW253_WIDTH                (1U)
#define STCU_MBSSW_MBSSW253(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW253_SHIFT)) & STCU_MBSSW_MBSSW253_MASK)

