zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBSSW_MBSSW254_MASK                 (0x40000000U)
#define STCU_MBSSW_MBSSW254_SHIFT                (30U)
#define STCU_MBSSW_MBSSW254_WIDTH                (1U)
#define STCU_MBSSW_MBSSW254(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW254_SHIFT)) & STCU_MBSSW_MBSSW254_MASK)

#define STCU_MBSSW_MBSSW255_MASK                 (0x80000000U)
#define STCU_MBSSW_MBSSW255_SHIFT                (31U)
#define STCU_MBSSW_MBSSW255_WIDTH                (1U)
#define STCU_MBSSW_MBSSW255(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW_MBSSW255_SHIFT)) & STCU_MBSSW_MBSSW255_MASK)
/*! @} */

/*! @name MBESW - STCU2 Online MBIST End Flag */
/*! @{ */

#define STCU_MBESW_MBESW0_MASK                   (0x1U)
#define STCU_MBESW_MBESW0_SHIFT                  (0U)
#define STCU_MBESW_MBESW0_WIDTH                  (1U)
#define STCU_MBESW_MBESW0(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW0_SHIFT)) & STCU_MBESW_MBESW0_MASK)

#define STCU_MBESW_MBESW1_MASK                   (0x2U)
#define STCU_MBESW_MBESW1_SHIFT                  (1U)
#define STCU_MBESW_MBESW1_WIDTH                  (1U)
#define STCU_MBESW_MBESW1(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW1_SHIFT)) & STCU_MBESW_MBESW1_MASK)

#define STCU_MBESW_MBESW2_MASK                   (0x4U)
#define STCU_MBESW_MBESW2_SHIFT                  (2U)
#define STCU_MBESW_MBESW2_WIDTH                  (1U)
#define STCU_MBESW_MBESW2(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW2_SHIFT)) & STCU_MBESW_MBESW2_MASK)

#define STCU_MBESW_MBESW3_MASK                   (0x8U)
#define STCU_MBESW_MBESW3_SHIFT                  (3U)
#define STCU_MBESW_MBESW3_WIDTH                  (1U)
#define STCU_MBESW_MBESW3(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW3_SHIFT)) & STCU_MBESW_MBESW3_MASK)

#define STCU_MBESW_MBESW4_MASK                   (0x10U)
#define STCU_MBESW_MBESW4_SHIFT                  (4U)
#define STCU_MBESW_MBESW4_WIDTH                  (1U)
#define STCU_MBESW_MBESW4(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW4_SHIFT)) & STCU_MBESW_MBESW4_MASK)

#define STCU_MBESW_MBESW5_MASK                   (0x20U)
#define STCU_MBESW_MBESW5_SHIFT                  (5U)
#define STCU_MBESW_MBESW5_WIDTH                  (1U)
#define STCU_MBESW_MBESW5(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW5_SHIFT)) & STCU_MBESW_MBESW5_MASK)

#define STCU_MBESW_MBESW6_MASK                   (0x40U)
#define STCU_MBESW_MBESW6_SHIFT                  (6U)
#define STCU_MBESW_MBESW6_WIDTH                  (1U)
#define STCU_MBESW_MBESW6(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW6_SHIFT)) & STCU_MBESW_MBESW6_MASK)

#define STCU_MBESW_MBESW7_MASK                   (0x80U)
#define STCU_MBESW_MBESW7_SHIFT                  (7U)
#define STCU_MBESW_MBESW7_WIDTH                  (1U)
#define STCU_MBESW_MBESW7(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW7_SHIFT)) & STCU_MBESW_MBESW7_MASK)

#define STCU_MBESW_MBESW8_MASK                   (0x100U)
#define STCU_MBESW_MBESW8_SHIFT                  (8U)
#define STCU_MBESW_MBESW8_WIDTH                  (1U)
#define STCU_MBESW_MBESW8(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW8_SHIFT)) & STCU_MBESW_MBESW8_MASK)

#define STCU_MBESW_MBESW9_MASK                   (0x200U)
#define STCU_MBESW_MBESW9_SHIFT                  (9U)
#define STCU_MBESW_MBESW9_WIDTH                  (1U)
#define STCU_MBESW_MBESW9(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW9_SHIFT)) & STCU_MBESW_MBESW9_MASK)

#define STCU_MBESW_MBESW10_MASK                  (0x400U)
#define STCU_MBESW_MBESW10_SHIFT                 (10U)
#define STCU_MBESW_MBESW10_WIDTH                 (1U)
#define STCU_MBESW_MBESW10(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW10_SHIFT)) & STCU_MBESW_MBESW10_MASK)

#define STCU_MBESW_MBESW11_MASK                  (0x800U)
#define STCU_MBESW_MBESW11_SHIFT                 (11U)
#define STCU_MBESW_MBESW11_WIDTH                 (1U)
#define STCU_MBESW_MBESW11(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW11_SHIFT)) & STCU_MBESW_MBESW11_MASK)

#define STCU_MBESW_MBESW12_MASK                  (0x1000U)
#define STCU_MBESW_MBESW12_SHIFT                 (12U)
#define STCU_MBESW_MBESW12_WIDTH                 (1U)
#define STCU_MBESW_MBESW12(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW12_SHIFT)) & STCU_MBESW_MBESW12_MASK)

#define STCU_MBESW_MBESW13_MASK                  (0x2000U)
#define STCU_MBESW_MBESW13_SHIFT                 (13U)
#define STCU_MBESW_MBESW13_WIDTH                 (1U)
#define STCU_MBESW_MBESW13(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW13_SHIFT)) & STCU_MBESW_MBESW13_MASK)

#define STCU_MBESW_MBESW14_MASK                  (0x4000U)
#define STCU_MBESW_MBESW14_SHIFT                 (14U)
#define STCU_MBESW_MBESW14_WIDTH                 (1U)
#define STCU_MBESW_MBESW14(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW14_SHIFT)) & STCU_MBESW_MBESW14_MASK)

#define STCU_MBESW_MBESW15_MASK                  (0x8000U)
#define STCU_MBESW_MBESW15_SHIFT                 (15U)
#define STCU_MBESW_MBESW15_WIDTH                 (1U)
#define STCU_MBESW_MBESW15(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW15_SHIFT)) & STCU_MBESW_MBESW15_MASK)

#define STCU_MBESW_MBESW16_MASK                  (0x10000U)
#define STCU_MBESW_MBESW16_SHIFT                 (16U)
#define STCU_MBESW_MBESW16_WIDTH                 (1U)
#define STCU_MBESW_MBESW16(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW16_SHIFT)) & STCU_MBESW_MBESW16_MASK)

#define STCU_MBESW_MBESW17_MASK                  (0x20000U)
#define STCU_MBESW_MBESW17_SHIFT                 (17U)
#define STCU_MBESW_MBESW17_WIDTH                 (1U)
#define STCU_MBESW_MBESW17(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW17_SHIFT)) & STCU_MBESW_MBESW17_MASK)

