zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBESW_MBESW18_MASK                  (0x40000U)
#define STCU_MBESW_MBESW18_SHIFT                 (18U)
#define STCU_MBESW_MBESW18_WIDTH                 (1U)
#define STCU_MBESW_MBESW18(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW18_SHIFT)) & STCU_MBESW_MBESW18_MASK)

#define STCU_MBESW_MBESW19_MASK                  (0x80000U)
#define STCU_MBESW_MBESW19_SHIFT                 (19U)
#define STCU_MBESW_MBESW19_WIDTH                 (1U)
#define STCU_MBESW_MBESW19(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW19_SHIFT)) & STCU_MBESW_MBESW19_MASK)

#define STCU_MBESW_MBESW20_MASK                  (0x100000U)
#define STCU_MBESW_MBESW20_SHIFT                 (20U)
#define STCU_MBESW_MBESW20_WIDTH                 (1U)
#define STCU_MBESW_MBESW20(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW20_SHIFT)) & STCU_MBESW_MBESW20_MASK)

#define STCU_MBESW_MBESW21_MASK                  (0x200000U)
#define STCU_MBESW_MBESW21_SHIFT                 (21U)
#define STCU_MBESW_MBESW21_WIDTH                 (1U)
#define STCU_MBESW_MBESW21(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW21_SHIFT)) & STCU_MBESW_MBESW21_MASK)

#define STCU_MBESW_MBESW22_MASK                  (0x400000U)
#define STCU_MBESW_MBESW22_SHIFT                 (22U)
#define STCU_MBESW_MBESW22_WIDTH                 (1U)
#define STCU_MBESW_MBESW22(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW22_SHIFT)) & STCU_MBESW_MBESW22_MASK)

#define STCU_MBESW_MBESW23_MASK                  (0x800000U)
#define STCU_MBESW_MBESW23_SHIFT                 (23U)
#define STCU_MBESW_MBESW23_WIDTH                 (1U)
#define STCU_MBESW_MBESW23(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW23_SHIFT)) & STCU_MBESW_MBESW23_MASK)

#define STCU_MBESW_MBESW24_MASK                  (0x1000000U)
#define STCU_MBESW_MBESW24_SHIFT                 (24U)
#define STCU_MBESW_MBESW24_WIDTH                 (1U)
#define STCU_MBESW_MBESW24(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW24_SHIFT)) & STCU_MBESW_MBESW24_MASK)

#define STCU_MBESW_MBESW25_MASK                  (0x2000000U)
#define STCU_MBESW_MBESW25_SHIFT                 (25U)
#define STCU_MBESW_MBESW25_WIDTH                 (1U)
#define STCU_MBESW_MBESW25(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW25_SHIFT)) & STCU_MBESW_MBESW25_MASK)

#define STCU_MBESW_MBESW26_MASK                  (0x4000000U)
#define STCU_MBESW_MBESW26_SHIFT                 (26U)
#define STCU_MBESW_MBESW26_WIDTH                 (1U)
#define STCU_MBESW_MBESW26(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW26_SHIFT)) & STCU_MBESW_MBESW26_MASK)

#define STCU_MBESW_MBESW27_MASK                  (0x8000000U)
#define STCU_MBESW_MBESW27_SHIFT                 (27U)
#define STCU_MBESW_MBESW27_WIDTH                 (1U)
#define STCU_MBESW_MBESW27(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW27_SHIFT)) & STCU_MBESW_MBESW27_MASK)

#define STCU_MBESW_MBESW28_MASK                  (0x10000000U)
#define STCU_MBESW_MBESW28_SHIFT                 (28U)
#define STCU_MBESW_MBESW28_WIDTH                 (1U)
#define STCU_MBESW_MBESW28(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW28_SHIFT)) & STCU_MBESW_MBESW28_MASK)

#define STCU_MBESW_MBESW29_MASK                  (0x20000000U)
#define STCU_MBESW_MBESW29_SHIFT                 (29U)
#define STCU_MBESW_MBESW29_WIDTH                 (1U)
#define STCU_MBESW_MBESW29(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW29_SHIFT)) & STCU_MBESW_MBESW29_MASK)

#define STCU_MBESW_MBESW30_MASK                  (0x40000000U)
#define STCU_MBESW_MBESW30_SHIFT                 (30U)
#define STCU_MBESW_MBESW30_WIDTH                 (1U)
#define STCU_MBESW_MBESW30(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW30_SHIFT)) & STCU_MBESW_MBESW30_MASK)

#define STCU_MBESW_MBESW31_MASK                  (0x80000000U)
#define STCU_MBESW_MBESW31_SHIFT                 (31U)
#define STCU_MBESW_MBESW31_WIDTH                 (1U)
#define STCU_MBESW_MBESW31(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW31_SHIFT)) & STCU_MBESW_MBESW31_MASK)

#define STCU_MBESW_MBESW32_MASK                  (0x1U)
#define STCU_MBESW_MBESW32_SHIFT                 (0U)
#define STCU_MBESW_MBESW32_WIDTH                 (1U)
#define STCU_MBESW_MBESW32(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW32_SHIFT)) & STCU_MBESW_MBESW32_MASK)

#define STCU_MBESW_MBESW33_MASK                  (0x2U)
#define STCU_MBESW_MBESW33_SHIFT                 (1U)
#define STCU_MBESW_MBESW33_WIDTH                 (1U)
#define STCU_MBESW_MBESW33(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW33_SHIFT)) & STCU_MBESW_MBESW33_MASK)

#define STCU_MBESW_MBESW34_MASK                  (0x4U)
#define STCU_MBESW_MBESW34_SHIFT                 (2U)
#define STCU_MBESW_MBESW34_WIDTH                 (1U)
#define STCU_MBESW_MBESW34(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW34_SHIFT)) & STCU_MBESW_MBESW34_MASK)

#define STCU_MBESW_MBESW35_MASK                  (0x8U)
#define STCU_MBESW_MBESW35_SHIFT                 (3U)
#define STCU_MBESW_MBESW35_WIDTH                 (1U)
#define STCU_MBESW_MBESW35(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW35_SHIFT)) & STCU_MBESW_MBESW35_MASK)

#define STCU_MBESW_MBESW36_MASK                  (0x10U)
#define STCU_MBESW_MBESW36_SHIFT                 (4U)
#define STCU_MBESW_MBESW36_WIDTH                 (1U)
#define STCU_MBESW_MBESW36(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW36_SHIFT)) & STCU_MBESW_MBESW36_MASK)

#define STCU_MBESW_MBESW37_MASK                  (0x20U)
#define STCU_MBESW_MBESW37_SHIFT                 (5U)
#define STCU_MBESW_MBESW37_WIDTH                 (1U)
#define STCU_MBESW_MBESW37(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW37_SHIFT)) & STCU_MBESW_MBESW37_MASK)

#define STCU_MBESW_MBESW38_MASK                  (0x40U)
#define STCU_MBESW_MBESW38_SHIFT                 (6U)
#define STCU_MBESW_MBESW38_WIDTH                 (1U)
#define STCU_MBESW_MBESW38(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW38_SHIFT)) & STCU_MBESW_MBESW38_MASK)

