zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBESW_MBESW39_MASK                  (0x80U)
#define STCU_MBESW_MBESW39_SHIFT                 (7U)
#define STCU_MBESW_MBESW39_WIDTH                 (1U)
#define STCU_MBESW_MBESW39(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW39_SHIFT)) & STCU_MBESW_MBESW39_MASK)

#define STCU_MBESW_MBESW40_MASK                  (0x100U)
#define STCU_MBESW_MBESW40_SHIFT                 (8U)
#define STCU_MBESW_MBESW40_WIDTH                 (1U)
#define STCU_MBESW_MBESW40(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW40_SHIFT)) & STCU_MBESW_MBESW40_MASK)

#define STCU_MBESW_MBESW41_MASK                  (0x200U)
#define STCU_MBESW_MBESW41_SHIFT                 (9U)
#define STCU_MBESW_MBESW41_WIDTH                 (1U)
#define STCU_MBESW_MBESW41(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW41_SHIFT)) & STCU_MBESW_MBESW41_MASK)

#define STCU_MBESW_MBESW42_MASK                  (0x400U)
#define STCU_MBESW_MBESW42_SHIFT                 (10U)
#define STCU_MBESW_MBESW42_WIDTH                 (1U)
#define STCU_MBESW_MBESW42(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW42_SHIFT)) & STCU_MBESW_MBESW42_MASK)

#define STCU_MBESW_MBESW43_MASK                  (0x800U)
#define STCU_MBESW_MBESW43_SHIFT                 (11U)
#define STCU_MBESW_MBESW43_WIDTH                 (1U)
#define STCU_MBESW_MBESW43(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW43_SHIFT)) & STCU_MBESW_MBESW43_MASK)

#define STCU_MBESW_MBESW44_MASK                  (0x1000U)
#define STCU_MBESW_MBESW44_SHIFT                 (12U)
#define STCU_MBESW_MBESW44_WIDTH                 (1U)
#define STCU_MBESW_MBESW44(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW44_SHIFT)) & STCU_MBESW_MBESW44_MASK)

#define STCU_MBESW_MBESW45_MASK                  (0x2000U)
#define STCU_MBESW_MBESW45_SHIFT                 (13U)
#define STCU_MBESW_MBESW45_WIDTH                 (1U)
#define STCU_MBESW_MBESW45(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW45_SHIFT)) & STCU_MBESW_MBESW45_MASK)

#define STCU_MBESW_MBESW46_MASK                  (0x4000U)
#define STCU_MBESW_MBESW46_SHIFT                 (14U)
#define STCU_MBESW_MBESW46_WIDTH                 (1U)
#define STCU_MBESW_MBESW46(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW46_SHIFT)) & STCU_MBESW_MBESW46_MASK)

#define STCU_MBESW_MBESW47_MASK                  (0x8000U)
#define STCU_MBESW_MBESW47_SHIFT                 (15U)
#define STCU_MBESW_MBESW47_WIDTH                 (1U)
#define STCU_MBESW_MBESW47(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW47_SHIFT)) & STCU_MBESW_MBESW47_MASK)

#define STCU_MBESW_MBESW48_MASK                  (0x10000U)
#define STCU_MBESW_MBESW48_SHIFT                 (16U)
#define STCU_MBESW_MBESW48_WIDTH                 (1U)
#define STCU_MBESW_MBESW48(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW48_SHIFT)) & STCU_MBESW_MBESW48_MASK)

#define STCU_MBESW_MBESW49_MASK                  (0x20000U)
#define STCU_MBESW_MBESW49_SHIFT                 (17U)
#define STCU_MBESW_MBESW49_WIDTH                 (1U)
#define STCU_MBESW_MBESW49(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW49_SHIFT)) & STCU_MBESW_MBESW49_MASK)

#define STCU_MBESW_MBESW50_MASK                  (0x40000U)
#define STCU_MBESW_MBESW50_SHIFT                 (18U)
#define STCU_MBESW_MBESW50_WIDTH                 (1U)
#define STCU_MBESW_MBESW50(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW50_SHIFT)) & STCU_MBESW_MBESW50_MASK)

#define STCU_MBESW_MBESW51_MASK                  (0x80000U)
#define STCU_MBESW_MBESW51_SHIFT                 (19U)
#define STCU_MBESW_MBESW51_WIDTH                 (1U)
#define STCU_MBESW_MBESW51(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW51_SHIFT)) & STCU_MBESW_MBESW51_MASK)

#define STCU_MBESW_MBESW52_MASK                  (0x100000U)
#define STCU_MBESW_MBESW52_SHIFT                 (20U)
#define STCU_MBESW_MBESW52_WIDTH                 (1U)
#define STCU_MBESW_MBESW52(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW52_SHIFT)) & STCU_MBESW_MBESW52_MASK)

#define STCU_MBESW_MBESW53_MASK                  (0x200000U)
#define STCU_MBESW_MBESW53_SHIFT                 (21U)
#define STCU_MBESW_MBESW53_WIDTH                 (1U)
#define STCU_MBESW_MBESW53(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW53_SHIFT)) & STCU_MBESW_MBESW53_MASK)

#define STCU_MBESW_MBESW54_MASK                  (0x400000U)
#define STCU_MBESW_MBESW54_SHIFT                 (22U)
#define STCU_MBESW_MBESW54_WIDTH                 (1U)
#define STCU_MBESW_MBESW54(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW54_SHIFT)) & STCU_MBESW_MBESW54_MASK)

#define STCU_MBESW_MBESW55_MASK                  (0x800000U)
#define STCU_MBESW_MBESW55_SHIFT                 (23U)
#define STCU_MBESW_MBESW55_WIDTH                 (1U)
#define STCU_MBESW_MBESW55(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW55_SHIFT)) & STCU_MBESW_MBESW55_MASK)

#define STCU_MBESW_MBESW56_MASK                  (0x1000000U)
#define STCU_MBESW_MBESW56_SHIFT                 (24U)
#define STCU_MBESW_MBESW56_WIDTH                 (1U)
#define STCU_MBESW_MBESW56(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW56_SHIFT)) & STCU_MBESW_MBESW56_MASK)

#define STCU_MBESW_MBESW57_MASK                  (0x2000000U)
#define STCU_MBESW_MBESW57_SHIFT                 (25U)
#define STCU_MBESW_MBESW57_WIDTH                 (1U)
#define STCU_MBESW_MBESW57(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW57_SHIFT)) & STCU_MBESW_MBESW57_MASK)

#define STCU_MBESW_MBESW58_MASK                  (0x4000000U)
#define STCU_MBESW_MBESW58_SHIFT                 (26U)
#define STCU_MBESW_MBESW58_WIDTH                 (1U)
#define STCU_MBESW_MBESW58(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW58_SHIFT)) & STCU_MBESW_MBESW58_MASK)

