zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBESW_MBESW59_MASK                  (0x8000000U)
#define STCU_MBESW_MBESW59_SHIFT                 (27U)
#define STCU_MBESW_MBESW59_WIDTH                 (1U)
#define STCU_MBESW_MBESW59(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW59_SHIFT)) & STCU_MBESW_MBESW59_MASK)

#define STCU_MBESW_MBESW60_MASK                  (0x10000000U)
#define STCU_MBESW_MBESW60_SHIFT                 (28U)
#define STCU_MBESW_MBESW60_WIDTH                 (1U)
#define STCU_MBESW_MBESW60(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW60_SHIFT)) & STCU_MBESW_MBESW60_MASK)

#define STCU_MBESW_MBESW61_MASK                  (0x20000000U)
#define STCU_MBESW_MBESW61_SHIFT                 (29U)
#define STCU_MBESW_MBESW61_WIDTH                 (1U)
#define STCU_MBESW_MBESW61(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW61_SHIFT)) & STCU_MBESW_MBESW61_MASK)

#define STCU_MBESW_MBESW62_MASK                  (0x40000000U)
#define STCU_MBESW_MBESW62_SHIFT                 (30U)
#define STCU_MBESW_MBESW62_WIDTH                 (1U)
#define STCU_MBESW_MBESW62(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW62_SHIFT)) & STCU_MBESW_MBESW62_MASK)

#define STCU_MBESW_MBESW63_MASK                  (0x80000000U)
#define STCU_MBESW_MBESW63_SHIFT                 (31U)
#define STCU_MBESW_MBESW63_WIDTH                 (1U)
#define STCU_MBESW_MBESW63(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW63_SHIFT)) & STCU_MBESW_MBESW63_MASK)

#define STCU_MBESW_MBESW64_MASK                  (0x1U)
#define STCU_MBESW_MBESW64_SHIFT                 (0U)
#define STCU_MBESW_MBESW64_WIDTH                 (1U)
#define STCU_MBESW_MBESW64(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW64_SHIFT)) & STCU_MBESW_MBESW64_MASK)

#define STCU_MBESW_MBESW65_MASK                  (0x2U)
#define STCU_MBESW_MBESW65_SHIFT                 (1U)
#define STCU_MBESW_MBESW65_WIDTH                 (1U)
#define STCU_MBESW_MBESW65(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW65_SHIFT)) & STCU_MBESW_MBESW65_MASK)

#define STCU_MBESW_MBESW66_MASK                  (0x4U)
#define STCU_MBESW_MBESW66_SHIFT                 (2U)
#define STCU_MBESW_MBESW66_WIDTH                 (1U)
#define STCU_MBESW_MBESW66(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW66_SHIFT)) & STCU_MBESW_MBESW66_MASK)

#define STCU_MBESW_MBESW67_MASK                  (0x8U)
#define STCU_MBESW_MBESW67_SHIFT                 (3U)
#define STCU_MBESW_MBESW67_WIDTH                 (1U)
#define STCU_MBESW_MBESW67(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW67_SHIFT)) & STCU_MBESW_MBESW67_MASK)

#define STCU_MBESW_MBESW68_MASK                  (0x10U)
#define STCU_MBESW_MBESW68_SHIFT                 (4U)
#define STCU_MBESW_MBESW68_WIDTH                 (1U)
#define STCU_MBESW_MBESW68(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW68_SHIFT)) & STCU_MBESW_MBESW68_MASK)

#define STCU_MBESW_MBESW69_MASK                  (0x20U)
#define STCU_MBESW_MBESW69_SHIFT                 (5U)
#define STCU_MBESW_MBESW69_WIDTH                 (1U)
#define STCU_MBESW_MBESW69(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW69_SHIFT)) & STCU_MBESW_MBESW69_MASK)

#define STCU_MBESW_MBESW70_MASK                  (0x40U)
#define STCU_MBESW_MBESW70_SHIFT                 (6U)
#define STCU_MBESW_MBESW70_WIDTH                 (1U)
#define STCU_MBESW_MBESW70(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW70_SHIFT)) & STCU_MBESW_MBESW70_MASK)

#define STCU_MBESW_MBESW71_MASK                  (0x80U)
#define STCU_MBESW_MBESW71_SHIFT                 (7U)
#define STCU_MBESW_MBESW71_WIDTH                 (1U)
#define STCU_MBESW_MBESW71(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW71_SHIFT)) & STCU_MBESW_MBESW71_MASK)

#define STCU_MBESW_MBESW72_MASK                  (0x100U)
#define STCU_MBESW_MBESW72_SHIFT                 (8U)
#define STCU_MBESW_MBESW72_WIDTH                 (1U)
#define STCU_MBESW_MBESW72(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW72_SHIFT)) & STCU_MBESW_MBESW72_MASK)

#define STCU_MBESW_MBESW73_MASK                  (0x200U)
#define STCU_MBESW_MBESW73_SHIFT                 (9U)
#define STCU_MBESW_MBESW73_WIDTH                 (1U)
#define STCU_MBESW_MBESW73(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW73_SHIFT)) & STCU_MBESW_MBESW73_MASK)

#define STCU_MBESW_MBESW74_MASK                  (0x400U)
#define STCU_MBESW_MBESW74_SHIFT                 (10U)
#define STCU_MBESW_MBESW74_WIDTH                 (1U)
#define STCU_MBESW_MBESW74(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW74_SHIFT)) & STCU_MBESW_MBESW74_MASK)

#define STCU_MBESW_MBESW75_MASK                  (0x800U)
#define STCU_MBESW_MBESW75_SHIFT                 (11U)
#define STCU_MBESW_MBESW75_WIDTH                 (1U)
#define STCU_MBESW_MBESW75(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW75_SHIFT)) & STCU_MBESW_MBESW75_MASK)

#define STCU_MBESW_MBESW76_MASK                  (0x1000U)
#define STCU_MBESW_MBESW76_SHIFT                 (12U)
#define STCU_MBESW_MBESW76_WIDTH                 (1U)
#define STCU_MBESW_MBESW76(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW76_SHIFT)) & STCU_MBESW_MBESW76_MASK)

#define STCU_MBESW_MBESW77_MASK                  (0x2000U)
#define STCU_MBESW_MBESW77_SHIFT                 (13U)
#define STCU_MBESW_MBESW77_WIDTH                 (1U)
#define STCU_MBESW_MBESW77(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW77_SHIFT)) & STCU_MBESW_MBESW77_MASK)

#define STCU_MBESW_MBESW78_MASK                  (0x4000U)
#define STCU_MBESW_MBESW78_SHIFT                 (14U)
#define STCU_MBESW_MBESW78_WIDTH                 (1U)
#define STCU_MBESW_MBESW78(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW78_SHIFT)) & STCU_MBESW_MBESW78_MASK)

#define STCU_MBESW_MBESW79_MASK                  (0x8000U)
#define STCU_MBESW_MBESW79_SHIFT                 (15U)
#define STCU_MBESW_MBESW79_WIDTH                 (1U)
#define STCU_MBESW_MBESW79(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW79_SHIFT)) & STCU_MBESW_MBESW79_MASK)

#define STCU_MBESW_MBESW80_MASK                  (0x10000U)
#define STCU_MBESW_MBESW80_SHIFT                 (16U)
#define STCU_MBESW_MBESW80_WIDTH                 (1U)
#define STCU_MBESW_MBESW80(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW80_SHIFT)) & STCU_MBESW_MBESW80_MASK)

