zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBESW_MBESW81_MASK                  (0x20000U)
#define STCU_MBESW_MBESW81_SHIFT                 (17U)
#define STCU_MBESW_MBESW81_WIDTH                 (1U)
#define STCU_MBESW_MBESW81(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW81_SHIFT)) & STCU_MBESW_MBESW81_MASK)

#define STCU_MBESW_MBESW82_MASK                  (0x40000U)
#define STCU_MBESW_MBESW82_SHIFT                 (18U)
#define STCU_MBESW_MBESW82_WIDTH                 (1U)
#define STCU_MBESW_MBESW82(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW82_SHIFT)) & STCU_MBESW_MBESW82_MASK)

#define STCU_MBESW_MBESW83_MASK                  (0x80000U)
#define STCU_MBESW_MBESW83_SHIFT                 (19U)
#define STCU_MBESW_MBESW83_WIDTH                 (1U)
#define STCU_MBESW_MBESW83(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW83_SHIFT)) & STCU_MBESW_MBESW83_MASK)

#define STCU_MBESW_MBESW84_MASK                  (0x100000U)
#define STCU_MBESW_MBESW84_SHIFT                 (20U)
#define STCU_MBESW_MBESW84_WIDTH                 (1U)
#define STCU_MBESW_MBESW84(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW84_SHIFT)) & STCU_MBESW_MBESW84_MASK)

#define STCU_MBESW_MBESW85_MASK                  (0x200000U)
#define STCU_MBESW_MBESW85_SHIFT                 (21U)
#define STCU_MBESW_MBESW85_WIDTH                 (1U)
#define STCU_MBESW_MBESW85(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW85_SHIFT)) & STCU_MBESW_MBESW85_MASK)

#define STCU_MBESW_MBESW86_MASK                  (0x400000U)
#define STCU_MBESW_MBESW86_SHIFT                 (22U)
#define STCU_MBESW_MBESW86_WIDTH                 (1U)
#define STCU_MBESW_MBESW86(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW86_SHIFT)) & STCU_MBESW_MBESW86_MASK)

#define STCU_MBESW_MBESW87_MASK                  (0x800000U)
#define STCU_MBESW_MBESW87_SHIFT                 (23U)
#define STCU_MBESW_MBESW87_WIDTH                 (1U)
#define STCU_MBESW_MBESW87(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW87_SHIFT)) & STCU_MBESW_MBESW87_MASK)

#define STCU_MBESW_MBESW88_MASK                  (0x1000000U)
#define STCU_MBESW_MBESW88_SHIFT                 (24U)
#define STCU_MBESW_MBESW88_WIDTH                 (1U)
#define STCU_MBESW_MBESW88(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW88_SHIFT)) & STCU_MBESW_MBESW88_MASK)

#define STCU_MBESW_MBESW89_MASK                  (0x2000000U)
#define STCU_MBESW_MBESW89_SHIFT                 (25U)
#define STCU_MBESW_MBESW89_WIDTH                 (1U)
#define STCU_MBESW_MBESW89(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW89_SHIFT)) & STCU_MBESW_MBESW89_MASK)

#define STCU_MBESW_MBESW90_MASK                  (0x4000000U)
#define STCU_MBESW_MBESW90_SHIFT                 (26U)
#define STCU_MBESW_MBESW90_WIDTH                 (1U)
#define STCU_MBESW_MBESW90(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW90_SHIFT)) & STCU_MBESW_MBESW90_MASK)

#define STCU_MBESW_MBESW91_MASK                  (0x8000000U)
#define STCU_MBESW_MBESW91_SHIFT                 (27U)
#define STCU_MBESW_MBESW91_WIDTH                 (1U)
#define STCU_MBESW_MBESW91(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW91_SHIFT)) & STCU_MBESW_MBESW91_MASK)

#define STCU_MBESW_MBESW92_MASK                  (0x10000000U)
#define STCU_MBESW_MBESW92_SHIFT                 (28U)
#define STCU_MBESW_MBESW92_WIDTH                 (1U)
#define STCU_MBESW_MBESW92(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW92_SHIFT)) & STCU_MBESW_MBESW92_MASK)

#define STCU_MBESW_MBESW93_MASK                  (0x20000000U)
#define STCU_MBESW_MBESW93_SHIFT                 (29U)
#define STCU_MBESW_MBESW93_WIDTH                 (1U)
#define STCU_MBESW_MBESW93(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW93_SHIFT)) & STCU_MBESW_MBESW93_MASK)

#define STCU_MBESW_MBESW94_MASK                  (0x40000000U)
#define STCU_MBESW_MBESW94_SHIFT                 (30U)
#define STCU_MBESW_MBESW94_WIDTH                 (1U)
#define STCU_MBESW_MBESW94(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW94_SHIFT)) & STCU_MBESW_MBESW94_MASK)

#define STCU_MBESW_MBESW95_MASK                  (0x80000000U)
#define STCU_MBESW_MBESW95_SHIFT                 (31U)
#define STCU_MBESW_MBESW95_WIDTH                 (1U)
#define STCU_MBESW_MBESW95(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW95_SHIFT)) & STCU_MBESW_MBESW95_MASK)

#define STCU_MBESW_MBESW96_MASK                  (0x1U)
#define STCU_MBESW_MBESW96_SHIFT                 (0U)
#define STCU_MBESW_MBESW96_WIDTH                 (1U)
#define STCU_MBESW_MBESW96(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW96_SHIFT)) & STCU_MBESW_MBESW96_MASK)

#define STCU_MBESW_MBESW97_MASK                  (0x2U)
#define STCU_MBESW_MBESW97_SHIFT                 (1U)
#define STCU_MBESW_MBESW97_WIDTH                 (1U)
#define STCU_MBESW_MBESW97(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW97_SHIFT)) & STCU_MBESW_MBESW97_MASK)

#define STCU_MBESW_MBESW98_MASK                  (0x4U)
#define STCU_MBESW_MBESW98_SHIFT                 (2U)
#define STCU_MBESW_MBESW98_WIDTH                 (1U)
#define STCU_MBESW_MBESW98(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW98_SHIFT)) & STCU_MBESW_MBESW98_MASK)

#define STCU_MBESW_MBESW99_MASK                  (0x8U)
#define STCU_MBESW_MBESW99_SHIFT                 (3U)
#define STCU_MBESW_MBESW99_WIDTH                 (1U)
#define STCU_MBESW_MBESW99(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW99_SHIFT)) & STCU_MBESW_MBESW99_MASK)

#define STCU_MBESW_MBESW100_MASK                 (0x10U)
#define STCU_MBESW_MBESW100_SHIFT                (4U)
#define STCU_MBESW_MBESW100_WIDTH                (1U)
#define STCU_MBESW_MBESW100(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW100_SHIFT)) & STCU_MBESW_MBESW100_MASK)

#define STCU_MBESW_MBESW101_MASK                 (0x20U)
#define STCU_MBESW_MBESW101_SHIFT                (5U)
#define STCU_MBESW_MBESW101_WIDTH                (1U)
#define STCU_MBESW_MBESW101(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW101_SHIFT)) & STCU_MBESW_MBESW101_MASK)

#define STCU_MBESW_MBESW102_MASK                 (0x40U)
#define STCU_MBESW_MBESW102_SHIFT                (6U)
#define STCU_MBESW_MBESW102_WIDTH                (1U)
#define STCU_MBESW_MBESW102(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW102_SHIFT)) & STCU_MBESW_MBESW102_MASK)

#define STCU_MBESW_MBESW103_MASK                 (0x80U)
#define STCU_MBESW_MBESW103_SHIFT                (7U)
#define STCU_MBESW_MBESW103_WIDTH                (1U)
#define STCU_MBESW_MBESW103(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW103_SHIFT)) & STCU_MBESW_MBESW103_MASK)

#define STCU_MBESW_MBESW104_MASK                 (0x100U)
#define STCU_MBESW_MBESW104_SHIFT                (8U)
#define STCU_MBESW_MBESW104_WIDTH                (1U)
#define STCU_MBESW_MBESW104(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW104_SHIFT)) & STCU_MBESW_MBESW104_MASK)

#define STCU_MBESW_MBESW105_MASK                 (0x200U)
#define STCU_MBESW_MBESW105_SHIFT                (9U)
#define STCU_MBESW_MBESW105_WIDTH                (1U)
#define STCU_MBESW_MBESW105(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW105_SHIFT)) & STCU_MBESW_MBESW105_MASK)

