zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBESW_MBESW106_MASK                 (0x400U)
#define STCU_MBESW_MBESW106_SHIFT                (10U)
#define STCU_MBESW_MBESW106_WIDTH                (1U)
#define STCU_MBESW_MBESW106(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW106_SHIFT)) & STCU_MBESW_MBESW106_MASK)

#define STCU_MBESW_MBESW107_MASK                 (0x800U)
#define STCU_MBESW_MBESW107_SHIFT                (11U)
#define STCU_MBESW_MBESW107_WIDTH                (1U)
#define STCU_MBESW_MBESW107(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW107_SHIFT)) & STCU_MBESW_MBESW107_MASK)

#define STCU_MBESW_MBESW108_MASK                 (0x1000U)
#define STCU_MBESW_MBESW108_SHIFT                (12U)
#define STCU_MBESW_MBESW108_WIDTH                (1U)
#define STCU_MBESW_MBESW108(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW108_SHIFT)) & STCU_MBESW_MBESW108_MASK)

#define STCU_MBESW_MBESW109_MASK                 (0x2000U)
#define STCU_MBESW_MBESW109_SHIFT                (13U)
#define STCU_MBESW_MBESW109_WIDTH                (1U)
#define STCU_MBESW_MBESW109(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW109_SHIFT)) & STCU_MBESW_MBESW109_MASK)

#define STCU_MBESW_MBESW110_MASK                 (0x4000U)
#define STCU_MBESW_MBESW110_SHIFT                (14U)
#define STCU_MBESW_MBESW110_WIDTH                (1U)
#define STCU_MBESW_MBESW110(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW110_SHIFT)) & STCU_MBESW_MBESW110_MASK)

#define STCU_MBESW_MBESW111_MASK                 (0x8000U)
#define STCU_MBESW_MBESW111_SHIFT                (15U)
#define STCU_MBESW_MBESW111_WIDTH                (1U)
#define STCU_MBESW_MBESW111(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW111_SHIFT)) & STCU_MBESW_MBESW111_MASK)

#define STCU_MBESW_MBESW112_MASK                 (0x10000U)
#define STCU_MBESW_MBESW112_SHIFT                (16U)
#define STCU_MBESW_MBESW112_WIDTH                (1U)
#define STCU_MBESW_MBESW112(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW112_SHIFT)) & STCU_MBESW_MBESW112_MASK)

#define STCU_MBESW_MBESW113_MASK                 (0x20000U)
#define STCU_MBESW_MBESW113_SHIFT                (17U)
#define STCU_MBESW_MBESW113_WIDTH                (1U)
#define STCU_MBESW_MBESW113(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW113_SHIFT)) & STCU_MBESW_MBESW113_MASK)

#define STCU_MBESW_MBESW114_MASK                 (0x40000U)
#define STCU_MBESW_MBESW114_SHIFT                (18U)
#define STCU_MBESW_MBESW114_WIDTH                (1U)
#define STCU_MBESW_MBESW114(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW114_SHIFT)) & STCU_MBESW_MBESW114_MASK)

#define STCU_MBESW_MBESW115_MASK                 (0x80000U)
#define STCU_MBESW_MBESW115_SHIFT                (19U)
#define STCU_MBESW_MBESW115_WIDTH                (1U)
#define STCU_MBESW_MBESW115(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW115_SHIFT)) & STCU_MBESW_MBESW115_MASK)

#define STCU_MBESW_MBESW116_MASK                 (0x100000U)
#define STCU_MBESW_MBESW116_SHIFT                (20U)
#define STCU_MBESW_MBESW116_WIDTH                (1U)
#define STCU_MBESW_MBESW116(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW116_SHIFT)) & STCU_MBESW_MBESW116_MASK)

#define STCU_MBESW_MBESW117_MASK                 (0x200000U)
#define STCU_MBESW_MBESW117_SHIFT                (21U)
#define STCU_MBESW_MBESW117_WIDTH                (1U)
#define STCU_MBESW_MBESW117(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW117_SHIFT)) & STCU_MBESW_MBESW117_MASK)

#define STCU_MBESW_MBESW118_MASK                 (0x400000U)
#define STCU_MBESW_MBESW118_SHIFT                (22U)
#define STCU_MBESW_MBESW118_WIDTH                (1U)
#define STCU_MBESW_MBESW118(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW118_SHIFT)) & STCU_MBESW_MBESW118_MASK)

#define STCU_MBESW_MBESW119_MASK                 (0x800000U)
#define STCU_MBESW_MBESW119_SHIFT                (23U)
#define STCU_MBESW_MBESW119_WIDTH                (1U)
#define STCU_MBESW_MBESW119(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW119_SHIFT)) & STCU_MBESW_MBESW119_MASK)

#define STCU_MBESW_MBESW120_MASK                 (0x1000000U)
#define STCU_MBESW_MBESW120_SHIFT                (24U)
#define STCU_MBESW_MBESW120_WIDTH                (1U)
#define STCU_MBESW_MBESW120(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW120_SHIFT)) & STCU_MBESW_MBESW120_MASK)

#define STCU_MBESW_MBESW121_MASK                 (0x2000000U)
#define STCU_MBESW_MBESW121_SHIFT                (25U)
#define STCU_MBESW_MBESW121_WIDTH                (1U)
#define STCU_MBESW_MBESW121(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW121_SHIFT)) & STCU_MBESW_MBESW121_MASK)

#define STCU_MBESW_MBESW122_MASK                 (0x4000000U)
#define STCU_MBESW_MBESW122_SHIFT                (26U)
#define STCU_MBESW_MBESW122_WIDTH                (1U)
#define STCU_MBESW_MBESW122(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW122_SHIFT)) & STCU_MBESW_MBESW122_MASK)

#define STCU_MBESW_MBESW123_MASK                 (0x8000000U)
#define STCU_MBESW_MBESW123_SHIFT                (27U)
#define STCU_MBESW_MBESW123_WIDTH                (1U)
#define STCU_MBESW_MBESW123(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW123_SHIFT)) & STCU_MBESW_MBESW123_MASK)

#define STCU_MBESW_MBESW124_MASK                 (0x10000000U)
#define STCU_MBESW_MBESW124_SHIFT                (28U)
#define STCU_MBESW_MBESW124_WIDTH                (1U)
#define STCU_MBESW_MBESW124(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW124_SHIFT)) & STCU_MBESW_MBESW124_MASK)

#define STCU_MBESW_MBESW125_MASK                 (0x20000000U)
#define STCU_MBESW_MBESW125_SHIFT                (29U)
#define STCU_MBESW_MBESW125_WIDTH                (1U)
#define STCU_MBESW_MBESW125(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW125_SHIFT)) & STCU_MBESW_MBESW125_MASK)

