zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBESW_MBESW126_MASK                 (0x40000000U)
#define STCU_MBESW_MBESW126_SHIFT                (30U)
#define STCU_MBESW_MBESW126_WIDTH                (1U)
#define STCU_MBESW_MBESW126(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW126_SHIFT)) & STCU_MBESW_MBESW126_MASK)

#define STCU_MBESW_MBESW127_MASK                 (0x80000000U)
#define STCU_MBESW_MBESW127_SHIFT                (31U)
#define STCU_MBESW_MBESW127_WIDTH                (1U)
#define STCU_MBESW_MBESW127(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW127_SHIFT)) & STCU_MBESW_MBESW127_MASK)

#define STCU_MBESW_MBESW128_MASK                 (0x1U)
#define STCU_MBESW_MBESW128_SHIFT                (0U)
#define STCU_MBESW_MBESW128_WIDTH                (1U)
#define STCU_MBESW_MBESW128(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW128_SHIFT)) & STCU_MBESW_MBESW128_MASK)

#define STCU_MBESW_MBESW129_MASK                 (0x2U)
#define STCU_MBESW_MBESW129_SHIFT                (1U)
#define STCU_MBESW_MBESW129_WIDTH                (1U)
#define STCU_MBESW_MBESW129(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW129_SHIFT)) & STCU_MBESW_MBESW129_MASK)

#define STCU_MBESW_MBESW130_MASK                 (0x4U)
#define STCU_MBESW_MBESW130_SHIFT                (2U)
#define STCU_MBESW_MBESW130_WIDTH                (1U)
#define STCU_MBESW_MBESW130(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW130_SHIFT)) & STCU_MBESW_MBESW130_MASK)

#define STCU_MBESW_MBESW131_MASK                 (0x8U)
#define STCU_MBESW_MBESW131_SHIFT                (3U)
#define STCU_MBESW_MBESW131_WIDTH                (1U)
#define STCU_MBESW_MBESW131(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW131_SHIFT)) & STCU_MBESW_MBESW131_MASK)

#define STCU_MBESW_MBESW132_MASK                 (0x10U)
#define STCU_MBESW_MBESW132_SHIFT                (4U)
#define STCU_MBESW_MBESW132_WIDTH                (1U)
#define STCU_MBESW_MBESW132(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW132_SHIFT)) & STCU_MBESW_MBESW132_MASK)

#define STCU_MBESW_MBESW133_MASK                 (0x20U)
#define STCU_MBESW_MBESW133_SHIFT                (5U)
#define STCU_MBESW_MBESW133_WIDTH                (1U)
#define STCU_MBESW_MBESW133(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW133_SHIFT)) & STCU_MBESW_MBESW133_MASK)

#define STCU_MBESW_MBESW134_MASK                 (0x40U)
#define STCU_MBESW_MBESW134_SHIFT                (6U)
#define STCU_MBESW_MBESW134_WIDTH                (1U)
#define STCU_MBESW_MBESW134(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW134_SHIFT)) & STCU_MBESW_MBESW134_MASK)

#define STCU_MBESW_MBESW135_MASK                 (0x80U)
#define STCU_MBESW_MBESW135_SHIFT                (7U)
#define STCU_MBESW_MBESW135_WIDTH                (1U)
#define STCU_MBESW_MBESW135(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW135_SHIFT)) & STCU_MBESW_MBESW135_MASK)

#define STCU_MBESW_MBESW136_MASK                 (0x100U)
#define STCU_MBESW_MBESW136_SHIFT                (8U)
#define STCU_MBESW_MBESW136_WIDTH                (1U)
#define STCU_MBESW_MBESW136(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW136_SHIFT)) & STCU_MBESW_MBESW136_MASK)

#define STCU_MBESW_MBESW137_MASK                 (0x200U)
#define STCU_MBESW_MBESW137_SHIFT                (9U)
#define STCU_MBESW_MBESW137_WIDTH                (1U)
#define STCU_MBESW_MBESW137(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW137_SHIFT)) & STCU_MBESW_MBESW137_MASK)

#define STCU_MBESW_MBESW138_MASK                 (0x400U)
#define STCU_MBESW_MBESW138_SHIFT                (10U)
#define STCU_MBESW_MBESW138_WIDTH                (1U)
#define STCU_MBESW_MBESW138(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW138_SHIFT)) & STCU_MBESW_MBESW138_MASK)

#define STCU_MBESW_MBESW139_MASK                 (0x800U)
#define STCU_MBESW_MBESW139_SHIFT                (11U)
#define STCU_MBESW_MBESW139_WIDTH                (1U)
#define STCU_MBESW_MBESW139(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW139_SHIFT)) & STCU_MBESW_MBESW139_MASK)

#define STCU_MBESW_MBESW140_MASK                 (0x1000U)
#define STCU_MBESW_MBESW140_SHIFT                (12U)
#define STCU_MBESW_MBESW140_WIDTH                (1U)
#define STCU_MBESW_MBESW140(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW140_SHIFT)) & STCU_MBESW_MBESW140_MASK)

#define STCU_MBESW_MBESW141_MASK                 (0x2000U)
#define STCU_MBESW_MBESW141_SHIFT                (13U)
#define STCU_MBESW_MBESW141_WIDTH                (1U)
#define STCU_MBESW_MBESW141(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW141_SHIFT)) & STCU_MBESW_MBESW141_MASK)

#define STCU_MBESW_MBESW142_MASK                 (0x4000U)
#define STCU_MBESW_MBESW142_SHIFT                (14U)
#define STCU_MBESW_MBESW142_WIDTH                (1U)
#define STCU_MBESW_MBESW142(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW142_SHIFT)) & STCU_MBESW_MBESW142_MASK)

#define STCU_MBESW_MBESW143_MASK                 (0x8000U)
#define STCU_MBESW_MBESW143_SHIFT                (15U)
#define STCU_MBESW_MBESW143_WIDTH                (1U)
#define STCU_MBESW_MBESW143(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW143_SHIFT)) & STCU_MBESW_MBESW143_MASK)

#define STCU_MBESW_MBESW144_MASK                 (0x10000U)
#define STCU_MBESW_MBESW144_SHIFT                (16U)
#define STCU_MBESW_MBESW144_WIDTH                (1U)
#define STCU_MBESW_MBESW144(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW144_SHIFT)) & STCU_MBESW_MBESW144_MASK)

#define STCU_MBESW_MBESW145_MASK                 (0x20000U)
#define STCU_MBESW_MBESW145_SHIFT                (17U)
#define STCU_MBESW_MBESW145_WIDTH                (1U)
#define STCU_MBESW_MBESW145(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW145_SHIFT)) & STCU_MBESW_MBESW145_MASK)

#define STCU_MBESW_MBESW146_MASK                 (0x40000U)
#define STCU_MBESW_MBESW146_SHIFT                (18U)
#define STCU_MBESW_MBESW146_WIDTH                (1U)
#define STCU_MBESW_MBESW146(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW146_SHIFT)) & STCU_MBESW_MBESW146_MASK)

#define STCU_MBESW_MBESW147_MASK                 (0x80000U)
#define STCU_MBESW_MBESW147_SHIFT                (19U)
#define STCU_MBESW_MBESW147_WIDTH                (1U)
#define STCU_MBESW_MBESW147(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW147_SHIFT)) & STCU_MBESW_MBESW147_MASK)

