zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBESW_MBESW148_MASK                 (0x100000U)
#define STCU_MBESW_MBESW148_SHIFT                (20U)
#define STCU_MBESW_MBESW148_WIDTH                (1U)
#define STCU_MBESW_MBESW148(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW148_SHIFT)) & STCU_MBESW_MBESW148_MASK)

#define STCU_MBESW_MBESW149_MASK                 (0x200000U)
#define STCU_MBESW_MBESW149_SHIFT                (21U)
#define STCU_MBESW_MBESW149_WIDTH                (1U)
#define STCU_MBESW_MBESW149(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW149_SHIFT)) & STCU_MBESW_MBESW149_MASK)

#define STCU_MBESW_MBESW150_MASK                 (0x400000U)
#define STCU_MBESW_MBESW150_SHIFT                (22U)
#define STCU_MBESW_MBESW150_WIDTH                (1U)
#define STCU_MBESW_MBESW150(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW150_SHIFT)) & STCU_MBESW_MBESW150_MASK)

#define STCU_MBESW_MBESW151_MASK                 (0x800000U)
#define STCU_MBESW_MBESW151_SHIFT                (23U)
#define STCU_MBESW_MBESW151_WIDTH                (1U)
#define STCU_MBESW_MBESW151(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW151_SHIFT)) & STCU_MBESW_MBESW151_MASK)

#define STCU_MBESW_MBESW152_MASK                 (0x1000000U)
#define STCU_MBESW_MBESW152_SHIFT                (24U)
#define STCU_MBESW_MBESW152_WIDTH                (1U)
#define STCU_MBESW_MBESW152(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW152_SHIFT)) & STCU_MBESW_MBESW152_MASK)

#define STCU_MBESW_MBESW153_MASK                 (0x2000000U)
#define STCU_MBESW_MBESW153_SHIFT                (25U)
#define STCU_MBESW_MBESW153_WIDTH                (1U)
#define STCU_MBESW_MBESW153(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW153_SHIFT)) & STCU_MBESW_MBESW153_MASK)

#define STCU_MBESW_MBESW154_MASK                 (0x4000000U)
#define STCU_MBESW_MBESW154_SHIFT                (26U)
#define STCU_MBESW_MBESW154_WIDTH                (1U)
#define STCU_MBESW_MBESW154(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW154_SHIFT)) & STCU_MBESW_MBESW154_MASK)

#define STCU_MBESW_MBESW155_MASK                 (0x8000000U)
#define STCU_MBESW_MBESW155_SHIFT                (27U)
#define STCU_MBESW_MBESW155_WIDTH                (1U)
#define STCU_MBESW_MBESW155(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW155_SHIFT)) & STCU_MBESW_MBESW155_MASK)

#define STCU_MBESW_MBESW156_MASK                 (0x10000000U)
#define STCU_MBESW_MBESW156_SHIFT                (28U)
#define STCU_MBESW_MBESW156_WIDTH                (1U)
#define STCU_MBESW_MBESW156(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW156_SHIFT)) & STCU_MBESW_MBESW156_MASK)

#define STCU_MBESW_MBESW157_MASK                 (0x20000000U)
#define STCU_MBESW_MBESW157_SHIFT                (29U)
#define STCU_MBESW_MBESW157_WIDTH                (1U)
#define STCU_MBESW_MBESW157(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW157_SHIFT)) & STCU_MBESW_MBESW157_MASK)

#define STCU_MBESW_MBESW158_MASK                 (0x40000000U)
#define STCU_MBESW_MBESW158_SHIFT                (30U)
#define STCU_MBESW_MBESW158_WIDTH                (1U)
#define STCU_MBESW_MBESW158(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW158_SHIFT)) & STCU_MBESW_MBESW158_MASK)

#define STCU_MBESW_MBESW159_MASK                 (0x80000000U)
#define STCU_MBESW_MBESW159_SHIFT                (31U)
#define STCU_MBESW_MBESW159_WIDTH                (1U)
#define STCU_MBESW_MBESW159(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW159_SHIFT)) & STCU_MBESW_MBESW159_MASK)

#define STCU_MBESW_MBESW160_MASK                 (0x1U)
#define STCU_MBESW_MBESW160_SHIFT                (0U)
#define STCU_MBESW_MBESW160_WIDTH                (1U)
#define STCU_MBESW_MBESW160(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW160_SHIFT)) & STCU_MBESW_MBESW160_MASK)

#define STCU_MBESW_MBESW161_MASK                 (0x2U)
#define STCU_MBESW_MBESW161_SHIFT                (1U)
#define STCU_MBESW_MBESW161_WIDTH                (1U)
#define STCU_MBESW_MBESW161(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW161_SHIFT)) & STCU_MBESW_MBESW161_MASK)

#define STCU_MBESW_MBESW162_MASK                 (0x4U)
#define STCU_MBESW_MBESW162_SHIFT                (2U)
#define STCU_MBESW_MBESW162_WIDTH                (1U)
#define STCU_MBESW_MBESW162(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW162_SHIFT)) & STCU_MBESW_MBESW162_MASK)

#define STCU_MBESW_MBESW163_MASK                 (0x8U)
#define STCU_MBESW_MBESW163_SHIFT                (3U)
#define STCU_MBESW_MBESW163_WIDTH                (1U)
#define STCU_MBESW_MBESW163(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW163_SHIFT)) & STCU_MBESW_MBESW163_MASK)

#define STCU_MBESW_MBESW164_MASK                 (0x10U)
#define STCU_MBESW_MBESW164_SHIFT                (4U)
#define STCU_MBESW_MBESW164_WIDTH                (1U)
#define STCU_MBESW_MBESW164(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW164_SHIFT)) & STCU_MBESW_MBESW164_MASK)

#define STCU_MBESW_MBESW165_MASK                 (0x20U)
#define STCU_MBESW_MBESW165_SHIFT                (5U)
#define STCU_MBESW_MBESW165_WIDTH                (1U)
#define STCU_MBESW_MBESW165(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW165_SHIFT)) & STCU_MBESW_MBESW165_MASK)

#define STCU_MBESW_MBESW166_MASK                 (0x40U)
#define STCU_MBESW_MBESW166_SHIFT                (6U)
#define STCU_MBESW_MBESW166_WIDTH                (1U)
#define STCU_MBESW_MBESW166(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW166_SHIFT)) & STCU_MBESW_MBESW166_MASK)

#define STCU_MBESW_MBESW167_MASK                 (0x80U)
#define STCU_MBESW_MBESW167_SHIFT                (7U)
#define STCU_MBESW_MBESW167_WIDTH                (1U)
#define STCU_MBESW_MBESW167(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW167_SHIFT)) & STCU_MBESW_MBESW167_MASK)

#define STCU_MBESW_MBESW168_MASK                 (0x100U)
#define STCU_MBESW_MBESW168_SHIFT                (8U)
#define STCU_MBESW_MBESW168_WIDTH                (1U)
#define STCU_MBESW_MBESW168(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW168_SHIFT)) & STCU_MBESW_MBESW168_MASK)

