zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBESW_MBESW169_MASK                 (0x200U)
#define STCU_MBESW_MBESW169_SHIFT                (9U)
#define STCU_MBESW_MBESW169_WIDTH                (1U)
#define STCU_MBESW_MBESW169(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW169_SHIFT)) & STCU_MBESW_MBESW169_MASK)

#define STCU_MBESW_MBESW170_MASK                 (0x400U)
#define STCU_MBESW_MBESW170_SHIFT                (10U)
#define STCU_MBESW_MBESW170_WIDTH                (1U)
#define STCU_MBESW_MBESW170(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW170_SHIFT)) & STCU_MBESW_MBESW170_MASK)

#define STCU_MBESW_MBESW171_MASK                 (0x800U)
#define STCU_MBESW_MBESW171_SHIFT                (11U)
#define STCU_MBESW_MBESW171_WIDTH                (1U)
#define STCU_MBESW_MBESW171(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW171_SHIFT)) & STCU_MBESW_MBESW171_MASK)

#define STCU_MBESW_MBESW172_MASK                 (0x1000U)
#define STCU_MBESW_MBESW172_SHIFT                (12U)
#define STCU_MBESW_MBESW172_WIDTH                (1U)
#define STCU_MBESW_MBESW172(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW172_SHIFT)) & STCU_MBESW_MBESW172_MASK)

#define STCU_MBESW_MBESW173_MASK                 (0x2000U)
#define STCU_MBESW_MBESW173_SHIFT                (13U)
#define STCU_MBESW_MBESW173_WIDTH                (1U)
#define STCU_MBESW_MBESW173(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW173_SHIFT)) & STCU_MBESW_MBESW173_MASK)

#define STCU_MBESW_MBESW174_MASK                 (0x4000U)
#define STCU_MBESW_MBESW174_SHIFT                (14U)
#define STCU_MBESW_MBESW174_WIDTH                (1U)
#define STCU_MBESW_MBESW174(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW174_SHIFT)) & STCU_MBESW_MBESW174_MASK)

#define STCU_MBESW_MBESW175_MASK                 (0x8000U)
#define STCU_MBESW_MBESW175_SHIFT                (15U)
#define STCU_MBESW_MBESW175_WIDTH                (1U)
#define STCU_MBESW_MBESW175(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW175_SHIFT)) & STCU_MBESW_MBESW175_MASK)

#define STCU_MBESW_MBESW176_MASK                 (0x10000U)
#define STCU_MBESW_MBESW176_SHIFT                (16U)
#define STCU_MBESW_MBESW176_WIDTH                (1U)
#define STCU_MBESW_MBESW176(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW176_SHIFT)) & STCU_MBESW_MBESW176_MASK)

#define STCU_MBESW_MBESW177_MASK                 (0x20000U)
#define STCU_MBESW_MBESW177_SHIFT                (17U)
#define STCU_MBESW_MBESW177_WIDTH                (1U)
#define STCU_MBESW_MBESW177(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW177_SHIFT)) & STCU_MBESW_MBESW177_MASK)

#define STCU_MBESW_MBESW178_MASK                 (0x40000U)
#define STCU_MBESW_MBESW178_SHIFT                (18U)
#define STCU_MBESW_MBESW178_WIDTH                (1U)
#define STCU_MBESW_MBESW178(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW178_SHIFT)) & STCU_MBESW_MBESW178_MASK)

#define STCU_MBESW_MBESW179_MASK                 (0x80000U)
#define STCU_MBESW_MBESW179_SHIFT                (19U)
#define STCU_MBESW_MBESW179_WIDTH                (1U)
#define STCU_MBESW_MBESW179(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW179_SHIFT)) & STCU_MBESW_MBESW179_MASK)

#define STCU_MBESW_MBESW180_MASK                 (0x100000U)
#define STCU_MBESW_MBESW180_SHIFT                (20U)
#define STCU_MBESW_MBESW180_WIDTH                (1U)
#define STCU_MBESW_MBESW180(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW180_SHIFT)) & STCU_MBESW_MBESW180_MASK)

#define STCU_MBESW_MBESW181_MASK                 (0x200000U)
#define STCU_MBESW_MBESW181_SHIFT                (21U)
#define STCU_MBESW_MBESW181_WIDTH                (1U)
#define STCU_MBESW_MBESW181(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW181_SHIFT)) & STCU_MBESW_MBESW181_MASK)

#define STCU_MBESW_MBESW182_MASK                 (0x400000U)
#define STCU_MBESW_MBESW182_SHIFT                (22U)
#define STCU_MBESW_MBESW182_WIDTH                (1U)
#define STCU_MBESW_MBESW182(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW182_SHIFT)) & STCU_MBESW_MBESW182_MASK)

#define STCU_MBESW_MBESW183_MASK                 (0x800000U)
#define STCU_MBESW_MBESW183_SHIFT                (23U)
#define STCU_MBESW_MBESW183_WIDTH                (1U)
#define STCU_MBESW_MBESW183(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW183_SHIFT)) & STCU_MBESW_MBESW183_MASK)

#define STCU_MBESW_MBESW184_MASK                 (0x1000000U)
#define STCU_MBESW_MBESW184_SHIFT                (24U)
#define STCU_MBESW_MBESW184_WIDTH                (1U)
#define STCU_MBESW_MBESW184(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW184_SHIFT)) & STCU_MBESW_MBESW184_MASK)

#define STCU_MBESW_MBESW185_MASK                 (0x2000000U)
#define STCU_MBESW_MBESW185_SHIFT                (25U)
#define STCU_MBESW_MBESW185_WIDTH                (1U)
#define STCU_MBESW_MBESW185(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW185_SHIFT)) & STCU_MBESW_MBESW185_MASK)

#define STCU_MBESW_MBESW186_MASK                 (0x4000000U)
#define STCU_MBESW_MBESW186_SHIFT                (26U)
#define STCU_MBESW_MBESW186_WIDTH                (1U)
#define STCU_MBESW_MBESW186(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW186_SHIFT)) & STCU_MBESW_MBESW186_MASK)

#define STCU_MBESW_MBESW187_MASK                 (0x8000000U)
#define STCU_MBESW_MBESW187_SHIFT                (27U)
#define STCU_MBESW_MBESW187_WIDTH                (1U)
#define STCU_MBESW_MBESW187(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW187_SHIFT)) & STCU_MBESW_MBESW187_MASK)

#define STCU_MBESW_MBESW188_MASK                 (0x10000000U)
#define STCU_MBESW_MBESW188_SHIFT                (28U)
#define STCU_MBESW_MBESW188_WIDTH                (1U)
#define STCU_MBESW_MBESW188(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW188_SHIFT)) & STCU_MBESW_MBESW188_MASK)

#define STCU_MBESW_MBESW189_MASK                 (0x20000000U)
#define STCU_MBESW_MBESW189_SHIFT                (29U)
#define STCU_MBESW_MBESW189_WIDTH                (1U)
#define STCU_MBESW_MBESW189(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW189_SHIFT)) & STCU_MBESW_MBESW189_MASK)

#define STCU_MBESW_MBESW190_MASK                 (0x40000000U)
#define STCU_MBESW_MBESW190_SHIFT                (30U)
#define STCU_MBESW_MBESW190_WIDTH                (1U)
#define STCU_MBESW_MBESW190(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW190_SHIFT)) & STCU_MBESW_MBESW190_MASK)

#define STCU_MBESW_MBESW191_MASK                 (0x80000000U)
#define STCU_MBESW_MBESW191_SHIFT                (31U)
#define STCU_MBESW_MBESW191_WIDTH                (1U)
#define STCU_MBESW_MBESW191(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW191_SHIFT)) & STCU_MBESW_MBESW191_MASK)

#define STCU_MBESW_MBESW192_MASK                 (0x1U)
#define STCU_MBESW_MBESW192_SHIFT                (0U)
#define STCU_MBESW_MBESW192_WIDTH                (1U)
#define STCU_MBESW_MBESW192(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW192_SHIFT)) & STCU_MBESW_MBESW192_MASK)

