zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBESW_MBESW193_MASK                 (0x2U)
#define STCU_MBESW_MBESW193_SHIFT                (1U)
#define STCU_MBESW_MBESW193_WIDTH                (1U)
#define STCU_MBESW_MBESW193(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW193_SHIFT)) & STCU_MBESW_MBESW193_MASK)

#define STCU_MBESW_MBESW194_MASK                 (0x4U)
#define STCU_MBESW_MBESW194_SHIFT                (2U)
#define STCU_MBESW_MBESW194_WIDTH                (1U)
#define STCU_MBESW_MBESW194(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW194_SHIFT)) & STCU_MBESW_MBESW194_MASK)

#define STCU_MBESW_MBESW195_MASK                 (0x8U)
#define STCU_MBESW_MBESW195_SHIFT                (3U)
#define STCU_MBESW_MBESW195_WIDTH                (1U)
#define STCU_MBESW_MBESW195(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW195_SHIFT)) & STCU_MBESW_MBESW195_MASK)

#define STCU_MBESW_MBESW196_MASK                 (0x10U)
#define STCU_MBESW_MBESW196_SHIFT                (4U)
#define STCU_MBESW_MBESW196_WIDTH                (1U)
#define STCU_MBESW_MBESW196(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW196_SHIFT)) & STCU_MBESW_MBESW196_MASK)

#define STCU_MBESW_MBESW197_MASK                 (0x20U)
#define STCU_MBESW_MBESW197_SHIFT                (5U)
#define STCU_MBESW_MBESW197_WIDTH                (1U)
#define STCU_MBESW_MBESW197(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW197_SHIFT)) & STCU_MBESW_MBESW197_MASK)

#define STCU_MBESW_MBESW198_MASK                 (0x40U)
#define STCU_MBESW_MBESW198_SHIFT                (6U)
#define STCU_MBESW_MBESW198_WIDTH                (1U)
#define STCU_MBESW_MBESW198(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW198_SHIFT)) & STCU_MBESW_MBESW198_MASK)

#define STCU_MBESW_MBESW199_MASK                 (0x80U)
#define STCU_MBESW_MBESW199_SHIFT                (7U)
#define STCU_MBESW_MBESW199_WIDTH                (1U)
#define STCU_MBESW_MBESW199(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW199_SHIFT)) & STCU_MBESW_MBESW199_MASK)

#define STCU_MBESW_MBESW200_MASK                 (0x100U)
#define STCU_MBESW_MBESW200_SHIFT                (8U)
#define STCU_MBESW_MBESW200_WIDTH                (1U)
#define STCU_MBESW_MBESW200(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW200_SHIFT)) & STCU_MBESW_MBESW200_MASK)

#define STCU_MBESW_MBESW201_MASK                 (0x200U)
#define STCU_MBESW_MBESW201_SHIFT                (9U)
#define STCU_MBESW_MBESW201_WIDTH                (1U)
#define STCU_MBESW_MBESW201(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW201_SHIFT)) & STCU_MBESW_MBESW201_MASK)

#define STCU_MBESW_MBESW202_MASK                 (0x400U)
#define STCU_MBESW_MBESW202_SHIFT                (10U)
#define STCU_MBESW_MBESW202_WIDTH                (1U)
#define STCU_MBESW_MBESW202(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW202_SHIFT)) & STCU_MBESW_MBESW202_MASK)

#define STCU_MBESW_MBESW203_MASK                 (0x800U)
#define STCU_MBESW_MBESW203_SHIFT                (11U)
#define STCU_MBESW_MBESW203_WIDTH                (1U)
#define STCU_MBESW_MBESW203(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW203_SHIFT)) & STCU_MBESW_MBESW203_MASK)

#define STCU_MBESW_MBESW204_MASK                 (0x1000U)
#define STCU_MBESW_MBESW204_SHIFT                (12U)
#define STCU_MBESW_MBESW204_WIDTH                (1U)
#define STCU_MBESW_MBESW204(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW204_SHIFT)) & STCU_MBESW_MBESW204_MASK)

#define STCU_MBESW_MBESW205_MASK                 (0x2000U)
#define STCU_MBESW_MBESW205_SHIFT                (13U)
#define STCU_MBESW_MBESW205_WIDTH                (1U)
#define STCU_MBESW_MBESW205(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW205_SHIFT)) & STCU_MBESW_MBESW205_MASK)

#define STCU_MBESW_MBESW206_MASK                 (0x4000U)
#define STCU_MBESW_MBESW206_SHIFT                (14U)
#define STCU_MBESW_MBESW206_WIDTH                (1U)
#define STCU_MBESW_MBESW206(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW206_SHIFT)) & STCU_MBESW_MBESW206_MASK)

#define STCU_MBESW_MBESW207_MASK                 (0x8000U)
#define STCU_MBESW_MBESW207_SHIFT                (15U)
#define STCU_MBESW_MBESW207_WIDTH                (1U)
#define STCU_MBESW_MBESW207(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW207_SHIFT)) & STCU_MBESW_MBESW207_MASK)

#define STCU_MBESW_MBESW208_MASK                 (0x10000U)
#define STCU_MBESW_MBESW208_SHIFT                (16U)
#define STCU_MBESW_MBESW208_WIDTH                (1U)
#define STCU_MBESW_MBESW208(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW208_SHIFT)) & STCU_MBESW_MBESW208_MASK)

#define STCU_MBESW_MBESW209_MASK                 (0x20000U)
#define STCU_MBESW_MBESW209_SHIFT                (17U)
#define STCU_MBESW_MBESW209_WIDTH                (1U)
#define STCU_MBESW_MBESW209(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW209_SHIFT)) & STCU_MBESW_MBESW209_MASK)

#define STCU_MBESW_MBESW210_MASK                 (0x40000U)
#define STCU_MBESW_MBESW210_SHIFT                (18U)
#define STCU_MBESW_MBESW210_WIDTH                (1U)
#define STCU_MBESW_MBESW210(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW210_SHIFT)) & STCU_MBESW_MBESW210_MASK)

#define STCU_MBESW_MBESW211_MASK                 (0x80000U)
#define STCU_MBESW_MBESW211_SHIFT                (19U)
#define STCU_MBESW_MBESW211_WIDTH                (1U)
#define STCU_MBESW_MBESW211(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW211_SHIFT)) & STCU_MBESW_MBESW211_MASK)

#define STCU_MBESW_MBESW212_MASK                 (0x100000U)
#define STCU_MBESW_MBESW212_SHIFT                (20U)
#define STCU_MBESW_MBESW212_WIDTH                (1U)
#define STCU_MBESW_MBESW212(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW212_SHIFT)) & STCU_MBESW_MBESW212_MASK)

