zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBESW_MBESW213_MASK                 (0x200000U)
#define STCU_MBESW_MBESW213_SHIFT                (21U)
#define STCU_MBESW_MBESW213_WIDTH                (1U)
#define STCU_MBESW_MBESW213(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW213_SHIFT)) & STCU_MBESW_MBESW213_MASK)

#define STCU_MBESW_MBESW214_MASK                 (0x400000U)
#define STCU_MBESW_MBESW214_SHIFT                (22U)
#define STCU_MBESW_MBESW214_WIDTH                (1U)
#define STCU_MBESW_MBESW214(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW214_SHIFT)) & STCU_MBESW_MBESW214_MASK)

#define STCU_MBESW_MBESW215_MASK                 (0x800000U)
#define STCU_MBESW_MBESW215_SHIFT                (23U)
#define STCU_MBESW_MBESW215_WIDTH                (1U)
#define STCU_MBESW_MBESW215(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW215_SHIFT)) & STCU_MBESW_MBESW215_MASK)

#define STCU_MBESW_MBESW216_MASK                 (0x1000000U)
#define STCU_MBESW_MBESW216_SHIFT                (24U)
#define STCU_MBESW_MBESW216_WIDTH                (1U)
#define STCU_MBESW_MBESW216(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW216_SHIFT)) & STCU_MBESW_MBESW216_MASK)

#define STCU_MBESW_MBESW217_MASK                 (0x2000000U)
#define STCU_MBESW_MBESW217_SHIFT                (25U)
#define STCU_MBESW_MBESW217_WIDTH                (1U)
#define STCU_MBESW_MBESW217(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW217_SHIFT)) & STCU_MBESW_MBESW217_MASK)

#define STCU_MBESW_MBESW218_MASK                 (0x4000000U)
#define STCU_MBESW_MBESW218_SHIFT                (26U)
#define STCU_MBESW_MBESW218_WIDTH                (1U)
#define STCU_MBESW_MBESW218(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW218_SHIFT)) & STCU_MBESW_MBESW218_MASK)

#define STCU_MBESW_MBESW219_MASK                 (0x8000000U)
#define STCU_MBESW_MBESW219_SHIFT                (27U)
#define STCU_MBESW_MBESW219_WIDTH                (1U)
#define STCU_MBESW_MBESW219(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW219_SHIFT)) & STCU_MBESW_MBESW219_MASK)

#define STCU_MBESW_MBESW220_MASK                 (0x10000000U)
#define STCU_MBESW_MBESW220_SHIFT                (28U)
#define STCU_MBESW_MBESW220_WIDTH                (1U)
#define STCU_MBESW_MBESW220(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW220_SHIFT)) & STCU_MBESW_MBESW220_MASK)

#define STCU_MBESW_MBESW221_MASK                 (0x20000000U)
#define STCU_MBESW_MBESW221_SHIFT                (29U)
#define STCU_MBESW_MBESW221_WIDTH                (1U)
#define STCU_MBESW_MBESW221(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW221_SHIFT)) & STCU_MBESW_MBESW221_MASK)

#define STCU_MBESW_MBESW222_MASK                 (0x40000000U)
#define STCU_MBESW_MBESW222_SHIFT                (30U)
#define STCU_MBESW_MBESW222_WIDTH                (1U)
#define STCU_MBESW_MBESW222(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW222_SHIFT)) & STCU_MBESW_MBESW222_MASK)

#define STCU_MBESW_MBESW223_MASK                 (0x80000000U)
#define STCU_MBESW_MBESW223_SHIFT                (31U)
#define STCU_MBESW_MBESW223_WIDTH                (1U)
#define STCU_MBESW_MBESW223(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW223_SHIFT)) & STCU_MBESW_MBESW223_MASK)

#define STCU_MBESW_MBESW224_MASK                 (0x1U)
#define STCU_MBESW_MBESW224_SHIFT                (0U)
#define STCU_MBESW_MBESW224_WIDTH                (1U)
#define STCU_MBESW_MBESW224(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW224_SHIFT)) & STCU_MBESW_MBESW224_MASK)

#define STCU_MBESW_MBESW225_MASK                 (0x2U)
#define STCU_MBESW_MBESW225_SHIFT                (1U)
#define STCU_MBESW_MBESW225_WIDTH                (1U)
#define STCU_MBESW_MBESW225(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW225_SHIFT)) & STCU_MBESW_MBESW225_MASK)

#define STCU_MBESW_MBESW226_MASK                 (0x4U)
#define STCU_MBESW_MBESW226_SHIFT                (2U)
#define STCU_MBESW_MBESW226_WIDTH                (1U)
#define STCU_MBESW_MBESW226(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW226_SHIFT)) & STCU_MBESW_MBESW226_MASK)

#define STCU_MBESW_MBESW227_MASK                 (0x8U)
#define STCU_MBESW_MBESW227_SHIFT                (3U)
#define STCU_MBESW_MBESW227_WIDTH                (1U)
#define STCU_MBESW_MBESW227(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW227_SHIFT)) & STCU_MBESW_MBESW227_MASK)

#define STCU_MBESW_MBESW228_MASK                 (0x10U)
#define STCU_MBESW_MBESW228_SHIFT                (4U)
#define STCU_MBESW_MBESW228_WIDTH                (1U)
#define STCU_MBESW_MBESW228(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW228_SHIFT)) & STCU_MBESW_MBESW228_MASK)

#define STCU_MBESW_MBESW229_MASK                 (0x20U)
#define STCU_MBESW_MBESW229_SHIFT                (5U)
#define STCU_MBESW_MBESW229_WIDTH                (1U)
#define STCU_MBESW_MBESW229(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW229_SHIFT)) & STCU_MBESW_MBESW229_MASK)

#define STCU_MBESW_MBESW230_MASK                 (0x40U)
#define STCU_MBESW_MBESW230_SHIFT                (6U)
#define STCU_MBESW_MBESW230_WIDTH                (1U)
#define STCU_MBESW_MBESW230(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW230_SHIFT)) & STCU_MBESW_MBESW230_MASK)

#define STCU_MBESW_MBESW231_MASK                 (0x80U)
#define STCU_MBESW_MBESW231_SHIFT                (7U)
#define STCU_MBESW_MBESW231_WIDTH                (1U)
#define STCU_MBESW_MBESW231(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW231_SHIFT)) & STCU_MBESW_MBESW231_MASK)

#define STCU_MBESW_MBESW232_MASK                 (0x100U)
#define STCU_MBESW_MBESW232_SHIFT                (8U)
#define STCU_MBESW_MBESW232_WIDTH                (1U)
#define STCU_MBESW_MBESW232(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW232_SHIFT)) & STCU_MBESW_MBESW232_MASK)

#define STCU_MBESW_MBESW233_MASK                 (0x200U)
#define STCU_MBESW_MBESW233_SHIFT                (9U)
#define STCU_MBESW_MBESW233_WIDTH                (1U)
#define STCU_MBESW_MBESW233(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW233_SHIFT)) & STCU_MBESW_MBESW233_MASK)

