zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBESW_MBESW234_MASK                 (0x400U)
#define STCU_MBESW_MBESW234_SHIFT                (10U)
#define STCU_MBESW_MBESW234_WIDTH                (1U)
#define STCU_MBESW_MBESW234(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW234_SHIFT)) & STCU_MBESW_MBESW234_MASK)

#define STCU_MBESW_MBESW235_MASK                 (0x800U)
#define STCU_MBESW_MBESW235_SHIFT                (11U)
#define STCU_MBESW_MBESW235_WIDTH                (1U)
#define STCU_MBESW_MBESW235(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW235_SHIFT)) & STCU_MBESW_MBESW235_MASK)

#define STCU_MBESW_MBESW236_MASK                 (0x1000U)
#define STCU_MBESW_MBESW236_SHIFT                (12U)
#define STCU_MBESW_MBESW236_WIDTH                (1U)
#define STCU_MBESW_MBESW236(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW236_SHIFT)) & STCU_MBESW_MBESW236_MASK)

#define STCU_MBESW_MBESW237_MASK                 (0x2000U)
#define STCU_MBESW_MBESW237_SHIFT                (13U)
#define STCU_MBESW_MBESW237_WIDTH                (1U)
#define STCU_MBESW_MBESW237(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW237_SHIFT)) & STCU_MBESW_MBESW237_MASK)

#define STCU_MBESW_MBESW238_MASK                 (0x4000U)
#define STCU_MBESW_MBESW238_SHIFT                (14U)
#define STCU_MBESW_MBESW238_WIDTH                (1U)
#define STCU_MBESW_MBESW238(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW238_SHIFT)) & STCU_MBESW_MBESW238_MASK)

#define STCU_MBESW_MBESW239_MASK                 (0x8000U)
#define STCU_MBESW_MBESW239_SHIFT                (15U)
#define STCU_MBESW_MBESW239_WIDTH                (1U)
#define STCU_MBESW_MBESW239(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW239_SHIFT)) & STCU_MBESW_MBESW239_MASK)

#define STCU_MBESW_MBESW240_MASK                 (0x10000U)
#define STCU_MBESW_MBESW240_SHIFT                (16U)
#define STCU_MBESW_MBESW240_WIDTH                (1U)
#define STCU_MBESW_MBESW240(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW240_SHIFT)) & STCU_MBESW_MBESW240_MASK)

#define STCU_MBESW_MBESW241_MASK                 (0x20000U)
#define STCU_MBESW_MBESW241_SHIFT                (17U)
#define STCU_MBESW_MBESW241_WIDTH                (1U)
#define STCU_MBESW_MBESW241(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW241_SHIFT)) & STCU_MBESW_MBESW241_MASK)

#define STCU_MBESW_MBESW242_MASK                 (0x40000U)
#define STCU_MBESW_MBESW242_SHIFT                (18U)
#define STCU_MBESW_MBESW242_WIDTH                (1U)
#define STCU_MBESW_MBESW242(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW242_SHIFT)) & STCU_MBESW_MBESW242_MASK)

#define STCU_MBESW_MBESW243_MASK                 (0x80000U)
#define STCU_MBESW_MBESW243_SHIFT                (19U)
#define STCU_MBESW_MBESW243_WIDTH                (1U)
#define STCU_MBESW_MBESW243(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW243_SHIFT)) & STCU_MBESW_MBESW243_MASK)

#define STCU_MBESW_MBESW244_MASK                 (0x100000U)
#define STCU_MBESW_MBESW244_SHIFT                (20U)
#define STCU_MBESW_MBESW244_WIDTH                (1U)
#define STCU_MBESW_MBESW244(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW244_SHIFT)) & STCU_MBESW_MBESW244_MASK)

#define STCU_MBESW_MBESW245_MASK                 (0x200000U)
#define STCU_MBESW_MBESW245_SHIFT                (21U)
#define STCU_MBESW_MBESW245_WIDTH                (1U)
#define STCU_MBESW_MBESW245(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW245_SHIFT)) & STCU_MBESW_MBESW245_MASK)

#define STCU_MBESW_MBESW246_MASK                 (0x400000U)
#define STCU_MBESW_MBESW246_SHIFT                (22U)
#define STCU_MBESW_MBESW246_WIDTH                (1U)
#define STCU_MBESW_MBESW246(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW246_SHIFT)) & STCU_MBESW_MBESW246_MASK)

#define STCU_MBESW_MBESW247_MASK                 (0x800000U)
#define STCU_MBESW_MBESW247_SHIFT                (23U)
#define STCU_MBESW_MBESW247_WIDTH                (1U)
#define STCU_MBESW_MBESW247(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW247_SHIFT)) & STCU_MBESW_MBESW247_MASK)

#define STCU_MBESW_MBESW248_MASK                 (0x1000000U)
#define STCU_MBESW_MBESW248_SHIFT                (24U)
#define STCU_MBESW_MBESW248_WIDTH                (1U)
#define STCU_MBESW_MBESW248(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW248_SHIFT)) & STCU_MBESW_MBESW248_MASK)

#define STCU_MBESW_MBESW249_MASK                 (0x2000000U)
#define STCU_MBESW_MBESW249_SHIFT                (25U)
#define STCU_MBESW_MBESW249_WIDTH                (1U)
#define STCU_MBESW_MBESW249(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW249_SHIFT)) & STCU_MBESW_MBESW249_MASK)

#define STCU_MBESW_MBESW250_MASK                 (0x4000000U)
#define STCU_MBESW_MBESW250_SHIFT                (26U)
#define STCU_MBESW_MBESW250_WIDTH                (1U)
#define STCU_MBESW_MBESW250(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW250_SHIFT)) & STCU_MBESW_MBESW250_MASK)

#define STCU_MBESW_MBESW251_MASK                 (0x8000000U)
#define STCU_MBESW_MBESW251_SHIFT                (27U)
#define STCU_MBESW_MBESW251_WIDTH                (1U)
#define STCU_MBESW_MBESW251(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW251_SHIFT)) & STCU_MBESW_MBESW251_MASK)

#define STCU_MBESW_MBESW252_MASK                 (0x10000000U)
#define STCU_MBESW_MBESW252_SHIFT                (28U)
#define STCU_MBESW_MBESW252_WIDTH                (1U)
#define STCU_MBESW_MBESW252(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW252_SHIFT)) & STCU_MBESW_MBESW252_MASK)

#define STCU_MBESW_MBESW253_MASK                 (0x20000000U)
#define STCU_MBESW_MBESW253_SHIFT                (29U)
#define STCU_MBESW_MBESW253_WIDTH                (1U)
#define STCU_MBESW_MBESW253(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW253_SHIFT)) & STCU_MBESW_MBESW253_MASK)

#define STCU_MBESW_MBESW254_MASK                 (0x40000000U)
#define STCU_MBESW_MBESW254_SHIFT                (30U)
#define STCU_MBESW_MBESW254_WIDTH                (1U)
#define STCU_MBESW_MBESW254(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW254_SHIFT)) & STCU_MBESW_MBESW254_MASK)

