zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBESW_MBESW255_MASK                 (0x80000000U)
#define STCU_MBESW_MBESW255_SHIFT                (31U)
#define STCU_MBESW_MBESW255_WIDTH                (1U)
#define STCU_MBESW_MBESW255(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW_MBESW255_SHIFT)) & STCU_MBESW_MBESW255_MASK)
/*! @} */

/*! @name MBUFM - STCU2 MBIST Unrecoverable FM */
/*! @{ */

#define STCU_MBUFM_MBUFM0_MASK                   (0x1U)
#define STCU_MBUFM_MBUFM0_SHIFT                  (0U)
#define STCU_MBUFM_MBUFM0_WIDTH                  (1U)
#define STCU_MBUFM_MBUFM0(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM0_SHIFT)) & STCU_MBUFM_MBUFM0_MASK)

#define STCU_MBUFM_MBUFM1_MASK                   (0x2U)
#define STCU_MBUFM_MBUFM1_SHIFT                  (1U)
#define STCU_MBUFM_MBUFM1_WIDTH                  (1U)
#define STCU_MBUFM_MBUFM1(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM1_SHIFT)) & STCU_MBUFM_MBUFM1_MASK)

#define STCU_MBUFM_MBUFM2_MASK                   (0x4U)
#define STCU_MBUFM_MBUFM2_SHIFT                  (2U)
#define STCU_MBUFM_MBUFM2_WIDTH                  (1U)
#define STCU_MBUFM_MBUFM2(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM2_SHIFT)) & STCU_MBUFM_MBUFM2_MASK)

#define STCU_MBUFM_MBUFM3_MASK                   (0x8U)
#define STCU_MBUFM_MBUFM3_SHIFT                  (3U)
#define STCU_MBUFM_MBUFM3_WIDTH                  (1U)
#define STCU_MBUFM_MBUFM3(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM3_SHIFT)) & STCU_MBUFM_MBUFM3_MASK)

#define STCU_MBUFM_MBUFM4_MASK                   (0x10U)
#define STCU_MBUFM_MBUFM4_SHIFT                  (4U)
#define STCU_MBUFM_MBUFM4_WIDTH                  (1U)
#define STCU_MBUFM_MBUFM4(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM4_SHIFT)) & STCU_MBUFM_MBUFM4_MASK)

#define STCU_MBUFM_MBUFM5_MASK                   (0x20U)
#define STCU_MBUFM_MBUFM5_SHIFT                  (5U)
#define STCU_MBUFM_MBUFM5_WIDTH                  (1U)
#define STCU_MBUFM_MBUFM5(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM5_SHIFT)) & STCU_MBUFM_MBUFM5_MASK)

#define STCU_MBUFM_MBUFM6_MASK                   (0x40U)
#define STCU_MBUFM_MBUFM6_SHIFT                  (6U)
#define STCU_MBUFM_MBUFM6_WIDTH                  (1U)
#define STCU_MBUFM_MBUFM6(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM6_SHIFT)) & STCU_MBUFM_MBUFM6_MASK)

#define STCU_MBUFM_MBUFM7_MASK                   (0x80U)
#define STCU_MBUFM_MBUFM7_SHIFT                  (7U)
#define STCU_MBUFM_MBUFM7_WIDTH                  (1U)
#define STCU_MBUFM_MBUFM7(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM7_SHIFT)) & STCU_MBUFM_MBUFM7_MASK)

#define STCU_MBUFM_MBUFM8_MASK                   (0x100U)
#define STCU_MBUFM_MBUFM8_SHIFT                  (8U)
#define STCU_MBUFM_MBUFM8_WIDTH                  (1U)
#define STCU_MBUFM_MBUFM8(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM8_SHIFT)) & STCU_MBUFM_MBUFM8_MASK)

#define STCU_MBUFM_MBUFM9_MASK                   (0x200U)
#define STCU_MBUFM_MBUFM9_SHIFT                  (9U)
#define STCU_MBUFM_MBUFM9_WIDTH                  (1U)
#define STCU_MBUFM_MBUFM9(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM9_SHIFT)) & STCU_MBUFM_MBUFM9_MASK)

#define STCU_MBUFM_MBUFM10_MASK                  (0x400U)
#define STCU_MBUFM_MBUFM10_SHIFT                 (10U)
#define STCU_MBUFM_MBUFM10_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM10(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM10_SHIFT)) & STCU_MBUFM_MBUFM10_MASK)

#define STCU_MBUFM_MBUFM11_MASK                  (0x800U)
#define STCU_MBUFM_MBUFM11_SHIFT                 (11U)
#define STCU_MBUFM_MBUFM11_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM11(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM11_SHIFT)) & STCU_MBUFM_MBUFM11_MASK)

#define STCU_MBUFM_MBUFM12_MASK                  (0x1000U)
#define STCU_MBUFM_MBUFM12_SHIFT                 (12U)
#define STCU_MBUFM_MBUFM12_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM12(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM12_SHIFT)) & STCU_MBUFM_MBUFM12_MASK)

#define STCU_MBUFM_MBUFM13_MASK                  (0x2000U)
#define STCU_MBUFM_MBUFM13_SHIFT                 (13U)
#define STCU_MBUFM_MBUFM13_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM13(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM13_SHIFT)) & STCU_MBUFM_MBUFM13_MASK)

#define STCU_MBUFM_MBUFM14_MASK                  (0x4000U)
#define STCU_MBUFM_MBUFM14_SHIFT                 (14U)
#define STCU_MBUFM_MBUFM14_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM14(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM14_SHIFT)) & STCU_MBUFM_MBUFM14_MASK)

#define STCU_MBUFM_MBUFM15_MASK                  (0x8000U)
#define STCU_MBUFM_MBUFM15_SHIFT                 (15U)
#define STCU_MBUFM_MBUFM15_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM15(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM15_SHIFT)) & STCU_MBUFM_MBUFM15_MASK)

#define STCU_MBUFM_MBUFM16_MASK                  (0x10000U)
#define STCU_MBUFM_MBUFM16_SHIFT                 (16U)
#define STCU_MBUFM_MBUFM16_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM16(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM16_SHIFT)) & STCU_MBUFM_MBUFM16_MASK)

#define STCU_MBUFM_MBUFM17_MASK                  (0x20000U)
#define STCU_MBUFM_MBUFM17_SHIFT                 (17U)
#define STCU_MBUFM_MBUFM17_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM17(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM17_SHIFT)) & STCU_MBUFM_MBUFM17_MASK)

#define STCU_MBUFM_MBUFM18_MASK                  (0x40000U)
#define STCU_MBUFM_MBUFM18_SHIFT                 (18U)
#define STCU_MBUFM_MBUFM18_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM18(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM18_SHIFT)) & STCU_MBUFM_MBUFM18_MASK)

