zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBUFM_MBUFM19_MASK                  (0x80000U)
#define STCU_MBUFM_MBUFM19_SHIFT                 (19U)
#define STCU_MBUFM_MBUFM19_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM19(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM19_SHIFT)) & STCU_MBUFM_MBUFM19_MASK)

#define STCU_MBUFM_MBUFM20_MASK                  (0x100000U)
#define STCU_MBUFM_MBUFM20_SHIFT                 (20U)
#define STCU_MBUFM_MBUFM20_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM20(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM20_SHIFT)) & STCU_MBUFM_MBUFM20_MASK)

#define STCU_MBUFM_MBUFM21_MASK                  (0x200000U)
#define STCU_MBUFM_MBUFM21_SHIFT                 (21U)
#define STCU_MBUFM_MBUFM21_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM21(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM21_SHIFT)) & STCU_MBUFM_MBUFM21_MASK)

#define STCU_MBUFM_MBUFM22_MASK                  (0x400000U)
#define STCU_MBUFM_MBUFM22_SHIFT                 (22U)
#define STCU_MBUFM_MBUFM22_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM22(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM22_SHIFT)) & STCU_MBUFM_MBUFM22_MASK)

#define STCU_MBUFM_MBUFM23_MASK                  (0x800000U)
#define STCU_MBUFM_MBUFM23_SHIFT                 (23U)
#define STCU_MBUFM_MBUFM23_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM23(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM23_SHIFT)) & STCU_MBUFM_MBUFM23_MASK)

#define STCU_MBUFM_MBUFM24_MASK                  (0x1000000U)
#define STCU_MBUFM_MBUFM24_SHIFT                 (24U)
#define STCU_MBUFM_MBUFM24_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM24(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM24_SHIFT)) & STCU_MBUFM_MBUFM24_MASK)

#define STCU_MBUFM_MBUFM25_MASK                  (0x2000000U)
#define STCU_MBUFM_MBUFM25_SHIFT                 (25U)
#define STCU_MBUFM_MBUFM25_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM25(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM25_SHIFT)) & STCU_MBUFM_MBUFM25_MASK)

#define STCU_MBUFM_MBUFM26_MASK                  (0x4000000U)
#define STCU_MBUFM_MBUFM26_SHIFT                 (26U)
#define STCU_MBUFM_MBUFM26_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM26(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM26_SHIFT)) & STCU_MBUFM_MBUFM26_MASK)

#define STCU_MBUFM_MBUFM27_MASK                  (0x8000000U)
#define STCU_MBUFM_MBUFM27_SHIFT                 (27U)
#define STCU_MBUFM_MBUFM27_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM27(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM27_SHIFT)) & STCU_MBUFM_MBUFM27_MASK)

#define STCU_MBUFM_MBUFM28_MASK                  (0x10000000U)
#define STCU_MBUFM_MBUFM28_SHIFT                 (28U)
#define STCU_MBUFM_MBUFM28_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM28(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM28_SHIFT)) & STCU_MBUFM_MBUFM28_MASK)

#define STCU_MBUFM_MBUFM29_MASK                  (0x20000000U)
#define STCU_MBUFM_MBUFM29_SHIFT                 (29U)
#define STCU_MBUFM_MBUFM29_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM29(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM29_SHIFT)) & STCU_MBUFM_MBUFM29_MASK)

#define STCU_MBUFM_MBUFM30_MASK                  (0x40000000U)
#define STCU_MBUFM_MBUFM30_SHIFT                 (30U)
#define STCU_MBUFM_MBUFM30_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM30(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM30_SHIFT)) & STCU_MBUFM_MBUFM30_MASK)

#define STCU_MBUFM_MBUFM31_MASK                  (0x80000000U)
#define STCU_MBUFM_MBUFM31_SHIFT                 (31U)
#define STCU_MBUFM_MBUFM31_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM31(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM31_SHIFT)) & STCU_MBUFM_MBUFM31_MASK)

#define STCU_MBUFM_MBUFM32_MASK                  (0x1U)
#define STCU_MBUFM_MBUFM32_SHIFT                 (0U)
#define STCU_MBUFM_MBUFM32_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM32(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM32_SHIFT)) & STCU_MBUFM_MBUFM32_MASK)

#define STCU_MBUFM_MBUFM33_MASK                  (0x2U)
#define STCU_MBUFM_MBUFM33_SHIFT                 (1U)
#define STCU_MBUFM_MBUFM33_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM33(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM33_SHIFT)) & STCU_MBUFM_MBUFM33_MASK)

#define STCU_MBUFM_MBUFM34_MASK                  (0x4U)
#define STCU_MBUFM_MBUFM34_SHIFT                 (2U)
#define STCU_MBUFM_MBUFM34_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM34(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM34_SHIFT)) & STCU_MBUFM_MBUFM34_MASK)

#define STCU_MBUFM_MBUFM35_MASK                  (0x8U)
#define STCU_MBUFM_MBUFM35_SHIFT                 (3U)
#define STCU_MBUFM_MBUFM35_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM35(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM35_SHIFT)) & STCU_MBUFM_MBUFM35_MASK)

#define STCU_MBUFM_MBUFM36_MASK                  (0x10U)
#define STCU_MBUFM_MBUFM36_SHIFT                 (4U)
#define STCU_MBUFM_MBUFM36_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM36(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM36_SHIFT)) & STCU_MBUFM_MBUFM36_MASK)

#define STCU_MBUFM_MBUFM37_MASK                  (0x20U)
#define STCU_MBUFM_MBUFM37_SHIFT                 (5U)
#define STCU_MBUFM_MBUFM37_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM37(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM37_SHIFT)) & STCU_MBUFM_MBUFM37_MASK)

#define STCU_MBUFM_MBUFM38_MASK                  (0x40U)
#define STCU_MBUFM_MBUFM38_SHIFT                 (6U)
#define STCU_MBUFM_MBUFM38_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM38(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM38_SHIFT)) & STCU_MBUFM_MBUFM38_MASK)

#define STCU_MBUFM_MBUFM39_MASK                  (0x80U)
#define STCU_MBUFM_MBUFM39_SHIFT                 (7U)
#define STCU_MBUFM_MBUFM39_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM39(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM39_SHIFT)) & STCU_MBUFM_MBUFM39_MASK)

#define STCU_MBUFM_MBUFM40_MASK                  (0x100U)
#define STCU_MBUFM_MBUFM40_SHIFT                 (8U)
#define STCU_MBUFM_MBUFM40_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM40(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM40_SHIFT)) & STCU_MBUFM_MBUFM40_MASK)

#define STCU_MBUFM_MBUFM41_MASK                  (0x200U)
#define STCU_MBUFM_MBUFM41_SHIFT                 (9U)
#define STCU_MBUFM_MBUFM41_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM41(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM41_SHIFT)) & STCU_MBUFM_MBUFM41_MASK)

#define STCU_MBUFM_MBUFM42_MASK                  (0x400U)
#define STCU_MBUFM_MBUFM42_SHIFT                 (10U)
#define STCU_MBUFM_MBUFM42_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM42(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM42_SHIFT)) & STCU_MBUFM_MBUFM42_MASK)

#define STCU_MBUFM_MBUFM43_MASK                  (0x800U)
#define STCU_MBUFM_MBUFM43_SHIFT                 (11U)
#define STCU_MBUFM_MBUFM43_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM43(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM43_SHIFT)) & STCU_MBUFM_MBUFM43_MASK)

#define STCU_MBUFM_MBUFM44_MASK                  (0x1000U)
#define STCU_MBUFM_MBUFM44_SHIFT                 (12U)
#define STCU_MBUFM_MBUFM44_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM44(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM44_SHIFT)) & STCU_MBUFM_MBUFM44_MASK)

