zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBUFM_MBUFM45_MASK                  (0x2000U)
#define STCU_MBUFM_MBUFM45_SHIFT                 (13U)
#define STCU_MBUFM_MBUFM45_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM45(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM45_SHIFT)) & STCU_MBUFM_MBUFM45_MASK)

#define STCU_MBUFM_MBUFM46_MASK                  (0x4000U)
#define STCU_MBUFM_MBUFM46_SHIFT                 (14U)
#define STCU_MBUFM_MBUFM46_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM46(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM46_SHIFT)) & STCU_MBUFM_MBUFM46_MASK)

#define STCU_MBUFM_MBUFM47_MASK                  (0x8000U)
#define STCU_MBUFM_MBUFM47_SHIFT                 (15U)
#define STCU_MBUFM_MBUFM47_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM47(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM47_SHIFT)) & STCU_MBUFM_MBUFM47_MASK)

#define STCU_MBUFM_MBUFM48_MASK                  (0x10000U)
#define STCU_MBUFM_MBUFM48_SHIFT                 (16U)
#define STCU_MBUFM_MBUFM48_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM48(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM48_SHIFT)) & STCU_MBUFM_MBUFM48_MASK)

#define STCU_MBUFM_MBUFM49_MASK                  (0x20000U)
#define STCU_MBUFM_MBUFM49_SHIFT                 (17U)
#define STCU_MBUFM_MBUFM49_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM49(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM49_SHIFT)) & STCU_MBUFM_MBUFM49_MASK)

#define STCU_MBUFM_MBUFM50_MASK                  (0x40000U)
#define STCU_MBUFM_MBUFM50_SHIFT                 (18U)
#define STCU_MBUFM_MBUFM50_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM50(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM50_SHIFT)) & STCU_MBUFM_MBUFM50_MASK)

#define STCU_MBUFM_MBUFM51_MASK                  (0x80000U)
#define STCU_MBUFM_MBUFM51_SHIFT                 (19U)
#define STCU_MBUFM_MBUFM51_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM51(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM51_SHIFT)) & STCU_MBUFM_MBUFM51_MASK)

#define STCU_MBUFM_MBUFM52_MASK                  (0x100000U)
#define STCU_MBUFM_MBUFM52_SHIFT                 (20U)
#define STCU_MBUFM_MBUFM52_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM52(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM52_SHIFT)) & STCU_MBUFM_MBUFM52_MASK)

#define STCU_MBUFM_MBUFM53_MASK                  (0x200000U)
#define STCU_MBUFM_MBUFM53_SHIFT                 (21U)
#define STCU_MBUFM_MBUFM53_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM53(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM53_SHIFT)) & STCU_MBUFM_MBUFM53_MASK)

#define STCU_MBUFM_MBUFM54_MASK                  (0x400000U)
#define STCU_MBUFM_MBUFM54_SHIFT                 (22U)
#define STCU_MBUFM_MBUFM54_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM54(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM54_SHIFT)) & STCU_MBUFM_MBUFM54_MASK)

#define STCU_MBUFM_MBUFM55_MASK                  (0x800000U)
#define STCU_MBUFM_MBUFM55_SHIFT                 (23U)
#define STCU_MBUFM_MBUFM55_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM55(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM55_SHIFT)) & STCU_MBUFM_MBUFM55_MASK)

#define STCU_MBUFM_MBUFM56_MASK                  (0x1000000U)
#define STCU_MBUFM_MBUFM56_SHIFT                 (24U)
#define STCU_MBUFM_MBUFM56_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM56(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM56_SHIFT)) & STCU_MBUFM_MBUFM56_MASK)

#define STCU_MBUFM_MBUFM57_MASK                  (0x2000000U)
#define STCU_MBUFM_MBUFM57_SHIFT                 (25U)
#define STCU_MBUFM_MBUFM57_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM57(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM57_SHIFT)) & STCU_MBUFM_MBUFM57_MASK)

#define STCU_MBUFM_MBUFM58_MASK                  (0x4000000U)
#define STCU_MBUFM_MBUFM58_SHIFT                 (26U)
#define STCU_MBUFM_MBUFM58_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM58(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM58_SHIFT)) & STCU_MBUFM_MBUFM58_MASK)

#define STCU_MBUFM_MBUFM59_MASK                  (0x8000000U)
#define STCU_MBUFM_MBUFM59_SHIFT                 (27U)
#define STCU_MBUFM_MBUFM59_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM59(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM59_SHIFT)) & STCU_MBUFM_MBUFM59_MASK)

#define STCU_MBUFM_MBUFM60_MASK                  (0x10000000U)
#define STCU_MBUFM_MBUFM60_SHIFT                 (28U)
#define STCU_MBUFM_MBUFM60_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM60(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM60_SHIFT)) & STCU_MBUFM_MBUFM60_MASK)

#define STCU_MBUFM_MBUFM61_MASK                  (0x20000000U)
#define STCU_MBUFM_MBUFM61_SHIFT                 (29U)
#define STCU_MBUFM_MBUFM61_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM61(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM61_SHIFT)) & STCU_MBUFM_MBUFM61_MASK)

#define STCU_MBUFM_MBUFM62_MASK                  (0x40000000U)
#define STCU_MBUFM_MBUFM62_SHIFT                 (30U)
#define STCU_MBUFM_MBUFM62_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM62(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM62_SHIFT)) & STCU_MBUFM_MBUFM62_MASK)

#define STCU_MBUFM_MBUFM63_MASK                  (0x80000000U)
#define STCU_MBUFM_MBUFM63_SHIFT                 (31U)
#define STCU_MBUFM_MBUFM63_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM63(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM63_SHIFT)) & STCU_MBUFM_MBUFM63_MASK)

#define STCU_MBUFM_MBUFM64_MASK                  (0x1U)
#define STCU_MBUFM_MBUFM64_SHIFT                 (0U)
#define STCU_MBUFM_MBUFM64_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM64(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM64_SHIFT)) & STCU_MBUFM_MBUFM64_MASK)

#define STCU_MBUFM_MBUFM65_MASK                  (0x2U)
#define STCU_MBUFM_MBUFM65_SHIFT                 (1U)
#define STCU_MBUFM_MBUFM65_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM65(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM65_SHIFT)) & STCU_MBUFM_MBUFM65_MASK)

#define STCU_MBUFM_MBUFM66_MASK                  (0x4U)
#define STCU_MBUFM_MBUFM66_SHIFT                 (2U)
#define STCU_MBUFM_MBUFM66_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM66(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM66_SHIFT)) & STCU_MBUFM_MBUFM66_MASK)

#define STCU_MBUFM_MBUFM67_MASK                  (0x8U)
#define STCU_MBUFM_MBUFM67_SHIFT                 (3U)
#define STCU_MBUFM_MBUFM67_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM67(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM67_SHIFT)) & STCU_MBUFM_MBUFM67_MASK)

#define STCU_MBUFM_MBUFM68_MASK                  (0x10U)
#define STCU_MBUFM_MBUFM68_SHIFT                 (4U)
#define STCU_MBUFM_MBUFM68_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM68(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM68_SHIFT)) & STCU_MBUFM_MBUFM68_MASK)

#define STCU_MBUFM_MBUFM69_MASK                  (0x20U)
#define STCU_MBUFM_MBUFM69_SHIFT                 (5U)
#define STCU_MBUFM_MBUFM69_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM69(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM69_SHIFT)) & STCU_MBUFM_MBUFM69_MASK)

#define STCU_MBUFM_MBUFM70_MASK                  (0x40U)
#define STCU_MBUFM_MBUFM70_SHIFT                 (6U)
#define STCU_MBUFM_MBUFM70_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM70(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM70_SHIFT)) & STCU_MBUFM_MBUFM70_MASK)

