zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBUFM_MBUFM71_MASK                  (0x80U)
#define STCU_MBUFM_MBUFM71_SHIFT                 (7U)
#define STCU_MBUFM_MBUFM71_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM71(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM71_SHIFT)) & STCU_MBUFM_MBUFM71_MASK)

#define STCU_MBUFM_MBUFM72_MASK                  (0x100U)
#define STCU_MBUFM_MBUFM72_SHIFT                 (8U)
#define STCU_MBUFM_MBUFM72_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM72(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM72_SHIFT)) & STCU_MBUFM_MBUFM72_MASK)

#define STCU_MBUFM_MBUFM73_MASK                  (0x200U)
#define STCU_MBUFM_MBUFM73_SHIFT                 (9U)
#define STCU_MBUFM_MBUFM73_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM73(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM73_SHIFT)) & STCU_MBUFM_MBUFM73_MASK)

#define STCU_MBUFM_MBUFM74_MASK                  (0x400U)
#define STCU_MBUFM_MBUFM74_SHIFT                 (10U)
#define STCU_MBUFM_MBUFM74_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM74(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM74_SHIFT)) & STCU_MBUFM_MBUFM74_MASK)

#define STCU_MBUFM_MBUFM75_MASK                  (0x800U)
#define STCU_MBUFM_MBUFM75_SHIFT                 (11U)
#define STCU_MBUFM_MBUFM75_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM75(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM75_SHIFT)) & STCU_MBUFM_MBUFM75_MASK)

#define STCU_MBUFM_MBUFM76_MASK                  (0x1000U)
#define STCU_MBUFM_MBUFM76_SHIFT                 (12U)
#define STCU_MBUFM_MBUFM76_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM76(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM76_SHIFT)) & STCU_MBUFM_MBUFM76_MASK)

#define STCU_MBUFM_MBUFM77_MASK                  (0x2000U)
#define STCU_MBUFM_MBUFM77_SHIFT                 (13U)
#define STCU_MBUFM_MBUFM77_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM77(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM77_SHIFT)) & STCU_MBUFM_MBUFM77_MASK)

#define STCU_MBUFM_MBUFM78_MASK                  (0x4000U)
#define STCU_MBUFM_MBUFM78_SHIFT                 (14U)
#define STCU_MBUFM_MBUFM78_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM78(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM78_SHIFT)) & STCU_MBUFM_MBUFM78_MASK)

#define STCU_MBUFM_MBUFM79_MASK                  (0x8000U)
#define STCU_MBUFM_MBUFM79_SHIFT                 (15U)
#define STCU_MBUFM_MBUFM79_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM79(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM79_SHIFT)) & STCU_MBUFM_MBUFM79_MASK)

#define STCU_MBUFM_MBUFM80_MASK                  (0x10000U)
#define STCU_MBUFM_MBUFM80_SHIFT                 (16U)
#define STCU_MBUFM_MBUFM80_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM80(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM80_SHIFT)) & STCU_MBUFM_MBUFM80_MASK)

#define STCU_MBUFM_MBUFM81_MASK                  (0x20000U)
#define STCU_MBUFM_MBUFM81_SHIFT                 (17U)
#define STCU_MBUFM_MBUFM81_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM81(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM81_SHIFT)) & STCU_MBUFM_MBUFM81_MASK)

#define STCU_MBUFM_MBUFM82_MASK                  (0x40000U)
#define STCU_MBUFM_MBUFM82_SHIFT                 (18U)
#define STCU_MBUFM_MBUFM82_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM82(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM82_SHIFT)) & STCU_MBUFM_MBUFM82_MASK)

#define STCU_MBUFM_MBUFM83_MASK                  (0x80000U)
#define STCU_MBUFM_MBUFM83_SHIFT                 (19U)
#define STCU_MBUFM_MBUFM83_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM83(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM83_SHIFT)) & STCU_MBUFM_MBUFM83_MASK)

#define STCU_MBUFM_MBUFM84_MASK                  (0x100000U)
#define STCU_MBUFM_MBUFM84_SHIFT                 (20U)
#define STCU_MBUFM_MBUFM84_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM84(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM84_SHIFT)) & STCU_MBUFM_MBUFM84_MASK)

#define STCU_MBUFM_MBUFM85_MASK                  (0x200000U)
#define STCU_MBUFM_MBUFM85_SHIFT                 (21U)
#define STCU_MBUFM_MBUFM85_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM85(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM85_SHIFT)) & STCU_MBUFM_MBUFM85_MASK)

#define STCU_MBUFM_MBUFM86_MASK                  (0x400000U)
#define STCU_MBUFM_MBUFM86_SHIFT                 (22U)
#define STCU_MBUFM_MBUFM86_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM86(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM86_SHIFT)) & STCU_MBUFM_MBUFM86_MASK)

#define STCU_MBUFM_MBUFM87_MASK                  (0x800000U)
#define STCU_MBUFM_MBUFM87_SHIFT                 (23U)
#define STCU_MBUFM_MBUFM87_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM87(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM87_SHIFT)) & STCU_MBUFM_MBUFM87_MASK)

#define STCU_MBUFM_MBUFM88_MASK                  (0x1000000U)
#define STCU_MBUFM_MBUFM88_SHIFT                 (24U)
#define STCU_MBUFM_MBUFM88_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM88(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM88_SHIFT)) & STCU_MBUFM_MBUFM88_MASK)

#define STCU_MBUFM_MBUFM89_MASK                  (0x2000000U)
#define STCU_MBUFM_MBUFM89_SHIFT                 (25U)
#define STCU_MBUFM_MBUFM89_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM89(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM89_SHIFT)) & STCU_MBUFM_MBUFM89_MASK)

#define STCU_MBUFM_MBUFM90_MASK                  (0x4000000U)
#define STCU_MBUFM_MBUFM90_SHIFT                 (26U)
#define STCU_MBUFM_MBUFM90_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM90(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM90_SHIFT)) & STCU_MBUFM_MBUFM90_MASK)

#define STCU_MBUFM_MBUFM91_MASK                  (0x8000000U)
#define STCU_MBUFM_MBUFM91_SHIFT                 (27U)
#define STCU_MBUFM_MBUFM91_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM91(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM91_SHIFT)) & STCU_MBUFM_MBUFM91_MASK)

#define STCU_MBUFM_MBUFM92_MASK                  (0x10000000U)
#define STCU_MBUFM_MBUFM92_SHIFT                 (28U)
#define STCU_MBUFM_MBUFM92_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM92(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM92_SHIFT)) & STCU_MBUFM_MBUFM92_MASK)

#define STCU_MBUFM_MBUFM93_MASK                  (0x20000000U)
#define STCU_MBUFM_MBUFM93_SHIFT                 (29U)
#define STCU_MBUFM_MBUFM93_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM93(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM93_SHIFT)) & STCU_MBUFM_MBUFM93_MASK)

#define STCU_MBUFM_MBUFM94_MASK                  (0x40000000U)
#define STCU_MBUFM_MBUFM94_SHIFT                 (30U)
#define STCU_MBUFM_MBUFM94_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM94(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM94_SHIFT)) & STCU_MBUFM_MBUFM94_MASK)

#define STCU_MBUFM_MBUFM95_MASK                  (0x80000000U)
#define STCU_MBUFM_MBUFM95_SHIFT                 (31U)
#define STCU_MBUFM_MBUFM95_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM95(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM95_SHIFT)) & STCU_MBUFM_MBUFM95_MASK)

#define STCU_MBUFM_MBUFM96_MASK                  (0x1U)
#define STCU_MBUFM_MBUFM96_SHIFT                 (0U)
#define STCU_MBUFM_MBUFM96_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM96(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM96_SHIFT)) & STCU_MBUFM_MBUFM96_MASK)

