zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBUFM_MBUFM97_MASK                  (0x2U)
#define STCU_MBUFM_MBUFM97_SHIFT                 (1U)
#define STCU_MBUFM_MBUFM97_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM97(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM97_SHIFT)) & STCU_MBUFM_MBUFM97_MASK)

#define STCU_MBUFM_MBUFM98_MASK                  (0x4U)
#define STCU_MBUFM_MBUFM98_SHIFT                 (2U)
#define STCU_MBUFM_MBUFM98_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM98(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM98_SHIFT)) & STCU_MBUFM_MBUFM98_MASK)

#define STCU_MBUFM_MBUFM99_MASK                  (0x8U)
#define STCU_MBUFM_MBUFM99_SHIFT                 (3U)
#define STCU_MBUFM_MBUFM99_WIDTH                 (1U)
#define STCU_MBUFM_MBUFM99(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM99_SHIFT)) & STCU_MBUFM_MBUFM99_MASK)

#define STCU_MBUFM_MBUFM100_MASK                 (0x10U)
#define STCU_MBUFM_MBUFM100_SHIFT                (4U)
#define STCU_MBUFM_MBUFM100_WIDTH                (1U)
#define STCU_MBUFM_MBUFM100(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM100_SHIFT)) & STCU_MBUFM_MBUFM100_MASK)

#define STCU_MBUFM_MBUFM101_MASK                 (0x20U)
#define STCU_MBUFM_MBUFM101_SHIFT                (5U)
#define STCU_MBUFM_MBUFM101_WIDTH                (1U)
#define STCU_MBUFM_MBUFM101(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM101_SHIFT)) & STCU_MBUFM_MBUFM101_MASK)

#define STCU_MBUFM_MBUFM102_MASK                 (0x40U)
#define STCU_MBUFM_MBUFM102_SHIFT                (6U)
#define STCU_MBUFM_MBUFM102_WIDTH                (1U)
#define STCU_MBUFM_MBUFM102(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM102_SHIFT)) & STCU_MBUFM_MBUFM102_MASK)

#define STCU_MBUFM_MBUFM103_MASK                 (0x80U)
#define STCU_MBUFM_MBUFM103_SHIFT                (7U)
#define STCU_MBUFM_MBUFM103_WIDTH                (1U)
#define STCU_MBUFM_MBUFM103(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM103_SHIFT)) & STCU_MBUFM_MBUFM103_MASK)

#define STCU_MBUFM_MBUFM104_MASK                 (0x100U)
#define STCU_MBUFM_MBUFM104_SHIFT                (8U)
#define STCU_MBUFM_MBUFM104_WIDTH                (1U)
#define STCU_MBUFM_MBUFM104(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM104_SHIFT)) & STCU_MBUFM_MBUFM104_MASK)

#define STCU_MBUFM_MBUFM105_MASK                 (0x200U)
#define STCU_MBUFM_MBUFM105_SHIFT                (9U)
#define STCU_MBUFM_MBUFM105_WIDTH                (1U)
#define STCU_MBUFM_MBUFM105(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM105_SHIFT)) & STCU_MBUFM_MBUFM105_MASK)

#define STCU_MBUFM_MBUFM106_MASK                 (0x400U)
#define STCU_MBUFM_MBUFM106_SHIFT                (10U)
#define STCU_MBUFM_MBUFM106_WIDTH                (1U)
#define STCU_MBUFM_MBUFM106(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM106_SHIFT)) & STCU_MBUFM_MBUFM106_MASK)

#define STCU_MBUFM_MBUFM107_MASK                 (0x800U)
#define STCU_MBUFM_MBUFM107_SHIFT                (11U)
#define STCU_MBUFM_MBUFM107_WIDTH                (1U)
#define STCU_MBUFM_MBUFM107(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM107_SHIFT)) & STCU_MBUFM_MBUFM107_MASK)

#define STCU_MBUFM_MBUFM108_MASK                 (0x1000U)
#define STCU_MBUFM_MBUFM108_SHIFT                (12U)
#define STCU_MBUFM_MBUFM108_WIDTH                (1U)
#define STCU_MBUFM_MBUFM108(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM108_SHIFT)) & STCU_MBUFM_MBUFM108_MASK)

#define STCU_MBUFM_MBUFM109_MASK                 (0x2000U)
#define STCU_MBUFM_MBUFM109_SHIFT                (13U)
#define STCU_MBUFM_MBUFM109_WIDTH                (1U)
#define STCU_MBUFM_MBUFM109(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM109_SHIFT)) & STCU_MBUFM_MBUFM109_MASK)

#define STCU_MBUFM_MBUFM110_MASK                 (0x4000U)
#define STCU_MBUFM_MBUFM110_SHIFT                (14U)
#define STCU_MBUFM_MBUFM110_WIDTH                (1U)
#define STCU_MBUFM_MBUFM110(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM110_SHIFT)) & STCU_MBUFM_MBUFM110_MASK)

#define STCU_MBUFM_MBUFM111_MASK                 (0x8000U)
#define STCU_MBUFM_MBUFM111_SHIFT                (15U)
#define STCU_MBUFM_MBUFM111_WIDTH                (1U)
#define STCU_MBUFM_MBUFM111(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM111_SHIFT)) & STCU_MBUFM_MBUFM111_MASK)

#define STCU_MBUFM_MBUFM112_MASK                 (0x10000U)
#define STCU_MBUFM_MBUFM112_SHIFT                (16U)
#define STCU_MBUFM_MBUFM112_WIDTH                (1U)
#define STCU_MBUFM_MBUFM112(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM112_SHIFT)) & STCU_MBUFM_MBUFM112_MASK)

#define STCU_MBUFM_MBUFM113_MASK                 (0x20000U)
#define STCU_MBUFM_MBUFM113_SHIFT                (17U)
#define STCU_MBUFM_MBUFM113_WIDTH                (1U)
#define STCU_MBUFM_MBUFM113(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM113_SHIFT)) & STCU_MBUFM_MBUFM113_MASK)

#define STCU_MBUFM_MBUFM114_MASK                 (0x40000U)
#define STCU_MBUFM_MBUFM114_SHIFT                (18U)
#define STCU_MBUFM_MBUFM114_WIDTH                (1U)
#define STCU_MBUFM_MBUFM114(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM114_SHIFT)) & STCU_MBUFM_MBUFM114_MASK)

#define STCU_MBUFM_MBUFM115_MASK                 (0x80000U)
#define STCU_MBUFM_MBUFM115_SHIFT                (19U)
#define STCU_MBUFM_MBUFM115_WIDTH                (1U)
#define STCU_MBUFM_MBUFM115(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM115_SHIFT)) & STCU_MBUFM_MBUFM115_MASK)

#define STCU_MBUFM_MBUFM116_MASK                 (0x100000U)
#define STCU_MBUFM_MBUFM116_SHIFT                (20U)
#define STCU_MBUFM_MBUFM116_WIDTH                (1U)
#define STCU_MBUFM_MBUFM116(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM116_SHIFT)) & STCU_MBUFM_MBUFM116_MASK)

