zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBUFM_MBUFM117_MASK                 (0x200000U)
#define STCU_MBUFM_MBUFM117_SHIFT                (21U)
#define STCU_MBUFM_MBUFM117_WIDTH                (1U)
#define STCU_MBUFM_MBUFM117(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM117_SHIFT)) & STCU_MBUFM_MBUFM117_MASK)

#define STCU_MBUFM_MBUFM118_MASK                 (0x400000U)
#define STCU_MBUFM_MBUFM118_SHIFT                (22U)
#define STCU_MBUFM_MBUFM118_WIDTH                (1U)
#define STCU_MBUFM_MBUFM118(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM118_SHIFT)) & STCU_MBUFM_MBUFM118_MASK)

#define STCU_MBUFM_MBUFM119_MASK                 (0x800000U)
#define STCU_MBUFM_MBUFM119_SHIFT                (23U)
#define STCU_MBUFM_MBUFM119_WIDTH                (1U)
#define STCU_MBUFM_MBUFM119(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM119_SHIFT)) & STCU_MBUFM_MBUFM119_MASK)

#define STCU_MBUFM_MBUFM120_MASK                 (0x1000000U)
#define STCU_MBUFM_MBUFM120_SHIFT                (24U)
#define STCU_MBUFM_MBUFM120_WIDTH                (1U)
#define STCU_MBUFM_MBUFM120(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM120_SHIFT)) & STCU_MBUFM_MBUFM120_MASK)

#define STCU_MBUFM_MBUFM121_MASK                 (0x2000000U)
#define STCU_MBUFM_MBUFM121_SHIFT                (25U)
#define STCU_MBUFM_MBUFM121_WIDTH                (1U)
#define STCU_MBUFM_MBUFM121(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM121_SHIFT)) & STCU_MBUFM_MBUFM121_MASK)

#define STCU_MBUFM_MBUFM122_MASK                 (0x4000000U)
#define STCU_MBUFM_MBUFM122_SHIFT                (26U)
#define STCU_MBUFM_MBUFM122_WIDTH                (1U)
#define STCU_MBUFM_MBUFM122(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM122_SHIFT)) & STCU_MBUFM_MBUFM122_MASK)

#define STCU_MBUFM_MBUFM123_MASK                 (0x8000000U)
#define STCU_MBUFM_MBUFM123_SHIFT                (27U)
#define STCU_MBUFM_MBUFM123_WIDTH                (1U)
#define STCU_MBUFM_MBUFM123(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM123_SHIFT)) & STCU_MBUFM_MBUFM123_MASK)

#define STCU_MBUFM_MBUFM124_MASK                 (0x10000000U)
#define STCU_MBUFM_MBUFM124_SHIFT                (28U)
#define STCU_MBUFM_MBUFM124_WIDTH                (1U)
#define STCU_MBUFM_MBUFM124(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM124_SHIFT)) & STCU_MBUFM_MBUFM124_MASK)

#define STCU_MBUFM_MBUFM125_MASK                 (0x20000000U)
#define STCU_MBUFM_MBUFM125_SHIFT                (29U)
#define STCU_MBUFM_MBUFM125_WIDTH                (1U)
#define STCU_MBUFM_MBUFM125(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM125_SHIFT)) & STCU_MBUFM_MBUFM125_MASK)

#define STCU_MBUFM_MBUFM126_MASK                 (0x40000000U)
#define STCU_MBUFM_MBUFM126_SHIFT                (30U)
#define STCU_MBUFM_MBUFM126_WIDTH                (1U)
#define STCU_MBUFM_MBUFM126(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM126_SHIFT)) & STCU_MBUFM_MBUFM126_MASK)

#define STCU_MBUFM_MBUFM127_MASK                 (0x80000000U)
#define STCU_MBUFM_MBUFM127_SHIFT                (31U)
#define STCU_MBUFM_MBUFM127_WIDTH                (1U)
#define STCU_MBUFM_MBUFM127(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM127_SHIFT)) & STCU_MBUFM_MBUFM127_MASK)

#define STCU_MBUFM_MBUFM128_MASK                 (0x1U)
#define STCU_MBUFM_MBUFM128_SHIFT                (0U)
#define STCU_MBUFM_MBUFM128_WIDTH                (1U)
#define STCU_MBUFM_MBUFM128(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM128_SHIFT)) & STCU_MBUFM_MBUFM128_MASK)

#define STCU_MBUFM_MBUFM129_MASK                 (0x2U)
#define STCU_MBUFM_MBUFM129_SHIFT                (1U)
#define STCU_MBUFM_MBUFM129_WIDTH                (1U)
#define STCU_MBUFM_MBUFM129(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM129_SHIFT)) & STCU_MBUFM_MBUFM129_MASK)

#define STCU_MBUFM_MBUFM130_MASK                 (0x4U)
#define STCU_MBUFM_MBUFM130_SHIFT                (2U)
#define STCU_MBUFM_MBUFM130_WIDTH                (1U)
#define STCU_MBUFM_MBUFM130(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM130_SHIFT)) & STCU_MBUFM_MBUFM130_MASK)

#define STCU_MBUFM_MBUFM131_MASK                 (0x8U)
#define STCU_MBUFM_MBUFM131_SHIFT                (3U)
#define STCU_MBUFM_MBUFM131_WIDTH                (1U)
#define STCU_MBUFM_MBUFM131(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM131_SHIFT)) & STCU_MBUFM_MBUFM131_MASK)

#define STCU_MBUFM_MBUFM132_MASK                 (0x10U)
#define STCU_MBUFM_MBUFM132_SHIFT                (4U)
#define STCU_MBUFM_MBUFM132_WIDTH                (1U)
#define STCU_MBUFM_MBUFM132(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM132_SHIFT)) & STCU_MBUFM_MBUFM132_MASK)

#define STCU_MBUFM_MBUFM133_MASK                 (0x20U)
#define STCU_MBUFM_MBUFM133_SHIFT                (5U)
#define STCU_MBUFM_MBUFM133_WIDTH                (1U)
#define STCU_MBUFM_MBUFM133(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM133_SHIFT)) & STCU_MBUFM_MBUFM133_MASK)

#define STCU_MBUFM_MBUFM134_MASK                 (0x40U)
#define STCU_MBUFM_MBUFM134_SHIFT                (6U)
#define STCU_MBUFM_MBUFM134_WIDTH                (1U)
#define STCU_MBUFM_MBUFM134(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM134_SHIFT)) & STCU_MBUFM_MBUFM134_MASK)

#define STCU_MBUFM_MBUFM135_MASK                 (0x80U)
#define STCU_MBUFM_MBUFM135_SHIFT                (7U)
#define STCU_MBUFM_MBUFM135_WIDTH                (1U)
#define STCU_MBUFM_MBUFM135(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM135_SHIFT)) & STCU_MBUFM_MBUFM135_MASK)

#define STCU_MBUFM_MBUFM136_MASK                 (0x100U)
#define STCU_MBUFM_MBUFM136_SHIFT                (8U)
#define STCU_MBUFM_MBUFM136_WIDTH                (1U)
#define STCU_MBUFM_MBUFM136(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM136_SHIFT)) & STCU_MBUFM_MBUFM136_MASK)

#define STCU_MBUFM_MBUFM137_MASK                 (0x200U)
#define STCU_MBUFM_MBUFM137_SHIFT                (9U)
#define STCU_MBUFM_MBUFM137_WIDTH                (1U)
#define STCU_MBUFM_MBUFM137(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM137_SHIFT)) & STCU_MBUFM_MBUFM137_MASK)

#define STCU_MBUFM_MBUFM138_MASK                 (0x400U)
#define STCU_MBUFM_MBUFM138_SHIFT                (10U)
#define STCU_MBUFM_MBUFM138_WIDTH                (1U)
#define STCU_MBUFM_MBUFM138(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM138_SHIFT)) & STCU_MBUFM_MBUFM138_MASK)

#define STCU_MBUFM_MBUFM139_MASK                 (0x800U)
#define STCU_MBUFM_MBUFM139_SHIFT                (11U)
#define STCU_MBUFM_MBUFM139_WIDTH                (1U)
#define STCU_MBUFM_MBUFM139(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM139_SHIFT)) & STCU_MBUFM_MBUFM139_MASK)

