zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBUFM_MBUFM140_MASK                 (0x1000U)
#define STCU_MBUFM_MBUFM140_SHIFT                (12U)
#define STCU_MBUFM_MBUFM140_WIDTH                (1U)
#define STCU_MBUFM_MBUFM140(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM140_SHIFT)) & STCU_MBUFM_MBUFM140_MASK)

#define STCU_MBUFM_MBUFM141_MASK                 (0x2000U)
#define STCU_MBUFM_MBUFM141_SHIFT                (13U)
#define STCU_MBUFM_MBUFM141_WIDTH                (1U)
#define STCU_MBUFM_MBUFM141(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM141_SHIFT)) & STCU_MBUFM_MBUFM141_MASK)

#define STCU_MBUFM_MBUFM142_MASK                 (0x4000U)
#define STCU_MBUFM_MBUFM142_SHIFT                (14U)
#define STCU_MBUFM_MBUFM142_WIDTH                (1U)
#define STCU_MBUFM_MBUFM142(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM142_SHIFT)) & STCU_MBUFM_MBUFM142_MASK)

#define STCU_MBUFM_MBUFM143_MASK                 (0x8000U)
#define STCU_MBUFM_MBUFM143_SHIFT                (15U)
#define STCU_MBUFM_MBUFM143_WIDTH                (1U)
#define STCU_MBUFM_MBUFM143(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM143_SHIFT)) & STCU_MBUFM_MBUFM143_MASK)

#define STCU_MBUFM_MBUFM144_MASK                 (0x10000U)
#define STCU_MBUFM_MBUFM144_SHIFT                (16U)
#define STCU_MBUFM_MBUFM144_WIDTH                (1U)
#define STCU_MBUFM_MBUFM144(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM144_SHIFT)) & STCU_MBUFM_MBUFM144_MASK)

#define STCU_MBUFM_MBUFM145_MASK                 (0x20000U)
#define STCU_MBUFM_MBUFM145_SHIFT                (17U)
#define STCU_MBUFM_MBUFM145_WIDTH                (1U)
#define STCU_MBUFM_MBUFM145(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM145_SHIFT)) & STCU_MBUFM_MBUFM145_MASK)

#define STCU_MBUFM_MBUFM146_MASK                 (0x40000U)
#define STCU_MBUFM_MBUFM146_SHIFT                (18U)
#define STCU_MBUFM_MBUFM146_WIDTH                (1U)
#define STCU_MBUFM_MBUFM146(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM146_SHIFT)) & STCU_MBUFM_MBUFM146_MASK)

#define STCU_MBUFM_MBUFM147_MASK                 (0x80000U)
#define STCU_MBUFM_MBUFM147_SHIFT                (19U)
#define STCU_MBUFM_MBUFM147_WIDTH                (1U)
#define STCU_MBUFM_MBUFM147(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM147_SHIFT)) & STCU_MBUFM_MBUFM147_MASK)

#define STCU_MBUFM_MBUFM148_MASK                 (0x100000U)
#define STCU_MBUFM_MBUFM148_SHIFT                (20U)
#define STCU_MBUFM_MBUFM148_WIDTH                (1U)
#define STCU_MBUFM_MBUFM148(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM148_SHIFT)) & STCU_MBUFM_MBUFM148_MASK)

#define STCU_MBUFM_MBUFM149_MASK                 (0x200000U)
#define STCU_MBUFM_MBUFM149_SHIFT                (21U)
#define STCU_MBUFM_MBUFM149_WIDTH                (1U)
#define STCU_MBUFM_MBUFM149(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM149_SHIFT)) & STCU_MBUFM_MBUFM149_MASK)

#define STCU_MBUFM_MBUFM150_MASK                 (0x400000U)
#define STCU_MBUFM_MBUFM150_SHIFT                (22U)
#define STCU_MBUFM_MBUFM150_WIDTH                (1U)
#define STCU_MBUFM_MBUFM150(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM150_SHIFT)) & STCU_MBUFM_MBUFM150_MASK)

#define STCU_MBUFM_MBUFM151_MASK                 (0x800000U)
#define STCU_MBUFM_MBUFM151_SHIFT                (23U)
#define STCU_MBUFM_MBUFM151_WIDTH                (1U)
#define STCU_MBUFM_MBUFM151(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM151_SHIFT)) & STCU_MBUFM_MBUFM151_MASK)

#define STCU_MBUFM_MBUFM152_MASK                 (0x1000000U)
#define STCU_MBUFM_MBUFM152_SHIFT                (24U)
#define STCU_MBUFM_MBUFM152_WIDTH                (1U)
#define STCU_MBUFM_MBUFM152(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM152_SHIFT)) & STCU_MBUFM_MBUFM152_MASK)

#define STCU_MBUFM_MBUFM153_MASK                 (0x2000000U)
#define STCU_MBUFM_MBUFM153_SHIFT                (25U)
#define STCU_MBUFM_MBUFM153_WIDTH                (1U)
#define STCU_MBUFM_MBUFM153(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM153_SHIFT)) & STCU_MBUFM_MBUFM153_MASK)

#define STCU_MBUFM_MBUFM154_MASK                 (0x4000000U)
#define STCU_MBUFM_MBUFM154_SHIFT                (26U)
#define STCU_MBUFM_MBUFM154_WIDTH                (1U)
#define STCU_MBUFM_MBUFM154(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM154_SHIFT)) & STCU_MBUFM_MBUFM154_MASK)

#define STCU_MBUFM_MBUFM155_MASK                 (0x8000000U)
#define STCU_MBUFM_MBUFM155_SHIFT                (27U)
#define STCU_MBUFM_MBUFM155_WIDTH                (1U)
#define STCU_MBUFM_MBUFM155(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM155_SHIFT)) & STCU_MBUFM_MBUFM155_MASK)

#define STCU_MBUFM_MBUFM156_MASK                 (0x10000000U)
#define STCU_MBUFM_MBUFM156_SHIFT                (28U)
#define STCU_MBUFM_MBUFM156_WIDTH                (1U)
#define STCU_MBUFM_MBUFM156(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM156_SHIFT)) & STCU_MBUFM_MBUFM156_MASK)

#define STCU_MBUFM_MBUFM157_MASK                 (0x20000000U)
#define STCU_MBUFM_MBUFM157_SHIFT                (29U)
#define STCU_MBUFM_MBUFM157_WIDTH                (1U)
#define STCU_MBUFM_MBUFM157(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM157_SHIFT)) & STCU_MBUFM_MBUFM157_MASK)

#define STCU_MBUFM_MBUFM158_MASK                 (0x40000000U)
#define STCU_MBUFM_MBUFM158_SHIFT                (30U)
#define STCU_MBUFM_MBUFM158_WIDTH                (1U)
#define STCU_MBUFM_MBUFM158(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM158_SHIFT)) & STCU_MBUFM_MBUFM158_MASK)

#define STCU_MBUFM_MBUFM159_MASK                 (0x80000000U)
#define STCU_MBUFM_MBUFM159_SHIFT                (31U)
#define STCU_MBUFM_MBUFM159_WIDTH                (1U)
#define STCU_MBUFM_MBUFM159(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM159_SHIFT)) & STCU_MBUFM_MBUFM159_MASK)

