zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBUFM_MBUFM160_MASK                 (0x1U)
#define STCU_MBUFM_MBUFM160_SHIFT                (0U)
#define STCU_MBUFM_MBUFM160_WIDTH                (1U)
#define STCU_MBUFM_MBUFM160(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM160_SHIFT)) & STCU_MBUFM_MBUFM160_MASK)

#define STCU_MBUFM_MBUFM161_MASK                 (0x2U)
#define STCU_MBUFM_MBUFM161_SHIFT                (1U)
#define STCU_MBUFM_MBUFM161_WIDTH                (1U)
#define STCU_MBUFM_MBUFM161(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM161_SHIFT)) & STCU_MBUFM_MBUFM161_MASK)

#define STCU_MBUFM_MBUFM162_MASK                 (0x4U)
#define STCU_MBUFM_MBUFM162_SHIFT                (2U)
#define STCU_MBUFM_MBUFM162_WIDTH                (1U)
#define STCU_MBUFM_MBUFM162(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM162_SHIFT)) & STCU_MBUFM_MBUFM162_MASK)

#define STCU_MBUFM_MBUFM163_MASK                 (0x8U)
#define STCU_MBUFM_MBUFM163_SHIFT                (3U)
#define STCU_MBUFM_MBUFM163_WIDTH                (1U)
#define STCU_MBUFM_MBUFM163(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM163_SHIFT)) & STCU_MBUFM_MBUFM163_MASK)

#define STCU_MBUFM_MBUFM164_MASK                 (0x10U)
#define STCU_MBUFM_MBUFM164_SHIFT                (4U)
#define STCU_MBUFM_MBUFM164_WIDTH                (1U)
#define STCU_MBUFM_MBUFM164(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM164_SHIFT)) & STCU_MBUFM_MBUFM164_MASK)

#define STCU_MBUFM_MBUFM165_MASK                 (0x20U)
#define STCU_MBUFM_MBUFM165_SHIFT                (5U)
#define STCU_MBUFM_MBUFM165_WIDTH                (1U)
#define STCU_MBUFM_MBUFM165(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM165_SHIFT)) & STCU_MBUFM_MBUFM165_MASK)

#define STCU_MBUFM_MBUFM166_MASK                 (0x40U)
#define STCU_MBUFM_MBUFM166_SHIFT                (6U)
#define STCU_MBUFM_MBUFM166_WIDTH                (1U)
#define STCU_MBUFM_MBUFM166(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM166_SHIFT)) & STCU_MBUFM_MBUFM166_MASK)

#define STCU_MBUFM_MBUFM167_MASK                 (0x80U)
#define STCU_MBUFM_MBUFM167_SHIFT                (7U)
#define STCU_MBUFM_MBUFM167_WIDTH                (1U)
#define STCU_MBUFM_MBUFM167(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM167_SHIFT)) & STCU_MBUFM_MBUFM167_MASK)

#define STCU_MBUFM_MBUFM168_MASK                 (0x100U)
#define STCU_MBUFM_MBUFM168_SHIFT                (8U)
#define STCU_MBUFM_MBUFM168_WIDTH                (1U)
#define STCU_MBUFM_MBUFM168(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM168_SHIFT)) & STCU_MBUFM_MBUFM168_MASK)

#define STCU_MBUFM_MBUFM169_MASK                 (0x200U)
#define STCU_MBUFM_MBUFM169_SHIFT                (9U)
#define STCU_MBUFM_MBUFM169_WIDTH                (1U)
#define STCU_MBUFM_MBUFM169(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM169_SHIFT)) & STCU_MBUFM_MBUFM169_MASK)

#define STCU_MBUFM_MBUFM170_MASK                 (0x400U)
#define STCU_MBUFM_MBUFM170_SHIFT                (10U)
#define STCU_MBUFM_MBUFM170_WIDTH                (1U)
#define STCU_MBUFM_MBUFM170(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM170_SHIFT)) & STCU_MBUFM_MBUFM170_MASK)

#define STCU_MBUFM_MBUFM171_MASK                 (0x800U)
#define STCU_MBUFM_MBUFM171_SHIFT                (11U)
#define STCU_MBUFM_MBUFM171_WIDTH                (1U)
#define STCU_MBUFM_MBUFM171(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM171_SHIFT)) & STCU_MBUFM_MBUFM171_MASK)

#define STCU_MBUFM_MBUFM172_MASK                 (0x1000U)
#define STCU_MBUFM_MBUFM172_SHIFT                (12U)
#define STCU_MBUFM_MBUFM172_WIDTH                (1U)
#define STCU_MBUFM_MBUFM172(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM172_SHIFT)) & STCU_MBUFM_MBUFM172_MASK)

#define STCU_MBUFM_MBUFM173_MASK                 (0x2000U)
#define STCU_MBUFM_MBUFM173_SHIFT                (13U)
#define STCU_MBUFM_MBUFM173_WIDTH                (1U)
#define STCU_MBUFM_MBUFM173(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM173_SHIFT)) & STCU_MBUFM_MBUFM173_MASK)

#define STCU_MBUFM_MBUFM174_MASK                 (0x4000U)
#define STCU_MBUFM_MBUFM174_SHIFT                (14U)
#define STCU_MBUFM_MBUFM174_WIDTH                (1U)
#define STCU_MBUFM_MBUFM174(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM174_SHIFT)) & STCU_MBUFM_MBUFM174_MASK)

#define STCU_MBUFM_MBUFM175_MASK                 (0x8000U)
#define STCU_MBUFM_MBUFM175_SHIFT                (15U)
#define STCU_MBUFM_MBUFM175_WIDTH                (1U)
#define STCU_MBUFM_MBUFM175(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM175_SHIFT)) & STCU_MBUFM_MBUFM175_MASK)

#define STCU_MBUFM_MBUFM176_MASK                 (0x10000U)
#define STCU_MBUFM_MBUFM176_SHIFT                (16U)
#define STCU_MBUFM_MBUFM176_WIDTH                (1U)
#define STCU_MBUFM_MBUFM176(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM176_SHIFT)) & STCU_MBUFM_MBUFM176_MASK)

#define STCU_MBUFM_MBUFM177_MASK                 (0x20000U)
#define STCU_MBUFM_MBUFM177_SHIFT                (17U)
#define STCU_MBUFM_MBUFM177_WIDTH                (1U)
#define STCU_MBUFM_MBUFM177(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM177_SHIFT)) & STCU_MBUFM_MBUFM177_MASK)

#define STCU_MBUFM_MBUFM178_MASK                 (0x40000U)
#define STCU_MBUFM_MBUFM178_SHIFT                (18U)
#define STCU_MBUFM_MBUFM178_WIDTH                (1U)
#define STCU_MBUFM_MBUFM178(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM178_SHIFT)) & STCU_MBUFM_MBUFM178_MASK)

#define STCU_MBUFM_MBUFM179_MASK                 (0x80000U)
#define STCU_MBUFM_MBUFM179_SHIFT                (19U)
#define STCU_MBUFM_MBUFM179_WIDTH                (1U)
#define STCU_MBUFM_MBUFM179(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM179_SHIFT)) & STCU_MBUFM_MBUFM179_MASK)

