zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBUFM_MBUFM180_MASK                 (0x100000U)
#define STCU_MBUFM_MBUFM180_SHIFT                (20U)
#define STCU_MBUFM_MBUFM180_WIDTH                (1U)
#define STCU_MBUFM_MBUFM180(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM180_SHIFT)) & STCU_MBUFM_MBUFM180_MASK)

#define STCU_MBUFM_MBUFM181_MASK                 (0x200000U)
#define STCU_MBUFM_MBUFM181_SHIFT                (21U)
#define STCU_MBUFM_MBUFM181_WIDTH                (1U)
#define STCU_MBUFM_MBUFM181(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM181_SHIFT)) & STCU_MBUFM_MBUFM181_MASK)

#define STCU_MBUFM_MBUFM182_MASK                 (0x400000U)
#define STCU_MBUFM_MBUFM182_SHIFT                (22U)
#define STCU_MBUFM_MBUFM182_WIDTH                (1U)
#define STCU_MBUFM_MBUFM182(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM182_SHIFT)) & STCU_MBUFM_MBUFM182_MASK)

#define STCU_MBUFM_MBUFM183_MASK                 (0x800000U)
#define STCU_MBUFM_MBUFM183_SHIFT                (23U)
#define STCU_MBUFM_MBUFM183_WIDTH                (1U)
#define STCU_MBUFM_MBUFM183(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM183_SHIFT)) & STCU_MBUFM_MBUFM183_MASK)

#define STCU_MBUFM_MBUFM184_MASK                 (0x1000000U)
#define STCU_MBUFM_MBUFM184_SHIFT                (24U)
#define STCU_MBUFM_MBUFM184_WIDTH                (1U)
#define STCU_MBUFM_MBUFM184(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM184_SHIFT)) & STCU_MBUFM_MBUFM184_MASK)

#define STCU_MBUFM_MBUFM185_MASK                 (0x2000000U)
#define STCU_MBUFM_MBUFM185_SHIFT                (25U)
#define STCU_MBUFM_MBUFM185_WIDTH                (1U)
#define STCU_MBUFM_MBUFM185(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM185_SHIFT)) & STCU_MBUFM_MBUFM185_MASK)

#define STCU_MBUFM_MBUFM186_MASK                 (0x4000000U)
#define STCU_MBUFM_MBUFM186_SHIFT                (26U)
#define STCU_MBUFM_MBUFM186_WIDTH                (1U)
#define STCU_MBUFM_MBUFM186(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM186_SHIFT)) & STCU_MBUFM_MBUFM186_MASK)

#define STCU_MBUFM_MBUFM187_MASK                 (0x8000000U)
#define STCU_MBUFM_MBUFM187_SHIFT                (27U)
#define STCU_MBUFM_MBUFM187_WIDTH                (1U)
#define STCU_MBUFM_MBUFM187(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM187_SHIFT)) & STCU_MBUFM_MBUFM187_MASK)

#define STCU_MBUFM_MBUFM188_MASK                 (0x10000000U)
#define STCU_MBUFM_MBUFM188_SHIFT                (28U)
#define STCU_MBUFM_MBUFM188_WIDTH                (1U)
#define STCU_MBUFM_MBUFM188(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM188_SHIFT)) & STCU_MBUFM_MBUFM188_MASK)

#define STCU_MBUFM_MBUFM189_MASK                 (0x20000000U)
#define STCU_MBUFM_MBUFM189_SHIFT                (29U)
#define STCU_MBUFM_MBUFM189_WIDTH                (1U)
#define STCU_MBUFM_MBUFM189(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM189_SHIFT)) & STCU_MBUFM_MBUFM189_MASK)

#define STCU_MBUFM_MBUFM190_MASK                 (0x40000000U)
#define STCU_MBUFM_MBUFM190_SHIFT                (30U)
#define STCU_MBUFM_MBUFM190_WIDTH                (1U)
#define STCU_MBUFM_MBUFM190(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM190_SHIFT)) & STCU_MBUFM_MBUFM190_MASK)

#define STCU_MBUFM_MBUFM191_MASK                 (0x80000000U)
#define STCU_MBUFM_MBUFM191_SHIFT                (31U)
#define STCU_MBUFM_MBUFM191_WIDTH                (1U)
#define STCU_MBUFM_MBUFM191(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM191_SHIFT)) & STCU_MBUFM_MBUFM191_MASK)

#define STCU_MBUFM_MBUFM192_MASK                 (0x1U)
#define STCU_MBUFM_MBUFM192_SHIFT                (0U)
#define STCU_MBUFM_MBUFM192_WIDTH                (1U)
#define STCU_MBUFM_MBUFM192(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM192_SHIFT)) & STCU_MBUFM_MBUFM192_MASK)

#define STCU_MBUFM_MBUFM193_MASK                 (0x2U)
#define STCU_MBUFM_MBUFM193_SHIFT                (1U)
#define STCU_MBUFM_MBUFM193_WIDTH                (1U)
#define STCU_MBUFM_MBUFM193(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM193_SHIFT)) & STCU_MBUFM_MBUFM193_MASK)

#define STCU_MBUFM_MBUFM194_MASK                 (0x4U)
#define STCU_MBUFM_MBUFM194_SHIFT                (2U)
#define STCU_MBUFM_MBUFM194_WIDTH                (1U)
#define STCU_MBUFM_MBUFM194(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM194_SHIFT)) & STCU_MBUFM_MBUFM194_MASK)

#define STCU_MBUFM_MBUFM195_MASK                 (0x8U)
#define STCU_MBUFM_MBUFM195_SHIFT                (3U)
#define STCU_MBUFM_MBUFM195_WIDTH                (1U)
#define STCU_MBUFM_MBUFM195(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM195_SHIFT)) & STCU_MBUFM_MBUFM195_MASK)

#define STCU_MBUFM_MBUFM196_MASK                 (0x10U)
#define STCU_MBUFM_MBUFM196_SHIFT                (4U)
#define STCU_MBUFM_MBUFM196_WIDTH                (1U)
#define STCU_MBUFM_MBUFM196(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM196_SHIFT)) & STCU_MBUFM_MBUFM196_MASK)

#define STCU_MBUFM_MBUFM197_MASK                 (0x20U)
#define STCU_MBUFM_MBUFM197_SHIFT                (5U)
#define STCU_MBUFM_MBUFM197_WIDTH                (1U)
#define STCU_MBUFM_MBUFM197(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM197_SHIFT)) & STCU_MBUFM_MBUFM197_MASK)

#define STCU_MBUFM_MBUFM198_MASK                 (0x40U)
#define STCU_MBUFM_MBUFM198_SHIFT                (6U)
#define STCU_MBUFM_MBUFM198_WIDTH                (1U)
#define STCU_MBUFM_MBUFM198(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM198_SHIFT)) & STCU_MBUFM_MBUFM198_MASK)

#define STCU_MBUFM_MBUFM199_MASK                 (0x80U)
#define STCU_MBUFM_MBUFM199_SHIFT                (7U)
#define STCU_MBUFM_MBUFM199_WIDTH                (1U)
#define STCU_MBUFM_MBUFM199(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM199_SHIFT)) & STCU_MBUFM_MBUFM199_MASK)

#define STCU_MBUFM_MBUFM200_MASK                 (0x100U)
#define STCU_MBUFM_MBUFM200_SHIFT                (8U)
#define STCU_MBUFM_MBUFM200_WIDTH                (1U)
#define STCU_MBUFM_MBUFM200(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM200_SHIFT)) & STCU_MBUFM_MBUFM200_MASK)

#define STCU_MBUFM_MBUFM201_MASK                 (0x200U)
#define STCU_MBUFM_MBUFM201_SHIFT                (9U)
#define STCU_MBUFM_MBUFM201_WIDTH                (1U)
#define STCU_MBUFM_MBUFM201(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM201_SHIFT)) & STCU_MBUFM_MBUFM201_MASK)

#define STCU_MBUFM_MBUFM202_MASK                 (0x400U)
#define STCU_MBUFM_MBUFM202_SHIFT                (10U)
#define STCU_MBUFM_MBUFM202_WIDTH                (1U)
#define STCU_MBUFM_MBUFM202(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM202_SHIFT)) & STCU_MBUFM_MBUFM202_MASK)

#define STCU_MBUFM_MBUFM203_MASK                 (0x800U)
#define STCU_MBUFM_MBUFM203_SHIFT                (11U)
#define STCU_MBUFM_MBUFM203_WIDTH                (1U)
#define STCU_MBUFM_MBUFM203(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM203_SHIFT)) & STCU_MBUFM_MBUFM203_MASK)

