zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBUFM_MBUFM204_MASK                 (0x1000U)
#define STCU_MBUFM_MBUFM204_SHIFT                (12U)
#define STCU_MBUFM_MBUFM204_WIDTH                (1U)
#define STCU_MBUFM_MBUFM204(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM204_SHIFT)) & STCU_MBUFM_MBUFM204_MASK)

#define STCU_MBUFM_MBUFM205_MASK                 (0x2000U)
#define STCU_MBUFM_MBUFM205_SHIFT                (13U)
#define STCU_MBUFM_MBUFM205_WIDTH                (1U)
#define STCU_MBUFM_MBUFM205(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM205_SHIFT)) & STCU_MBUFM_MBUFM205_MASK)

#define STCU_MBUFM_MBUFM206_MASK                 (0x4000U)
#define STCU_MBUFM_MBUFM206_SHIFT                (14U)
#define STCU_MBUFM_MBUFM206_WIDTH                (1U)
#define STCU_MBUFM_MBUFM206(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM206_SHIFT)) & STCU_MBUFM_MBUFM206_MASK)

#define STCU_MBUFM_MBUFM207_MASK                 (0x8000U)
#define STCU_MBUFM_MBUFM207_SHIFT                (15U)
#define STCU_MBUFM_MBUFM207_WIDTH                (1U)
#define STCU_MBUFM_MBUFM207(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM207_SHIFT)) & STCU_MBUFM_MBUFM207_MASK)

#define STCU_MBUFM_MBUFM208_MASK                 (0x10000U)
#define STCU_MBUFM_MBUFM208_SHIFT                (16U)
#define STCU_MBUFM_MBUFM208_WIDTH                (1U)
#define STCU_MBUFM_MBUFM208(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM208_SHIFT)) & STCU_MBUFM_MBUFM208_MASK)

#define STCU_MBUFM_MBUFM209_MASK                 (0x20000U)
#define STCU_MBUFM_MBUFM209_SHIFT                (17U)
#define STCU_MBUFM_MBUFM209_WIDTH                (1U)
#define STCU_MBUFM_MBUFM209(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM209_SHIFT)) & STCU_MBUFM_MBUFM209_MASK)

#define STCU_MBUFM_MBUFM210_MASK                 (0x40000U)
#define STCU_MBUFM_MBUFM210_SHIFT                (18U)
#define STCU_MBUFM_MBUFM210_WIDTH                (1U)
#define STCU_MBUFM_MBUFM210(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM210_SHIFT)) & STCU_MBUFM_MBUFM210_MASK)

#define STCU_MBUFM_MBUFM211_MASK                 (0x80000U)
#define STCU_MBUFM_MBUFM211_SHIFT                (19U)
#define STCU_MBUFM_MBUFM211_WIDTH                (1U)
#define STCU_MBUFM_MBUFM211(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM211_SHIFT)) & STCU_MBUFM_MBUFM211_MASK)

#define STCU_MBUFM_MBUFM212_MASK                 (0x100000U)
#define STCU_MBUFM_MBUFM212_SHIFT                (20U)
#define STCU_MBUFM_MBUFM212_WIDTH                (1U)
#define STCU_MBUFM_MBUFM212(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM212_SHIFT)) & STCU_MBUFM_MBUFM212_MASK)

#define STCU_MBUFM_MBUFM213_MASK                 (0x200000U)
#define STCU_MBUFM_MBUFM213_SHIFT                (21U)
#define STCU_MBUFM_MBUFM213_WIDTH                (1U)
#define STCU_MBUFM_MBUFM213(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM213_SHIFT)) & STCU_MBUFM_MBUFM213_MASK)

#define STCU_MBUFM_MBUFM214_MASK                 (0x400000U)
#define STCU_MBUFM_MBUFM214_SHIFT                (22U)
#define STCU_MBUFM_MBUFM214_WIDTH                (1U)
#define STCU_MBUFM_MBUFM214(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM214_SHIFT)) & STCU_MBUFM_MBUFM214_MASK)

#define STCU_MBUFM_MBUFM215_MASK                 (0x800000U)
#define STCU_MBUFM_MBUFM215_SHIFT                (23U)
#define STCU_MBUFM_MBUFM215_WIDTH                (1U)
#define STCU_MBUFM_MBUFM215(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM215_SHIFT)) & STCU_MBUFM_MBUFM215_MASK)

#define STCU_MBUFM_MBUFM216_MASK                 (0x1000000U)
#define STCU_MBUFM_MBUFM216_SHIFT                (24U)
#define STCU_MBUFM_MBUFM216_WIDTH                (1U)
#define STCU_MBUFM_MBUFM216(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM216_SHIFT)) & STCU_MBUFM_MBUFM216_MASK)

#define STCU_MBUFM_MBUFM217_MASK                 (0x2000000U)
#define STCU_MBUFM_MBUFM217_SHIFT                (25U)
#define STCU_MBUFM_MBUFM217_WIDTH                (1U)
#define STCU_MBUFM_MBUFM217(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM217_SHIFT)) & STCU_MBUFM_MBUFM217_MASK)

#define STCU_MBUFM_MBUFM218_MASK                 (0x4000000U)
#define STCU_MBUFM_MBUFM218_SHIFT                (26U)
#define STCU_MBUFM_MBUFM218_WIDTH                (1U)
#define STCU_MBUFM_MBUFM218(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM218_SHIFT)) & STCU_MBUFM_MBUFM218_MASK)

#define STCU_MBUFM_MBUFM219_MASK                 (0x8000000U)
#define STCU_MBUFM_MBUFM219_SHIFT                (27U)
#define STCU_MBUFM_MBUFM219_WIDTH                (1U)
#define STCU_MBUFM_MBUFM219(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM219_SHIFT)) & STCU_MBUFM_MBUFM219_MASK)

#define STCU_MBUFM_MBUFM220_MASK                 (0x10000000U)
#define STCU_MBUFM_MBUFM220_SHIFT                (28U)
#define STCU_MBUFM_MBUFM220_WIDTH                (1U)
#define STCU_MBUFM_MBUFM220(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM220_SHIFT)) & STCU_MBUFM_MBUFM220_MASK)

#define STCU_MBUFM_MBUFM221_MASK                 (0x20000000U)
#define STCU_MBUFM_MBUFM221_SHIFT                (29U)
#define STCU_MBUFM_MBUFM221_WIDTH                (1U)
#define STCU_MBUFM_MBUFM221(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM221_SHIFT)) & STCU_MBUFM_MBUFM221_MASK)

#define STCU_MBUFM_MBUFM222_MASK                 (0x40000000U)
#define STCU_MBUFM_MBUFM222_SHIFT                (30U)
#define STCU_MBUFM_MBUFM222_WIDTH                (1U)
#define STCU_MBUFM_MBUFM222(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM222_SHIFT)) & STCU_MBUFM_MBUFM222_MASK)

#define STCU_MBUFM_MBUFM223_MASK                 (0x80000000U)
#define STCU_MBUFM_MBUFM223_SHIFT                (31U)
#define STCU_MBUFM_MBUFM223_WIDTH                (1U)
#define STCU_MBUFM_MBUFM223(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM223_SHIFT)) & STCU_MBUFM_MBUFM223_MASK)

#define STCU_MBUFM_MBUFM224_MASK                 (0x1U)
#define STCU_MBUFM_MBUFM224_SHIFT                (0U)
#define STCU_MBUFM_MBUFM224_WIDTH                (1U)
#define STCU_MBUFM_MBUFM224(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM224_SHIFT)) & STCU_MBUFM_MBUFM224_MASK)

#define STCU_MBUFM_MBUFM225_MASK                 (0x2U)
#define STCU_MBUFM_MBUFM225_SHIFT                (1U)
#define STCU_MBUFM_MBUFM225_WIDTH                (1U)
#define STCU_MBUFM_MBUFM225(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM225_SHIFT)) & STCU_MBUFM_MBUFM225_MASK)

#define STCU_MBUFM_MBUFM226_MASK                 (0x4U)
#define STCU_MBUFM_MBUFM226_SHIFT                (2U)
#define STCU_MBUFM_MBUFM226_WIDTH                (1U)
#define STCU_MBUFM_MBUFM226(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM226_SHIFT)) & STCU_MBUFM_MBUFM226_MASK)

#define STCU_MBUFM_MBUFM227_MASK                 (0x8U)
#define STCU_MBUFM_MBUFM227_SHIFT                (3U)
#define STCU_MBUFM_MBUFM227_WIDTH                (1U)
#define STCU_MBUFM_MBUFM227(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM227_SHIFT)) & STCU_MBUFM_MBUFM227_MASK)

#define STCU_MBUFM_MBUFM228_MASK                 (0x10U)
#define STCU_MBUFM_MBUFM228_SHIFT                (4U)
#define STCU_MBUFM_MBUFM228_WIDTH                (1U)
#define STCU_MBUFM_MBUFM228(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM228_SHIFT)) & STCU_MBUFM_MBUFM228_MASK)

#define STCU_MBUFM_MBUFM229_MASK                 (0x20U)
#define STCU_MBUFM_MBUFM229_SHIFT                (5U)
#define STCU_MBUFM_MBUFM229_WIDTH                (1U)
#define STCU_MBUFM_MBUFM229(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM229_SHIFT)) & STCU_MBUFM_MBUFM229_MASK)

#define STCU_MBUFM_MBUFM230_MASK                 (0x40U)
#define STCU_MBUFM_MBUFM230_SHIFT                (6U)
#define STCU_MBUFM_MBUFM230_WIDTH                (1U)
#define STCU_MBUFM_MBUFM230(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM230_SHIFT)) & STCU_MBUFM_MBUFM230_MASK)

#define STCU_MBUFM_MBUFM231_MASK                 (0x80U)
#define STCU_MBUFM_MBUFM231_SHIFT                (7U)
#define STCU_MBUFM_MBUFM231_WIDTH                (1U)
#define STCU_MBUFM_MBUFM231(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM231_SHIFT)) & STCU_MBUFM_MBUFM231_MASK)

#define STCU_MBUFM_MBUFM232_MASK                 (0x100U)
#define STCU_MBUFM_MBUFM232_SHIFT                (8U)
#define STCU_MBUFM_MBUFM232_WIDTH                (1U)
#define STCU_MBUFM_MBUFM232(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM232_SHIFT)) & STCU_MBUFM_MBUFM232_MASK)

#define STCU_MBUFM_MBUFM233_MASK                 (0x200U)
#define STCU_MBUFM_MBUFM233_SHIFT                (9U)
#define STCU_MBUFM_MBUFM233_WIDTH                (1U)
#define STCU_MBUFM_MBUFM233(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM233_SHIFT)) & STCU_MBUFM_MBUFM233_MASK)

