zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K311_STCU.h
#define STCU_MBUFM_MBUFM234_MASK                 (0x400U)
#define STCU_MBUFM_MBUFM234_SHIFT                (10U)
#define STCU_MBUFM_MBUFM234_WIDTH                (1U)
#define STCU_MBUFM_MBUFM234(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM234_SHIFT)) & STCU_MBUFM_MBUFM234_MASK)

#define STCU_MBUFM_MBUFM235_MASK                 (0x800U)
#define STCU_MBUFM_MBUFM235_SHIFT                (11U)
#define STCU_MBUFM_MBUFM235_WIDTH                (1U)
#define STCU_MBUFM_MBUFM235(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM235_SHIFT)) & STCU_MBUFM_MBUFM235_MASK)

#define STCU_MBUFM_MBUFM236_MASK                 (0x1000U)
#define STCU_MBUFM_MBUFM236_SHIFT                (12U)
#define STCU_MBUFM_MBUFM236_WIDTH                (1U)
#define STCU_MBUFM_MBUFM236(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM236_SHIFT)) & STCU_MBUFM_MBUFM236_MASK)

#define STCU_MBUFM_MBUFM237_MASK                 (0x2000U)
#define STCU_MBUFM_MBUFM237_SHIFT                (13U)
#define STCU_MBUFM_MBUFM237_WIDTH                (1U)
#define STCU_MBUFM_MBUFM237(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM237_SHIFT)) & STCU_MBUFM_MBUFM237_MASK)

#define STCU_MBUFM_MBUFM238_MASK                 (0x4000U)
#define STCU_MBUFM_MBUFM238_SHIFT                (14U)
#define STCU_MBUFM_MBUFM238_WIDTH                (1U)
#define STCU_MBUFM_MBUFM238(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM238_SHIFT)) & STCU_MBUFM_MBUFM238_MASK)

#define STCU_MBUFM_MBUFM239_MASK                 (0x8000U)
#define STCU_MBUFM_MBUFM239_SHIFT                (15U)
#define STCU_MBUFM_MBUFM239_WIDTH                (1U)
#define STCU_MBUFM_MBUFM239(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM239_SHIFT)) & STCU_MBUFM_MBUFM239_MASK)

#define STCU_MBUFM_MBUFM240_MASK                 (0x10000U)
#define STCU_MBUFM_MBUFM240_SHIFT                (16U)
#define STCU_MBUFM_MBUFM240_WIDTH                (1U)
#define STCU_MBUFM_MBUFM240(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM240_SHIFT)) & STCU_MBUFM_MBUFM240_MASK)

#define STCU_MBUFM_MBUFM241_MASK                 (0x20000U)
#define STCU_MBUFM_MBUFM241_SHIFT                (17U)
#define STCU_MBUFM_MBUFM241_WIDTH                (1U)
#define STCU_MBUFM_MBUFM241(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM241_SHIFT)) & STCU_MBUFM_MBUFM241_MASK)

#define STCU_MBUFM_MBUFM242_MASK                 (0x40000U)
#define STCU_MBUFM_MBUFM242_SHIFT                (18U)
#define STCU_MBUFM_MBUFM242_WIDTH                (1U)
#define STCU_MBUFM_MBUFM242(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM242_SHIFT)) & STCU_MBUFM_MBUFM242_MASK)

#define STCU_MBUFM_MBUFM243_MASK                 (0x80000U)
#define STCU_MBUFM_MBUFM243_SHIFT                (19U)
#define STCU_MBUFM_MBUFM243_WIDTH                (1U)
#define STCU_MBUFM_MBUFM243(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM243_SHIFT)) & STCU_MBUFM_MBUFM243_MASK)

#define STCU_MBUFM_MBUFM244_MASK                 (0x100000U)
#define STCU_MBUFM_MBUFM244_SHIFT                (20U)
#define STCU_MBUFM_MBUFM244_WIDTH                (1U)
#define STCU_MBUFM_MBUFM244(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM244_SHIFT)) & STCU_MBUFM_MBUFM244_MASK)

#define STCU_MBUFM_MBUFM245_MASK                 (0x200000U)
#define STCU_MBUFM_MBUFM245_SHIFT                (21U)
#define STCU_MBUFM_MBUFM245_WIDTH                (1U)
#define STCU_MBUFM_MBUFM245(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM245_SHIFT)) & STCU_MBUFM_MBUFM245_MASK)

#define STCU_MBUFM_MBUFM246_MASK                 (0x400000U)
#define STCU_MBUFM_MBUFM246_SHIFT                (22U)
#define STCU_MBUFM_MBUFM246_WIDTH                (1U)
#define STCU_MBUFM_MBUFM246(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM246_SHIFT)) & STCU_MBUFM_MBUFM246_MASK)

#define STCU_MBUFM_MBUFM247_MASK                 (0x800000U)
#define STCU_MBUFM_MBUFM247_SHIFT                (23U)
#define STCU_MBUFM_MBUFM247_WIDTH                (1U)
#define STCU_MBUFM_MBUFM247(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM247_SHIFT)) & STCU_MBUFM_MBUFM247_MASK)

#define STCU_MBUFM_MBUFM248_MASK                 (0x1000000U)
#define STCU_MBUFM_MBUFM248_SHIFT                (24U)
#define STCU_MBUFM_MBUFM248_WIDTH                (1U)
#define STCU_MBUFM_MBUFM248(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM248_SHIFT)) & STCU_MBUFM_MBUFM248_MASK)

#define STCU_MBUFM_MBUFM249_MASK                 (0x2000000U)
#define STCU_MBUFM_MBUFM249_SHIFT                (25U)
#define STCU_MBUFM_MBUFM249_WIDTH                (1U)
#define STCU_MBUFM_MBUFM249(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM249_SHIFT)) & STCU_MBUFM_MBUFM249_MASK)

#define STCU_MBUFM_MBUFM250_MASK                 (0x4000000U)
#define STCU_MBUFM_MBUFM250_SHIFT                (26U)
#define STCU_MBUFM_MBUFM250_WIDTH                (1U)
#define STCU_MBUFM_MBUFM250(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM250_SHIFT)) & STCU_MBUFM_MBUFM250_MASK)

#define STCU_MBUFM_MBUFM251_MASK                 (0x8000000U)
#define STCU_MBUFM_MBUFM251_SHIFT                (27U)
#define STCU_MBUFM_MBUFM251_WIDTH                (1U)
#define STCU_MBUFM_MBUFM251(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM251_SHIFT)) & STCU_MBUFM_MBUFM251_MASK)

#define STCU_MBUFM_MBUFM252_MASK                 (0x10000000U)
#define STCU_MBUFM_MBUFM252_SHIFT                (28U)
#define STCU_MBUFM_MBUFM252_WIDTH                (1U)
#define STCU_MBUFM_MBUFM252(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM252_SHIFT)) & STCU_MBUFM_MBUFM252_MASK)

#define STCU_MBUFM_MBUFM253_MASK                 (0x20000000U)
#define STCU_MBUFM_MBUFM253_SHIFT                (29U)
#define STCU_MBUFM_MBUFM253_WIDTH                (1U)
#define STCU_MBUFM_MBUFM253(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM253_SHIFT)) & STCU_MBUFM_MBUFM253_MASK)

#define STCU_MBUFM_MBUFM254_MASK                 (0x40000000U)
#define STCU_MBUFM_MBUFM254_SHIFT                (30U)
#define STCU_MBUFM_MBUFM254_WIDTH                (1U)
#define STCU_MBUFM_MBUFM254(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM254_SHIFT)) & STCU_MBUFM_MBUFM254_MASK)

#define STCU_MBUFM_MBUFM255_MASK                 (0x80000000U)
#define STCU_MBUFM_MBUFM255_SHIFT                (31U)
#define STCU_MBUFM_MBUFM255_WIDTH                (1U)
#define STCU_MBUFM_MBUFM255(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM_MBUFM255_SHIFT)) & STCU_MBUFM_MBUFM255_MASK)
/*! @} */

/*! @name CTRL - STCU2 LBIST Control */
/*! @{ */

#define STCU_CTRL_CWS_MASK                       (0x3FU)
#define STCU_CTRL_CWS_SHIFT                      (0U)
#define STCU_CTRL_CWS_WIDTH                      (6U)
#define STCU_CTRL_CWS(x)                         (((uint32_t)(((uint32_t)(x)) << STCU_CTRL_CWS_SHIFT)) & STCU_CTRL_CWS_MASK)

